#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_DDWLeg

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


SDK_NAMESPACE_START

// AnimBlueprintGeneratedClass ABP_DDWLeg.ABP_DDWLeg_C
// 0x0178 (0x04D0 - 0x0358)
class UABP_DDWLeg_C final : public UAnimInstance
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_976F71D0443E7D3A6F09FABF16E9F6D1; // 0x0368(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_148EA8404A7847867ADFE9951256A06B; // 0x03B0(0x00B0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_0D2D19B340C0072230A566B09CCC7FAA; // 0x0460(0x0070)()

public:
	void ExecuteUbergraph_ABP_DDWLeg(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_DDWLeg_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_DDWLeg_C")
	}
	static class UABP_DDWLeg_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_DDWLeg_C>();
	}
};
DUMPER7_ASSERTS_UABP_DDWLeg_C;

SDK_NAMESPACE_END
