#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AJBInstantWall

#include "Basic.hpp"

#include "AJB_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


SDK_NAMESPACE_START

// AnimBlueprintGeneratedClass ABP_AJBInstantWall.ABP_AJBInstantWall_C
// 0x0540 (0x0898 - 0x0358)
class UABP_AJBInstantWall_C final : public UAnimInstance
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_38E365E84C671342D2E87197AEFD55EE; // 0x0368(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_356F93B9432329148E548A9353A1E2E4; // 0x03B0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_31A66DFF429CF1C05CE4E3A71145B8D4; // 0x03F8(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_CB7E527A4E585CD035EE59B018662F48; // 0x0440(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_16D153AE465F17BBAB0C06AC3D8D22FE; // 0x04B0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1B3561C046B7CED23418F29D3611F0F7; // 0x04F8(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_D6F410154BDCC0EA3B88738CD7D1F087; // 0x05A8(0x0048)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_52FC07CC436D56A0244247B2B97B2176; // 0x05F0(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_1D0481CE4644D22DFA2880AFFC73CC1B; // 0x0660(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_49E9BE6146554FE8799613BD26739F6D; // 0x06A8(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_60ADCB9144AC1BCC5AB96C9151DAF18C; // 0x0758(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_B78E4E624166655190D3038B25F98D69; // 0x07A0(0x00E0)()
	EPlacementState                               State;                                             // 0x0880(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_881[0x7];                                      // 0x0881(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      AS_Make;                                           // 0x0888(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PlayTimeMax;                                       // 0x0890(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PlayTime;                                          // 0x0894(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ABP_AJBInstantWall(int32 EntryPoint);
	void BlueprintBeginPlay();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInstantWall_AnimGraphNode_TransitionResult_31A66DFF429CF1C05CE4E3A71145B8D4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInstantWall_AnimGraphNode_TransitionResult_356F93B9432329148E548A9353A1E2E4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInstantWall_AnimGraphNode_SequenceEvaluator_52FC07CC436D56A0244247B2B97B2176();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_AJBInstantWall_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_AJBInstantWall_C")
	}
	static class UABP_AJBInstantWall_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_AJBInstantWall_C>();
	}
};
DUMPER7_ASSERTS_UABP_AJBInstantWall_C;

SDK_NAMESPACE_END
