#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AJBIngameSub_Movement

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "AJB_structs.hpp"


SDK_NAMESPACE_START

// AnimBlueprintGeneratedClass ABP_AJBIngameSub_Movement.ABP_AJBIngameSub_Movement_C
// 0x2BB8 (0x2F10 - 0x0358)
class UABP_AJBIngameSub_Movement_C : public UAnimInstance
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_7891F5B64C44F48C8D2610B064EC28CB; // 0x0368(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_078FBD924F2C3638F6F4339A45751A32; // 0x03B0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1F53304D440F1310ADFBDA8C4B86C7B5; // 0x03F8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_59EEC15B433515FEEEEC66933B49A46F; // 0x0440(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_F370D65649AA13CCEC99BB8C521D31F5; // 0x0488(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1021A74B4CC397958E7BFEA1EACA1DF7; // 0x04D0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_23474C984ABCCA2FDA236DA975613FE8; // 0x0518(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_BB4BA4AE4C3CF8E1FB1D19BE224BE149; // 0x0560(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6CDB09B1417B0022CF7CBEBEEF766212; // 0x05A8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2798BDA64166774A07D26DBEC90AB628; // 0x05F0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2BD35E444084819BEB4E5CBCBE121C44; // 0x0638(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_F58696A14156755F7B2C43AC874DD948; // 0x0680(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_E5C0DB7144F57C9794A78D9B4E50C5E7; // 0x06C8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_72808EEA447AB9C169597085B2B2411C; // 0x0710(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_4ECEF7134518B1287803978D4914EE0D; // 0x07C0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1A600FE240F75A61765C8BAC9C7AB5F1; // 0x0808(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_D00B70AE47125292E959D28D5F122A80; // 0x0850(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_506CFC034B3A887071C4E9AC6B97E67E; // 0x0900(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7F8128F34B45634CE6B29A957217D566; // 0x0948(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_92E4D4004EFEF7DEAB6CE2A63793E21D; // 0x09F8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_BB2CC259408CC0901FBF659BA1658439; // 0x0A40(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_E1B7499240231AA6117336932771EE83; // 0x0A88(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_53D7FB864807FBAF82B8F682FC733715; // 0x0AD0(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_CE107DC543D5F8AB4038FF879FDD4D03; // 0x0B80(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_403A9DE446656ADB4C4DBD929574CAF5; // 0x0BC8(0x0128)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_7726C6ED429D25D58C900A9E1B3C66B9; // 0x0CF0(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_B37F3E114D015B1699F05F925EA7CE54; // 0x0D38(0x00E0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_3D1D63C349B37FB47B5D15A0B1867E6F; // 0x0E18(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_507B12E94DA27708094D6285E8DC7D3A; // 0x0E60(0x00E0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_CA47F73A4F57F5CD7381B097610C15C9; // 0x0F40(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_FE5001C34C6E42E0E0BD1C8EB12EE3BF; // 0x0F88(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_FE7C3DB041A7E847BEF3E2AEB374C343; // 0x0FD0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_E911F90B423DFAB1A6330A83270F601C; // 0x1018(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_946F41F345AC01A2FB0CE7A4850DE9AB; // 0x1060(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_043D2342421C3A50F5A54C95114A5265; // 0x10A8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_88B5E8654E693B91A16D1F87EE3A128F; // 0x10F0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3A0C097E41B32C31D948FA8C87B92959; // 0x1138(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_728C520D40230BF1854C3F920960AEF8; // 0x1180(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_77A7C3DF4948EE4E87F59B9483868FB0; // 0x11C8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_36C0E6C5418C06E42A4C9BB8A55467DC; // 0x1210(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_20DB4EB64761702F039FE4A05F75A248; // 0x1258(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_89D660A1479A66B23411AB9D9FFBB68A; // 0x12A0(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_87A7DB7A4DA9E32F724E2DBA34B1FED2; // 0x1350(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1597F406442F97DB04D4CA8A537AFF9D; // 0x1398(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_A6E1CC9D4B0BB055AD78BE88AF3FE22E; // 0x1448(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_793A56A0417A853C56FFAA8238ADC84E; // 0x1490(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_069046454FFC36EC8EB940B90910314F; // 0x14D8(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_2AE84C484EC9C5C72A1ECC8C087BB53F; // 0x1520(0x0128)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_D8C9DF4B43AED94E8E4A5CB6700948FD; // 0x1648(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6C08981A4FA4C7A47C8864BF84BCDE29; // 0x1690(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_F3E9AFDB4693A93662574C82B79EA8B8; // 0x16D8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_10C00DC44744D239F2B233AFD569E85A; // 0x1720(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_C0477468481EA76FC93BA4852A302BA1; // 0x17D0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6C0B729145D9D9FE38B798BDA575F9D7; // 0x1818(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_C0765A12428000C66EC7FD815CC49BF9; // 0x18C8(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_5DF57C9041AE6472A2EB42B2C4CC9B2A; // 0x1910(0x00E0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_C91F95574438221F0876DC814890E5C5; // 0x19F0(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_E82D0D184D786EACD997F3B3479B7527; // 0x1A38(0x00E0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_2204B5F24EDC80D5ECB35F9E1C3AEC51; // 0x1B18(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_EA8C6B134EA8DF147580928E07009F8A; // 0x1B60(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_0F171EDF4BDAC740B2C917B0B0A07465; // 0x1C10(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_27344C3B41111043F49D0E9A95FF1CF1; // 0x1C58(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_0493AAB845D7636BD23CB5AFD7BFF77B; // 0x1CA0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_CCF7D2984C930BFF5D37A1A9026DF93A; // 0x1CE8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_CE112C324C4C6676C784239B97B0FC1A; // 0x1D30(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_D90101E249E0AC309AC4F3966718D3B0; // 0x1D78(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_913FA48748D9B4EAD6C69FB2C04C53E8; // 0x1DC0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_060395754300E8F01EFBE080A23BF273; // 0x1E08(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1736A16F42B6A6DBC519E695A861A4FF; // 0x1E50(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3D2F20E64F6F22F62D541A8B2AAE74BB; // 0x1E98(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_E61002814F0CC5686E5CFD8FF8C83E27; // 0x1F48(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9A11EA094BCC7998CA3E2FAA6A591635; // 0x1F90(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_394363AC463C8A35AA3894AC741D0BF3; // 0x2040(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_4FEE7145428F98CCE4B01680A1481F3D; // 0x2088(0x00E0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_33B611F84887FFC0D3460BB11E7CFCF1; // 0x2168(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_DD25F6734606AAB3A5024B8C869F80A2; // 0x21B0(0x0128)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_0DD44B2645505AF519196A8CE92748DA; // 0x22D8(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_99A028DA4D7165300AD995B68901B9A0; // 0x2320(0x0128)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_87C52A3E41A43D316A3D5D8D78AEF8F4; // 0x2448(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12B8B3B2419BA9F3987D3698F832743B; // 0x2490(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6CE2423E494C05444B27C28C9A6A80AB; // 0x24D8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_11CA7E3C4129A37A00DE08975054C47B; // 0x2520(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_4AF7CA034CB5F0FAA8003594E092F028; // 0x25D0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_204AB2F64F5CF2A04E28E7A51F6863EC; // 0x2618(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_6CB0BFA444407E7BFBCE3CA9180618FF; // 0x26C8(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_FA794BA44D0363B67C381B832FF9BF9F; // 0x2710(0x00E0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_34BF284447180D4E9D1083A7BA4C78C7; // 0x27F0(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_26768F1041368B1B9B1AD5B5C2844184; // 0x2838(0x00E0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_90F4544241A76A9F40CD3F8029450FA5; // 0x2918(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_FCF6D3444839BF57F9CF828724B1E307; // 0x2960(0x00E0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_E68E261945509A81D6B648B672A1C3BA; // 0x2A40(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_C2B609234A6A5891587D06871E050901; // 0x2A88(0x00E0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_C2ADE2E0424EB4C9E4E1E3AAC3A9C928; // 0x2B68(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_249B685047D76A7CFD019896636FC9D7; // 0x2C48(0x0050)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_30DE035A44D184CC4B9E259FFEF3B225; // 0x2C98(0x00B0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_69F6E0164CF3ED3D825581A1A7814FB4; // 0x2D48(0x00E0)()
	bool                                          bIsWalk;                                           // 0x2E28(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsRun;                                            // 0x2E29(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsDash;                                           // 0x2E2A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsCrouch;                                         // 0x2E2B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsInAir;                                          // 0x2E2C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bAnyMontagePlaying;                                // 0x2E2D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bSpecialIdle;                                      // 0x2E2E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bSpecialCIdle;                                     // 0x2E2F(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bSpecialDash;                                      // 0x2E30(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E31[0x3];                                     // 0x2E31(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MovementRate;                                      // 0x2E34(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MovementVectorForward_RootBoneSpace;               // 0x2E38(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MovementVectorRight_RootBoneSpace;                 // 0x2E3C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterBehavior                            CharacterBehavior;                                 // 0x2E40(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E41[0x7];                                     // 0x2E41(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          AS_Idle;                                           // 0x2E48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          AS_CIdle;                                          // 0x2E50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          AS_SPIdle;                                         // 0x2E58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          AS_SPCIdle;                                        // 0x2E60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      AS_SPDash;                                         // 0x2E68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpaceBase*                        BS_Walk;                                           // 0x2E70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpaceBase*                        BS_CWalk;                                          // 0x2E78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpaceBase*                        BS_Run;                                            // 0x2E80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      AS_Dash;                                           // 0x2E88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      AS_DeathLoop;                                      // 0x2E90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TargetForward;                                     // 0x2E98(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TargetRight;                                       // 0x2E9C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSidling;                                        // 0x2EA0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2EA1[0x3];                                     // 0x2EA1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MovementVectorForward_CameraSpace;                 // 0x2EA4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MovementVectorRight_CameraSpace;                   // 0x2EA8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDuringTheWorld;                                   // 0x2EAC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2EAD[0x3];                                     // 0x2EAD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      AS_JumpStart;                                      // 0x2EB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      AS_JumpEnd;                                        // 0x2EB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      AS_JumpLoop;                                       // 0x2EC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               OwnerCharacter;                                    // 0x2EC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      AS_DownStart;                                      // 0x2ED0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      AS_DownEnd;                                        // 0x2ED8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      AS_DownLoop;                                       // 0x2EE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpaceBase*                        BS_DWalk;                                          // 0x2EE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bBlendUpperToWalkOnSPIdle;                         // 0x2EF0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bBlendUpperToRunOnSPIdle;                          // 0x2EF1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bBlendUpperToCrouchOnSPIdle;                       // 0x2EF2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bBlendUpperToJumpOnSPIdle;                         // 0x2EF3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         BlendWeightSpecialIdle;                            // 0x2EF4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bBlendUpperToJumpEndOnSPIdle;                      // 0x2EF8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2EF9[0x3];                                     // 0x2EF9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InterpSpeedSpecialIdle;                            // 0x2EFC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIgnoreUpdateSpceialDashOnTick;                    // 0x2F00(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsJumpEnd;                                        // 0x2F01(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2F02[0x2];                                     // 0x2F02(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         JumpEndTime;                                       // 0x2F04(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bStopCheckByWalkingState;                          // 0x2F08(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBIngameSub_Movement_AnimGraphNode_BlendSpacePlayer_403A9DE446656ADB4C4DBD929574CAF5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBIngameSub_Movement_AnimGraphNode_SequencePlayer_53D7FB864807FBAF82B8F682FC733715();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBIngameSub_Movement_AnimGraphNode_TransitionResult_E1B7499240231AA6117336932771EE83();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBIngameSub_Movement_AnimGraphNode_TransitionResult_BB2CC259408CC0901FBF659BA1658439();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBIngameSub_Movement_AnimGraphNode_SequencePlayer_7F8128F34B45634CE6B29A957217D566();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBIngameSub_Movement_AnimGraphNode_TransitionResult_F58696A14156755F7B2C43AC874DD948();
