#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AJBPostProcessHuman_RBControlled_ABD

#include "Basic.hpp"

#include "ImmediatePhysics_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "AJB_structs.hpp"


SDK_NAMESPACE_START

// AnimBlueprintGeneratedClass ABP_AJBPostProcessHuman_RBControlled_ABD.ABP_AJBPostProcessHuman_RBControlled_ABD_C
// 0x06F8 (0x0A50 - 0x0358)
class UABP_AJBPostProcessHuman_RBControlled_ABD_C final : public UAnimInstance
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_724E743C46161EA15951919CCADDC338; // 0x0368(0x0048)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_C8A3881443283D1A13208A91F5BF798D; // 0x03B0(0x05A0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_947393984781FE2D2C552BB317B8B9B3; // 0x0950(0x0048)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_FE34CB0641526F815C555F9C0F8B9BC7; // 0x0998(0x0048)()
	struct FAnimNode_SubInput                     AnimGraphNode_SubInput_808810524AE7ED998EFBC2BDC92970CF; // 0x09E0(0x0068)()
	bool                                          bDisableRigidBodyByJump;                           // 0x0A48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bDisableRigidBodyByChangeWalkingState;             // 0x0A49(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bDisableRigidBodyByCrouch;                         // 0x0A4A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bDisableRigidBodyByDirection;                      // 0x0A4B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD(int32 EntryPoint);
	void OnJump();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_ABD_AnimGraphNode_RigidBody_C8A3881443283D1A13208A91F5BF798D();
	void BlueprintUpdateAnimation(float DeltaTimeX);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_AJBPostProcessHuman_RBControlled_ABD_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_AJBPostProcessHuman_RBControlled_ABD_C")
	}
	static class UABP_AJBPostProcessHuman_RBControlled_ABD_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_AJBPostProcessHuman_RBControlled_ABD_C>();
	}
};
DUMPER7_ASSERTS_UABP_AJBPostProcessHuman_RBControlled_ABD_C;

SDK_NAMESPACE_END
