#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AJBInGameCharacter_FGO

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


SDK_NAMESPACE_START

// AnimBlueprintGeneratedClass ABP_AJBInGameCharacter_FGO.ABP_AJBInGameCharacter_FGO_C
// 0x04F8 (0x0850 - 0x0358)
class UABP_AJBInGameCharacter_FGO_C final : public UAnimInstance
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_67B9539D4A437A0314373684A162BE4A; // 0x0368(0x0048)()
	class UAnimSequenceBase*                      __SUBINSTANCE_AS_JumpLoop_D8141EA545015988315C6696900D71B2; // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __SUBINSTANCE_AS_JumpStart_D8141EA545015988315C6696900D71B2; // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __SUBINSTANCE_AS_DeathLoop_D8141EA545015988315C6696900D71B2; // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __SUBINSTANCE_AS_Dash_D8141EA545015988315C6696900D71B2; // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpaceBase*                        __SUBINSTANCE_BS_Run_D8141EA545015988315C6696900D71B2; // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpaceBase*                        __SUBINSTANCE_BS_Walk_D8141EA545015988315C6696900D71B2; // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          __SUBINSTANCE_AS_CIdle_D8141EA545015988315C6696900D71B2; // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          __SUBINSTANCE_AS_Idle_D8141EA545015988315C6696900D71B2; // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNode_SubInstance                  AnimGraphNode_SubInstance_D8141EA545015988315C6696900D71B2; // 0x03F0(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_F9BF35644253C5487308C0BAF37F65C1; // 0x04B8(0x0070)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_215330854C0C29525107E4B849A2ABD3; // 0x0528(0x00E0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_6A7F86BC474DCFACE184898EE426FF36; // 0x0608(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_452B8F504B84ED4D8EC30CBD5864F779; // 0x06E8(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_EEE16358482D6DC4A4C5D8BCDD189C3C; // 0x0738(0x0050)()
	struct FAnimNode_SubInstance                  AnimGraphNode_SubInstance_BA6A558A471AE517A6E33BABC511F96E; // 0x0788(0x00C8)()

public:
	void ExecuteUbergraph_ABP_AJBInGameCharacter_FGO(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_AJBInGameCharacter_FGO_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_AJBInGameCharacter_FGO_C")
	}
	static class UABP_AJBInGameCharacter_FGO_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_AJBInGameCharacter_FGO_C>();
	}
};
DUMPER7_ASSERTS_UABP_AJBInGameCharacter_FGO_C;

SDK_NAMESPACE_END
