#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AJBInGameStand_KCR

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


SDK_NAMESPACE_START

// AnimBlueprintGeneratedClass ABP_AJBInGameStand_KCR.ABP_AJBInGameStand_KCR_C
// 0x0700 (0x0A58 - 0x0358)
class UABP_AJBInGameStand_KCR_C final : public UAnimInstance
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_A5B2E2574443EC77E239E09CD407AF7C; // 0x0368(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_FEB2A68E4E6B6996823E2CA99B3D414C; // 0x03B0(0x0070)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_ADF23F5B489DC196FAFDEF88707DE880; // 0x0420(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_C1A875D84517692106CDF9A963BDBB58; // 0x0468(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_478F78C0412D11399DBA28A0FF933CA0; // 0x04B0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_391DD6884563CB84B9A705B08124CC44; // 0x04F8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_20F7F64B496720030998E8BA1146F425; // 0x0540(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7549DD1B4B0ACA3278E311A13CA8998C; // 0x0588(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_F642BA1F4E5F0B1EF85C2688EB3BD406; // 0x0638(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_AFBF6E8042E30036E3864BB2372CCDEC; // 0x0680(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_89224B82410B1F09D23AF8A83D0920DB; // 0x0730(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_793EFC1045920F5773582C8EDED4F830; // 0x0778(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_B1D56BA346EFBA9514D27080EC7CE7F7; // 0x0828(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_B335BD1841C01C7EFB44B4B17F6AC8B3; // 0x0870(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_4CFC0F444D4ACF9E95DBC99EF7065740; // 0x0920(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_4AF9CA4C40499407FC6501B6C9DAD0D1; // 0x0968(0x00E0)()
	bool                                          bIsOwnerMove;                                      // 0x0A48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A49[0x3];                                      // 0x0A49(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OwnerMovementRate;                                 // 0x0A4C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MoveRate;                                          // 0x0A50(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bBlocking;                                         // 0x0A54(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ABP_AJBInGameStand_KCR(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameStand_KCR_AnimGraphNode_TransitionResult_20F7F64B496720030998E8BA1146F425();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameStand_KCR_AnimGraphNode_TransitionResult_ADF23F5B489DC196FAFDEF88707DE880();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameStand_KCR_AnimGraphNode_TransitionResult_391DD6884563CB84B9A705B08124CC44();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameStand_KCR_AnimGraphNode_TransitionResult_478F78C0412D11399DBA28A0FF933CA0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameStand_KCR_AnimGraphNode_TransitionResult_C1A875D84517692106CDF9A963BDBB58();
	void CanOwnerMove(bool* bCanMove);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_AJBInGameStand_KCR_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_AJBInGameStand_KCR_C")
	}
	static class UABP_AJBInGameStand_KCR_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_AJBInGameStand_KCR_C>();
	}
};
DUMPER7_ASSERTS_UABP_AJBInGameStand_KCR_C;

SDK_NAMESPACE_END
