#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AJBInGameCharacter_DVL

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START

// AnimBlueprintGeneratedClass ABP_AJBInGameCharacter_DVL.ABP_AJBInGameCharacter_DVL_C
// 0x09E0 (0x0D38 - 0x0358)
class UABP_AJBInGameCharacter_DVL_C final : public UAnimInstance
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_285C183A4789019357B6019E0F8D3AA1; // 0x0368(0x0048)()
	class UAnimSequenceBase*                      __SUBINSTANCE_AS_DownStart_20BD5BAF4CD71DA33DEB5C8A761C4A88; // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __SUBINSTANCE_AS_JumpLoop_20BD5BAF4CD71DA33DEB5C8A761C4A88; // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __SUBINSTANCE_AS_JumpEnd_20BD5BAF4CD71DA33DEB5C8A761C4A88; // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __SUBINSTANCE_AS_JumpStart_20BD5BAF4CD71DA33DEB5C8A761C4A88; // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __SUBINSTANCE_AS_DeathLoop_20BD5BAF4CD71DA33DEB5C8A761C4A88; // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __SUBINSTANCE_AS_Dash_20BD5BAF4CD71DA33DEB5C8A761C4A88; // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpaceBase*                        __SUBINSTANCE_BS_Run_20BD5BAF4CD71DA33DEB5C8A761C4A88; // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpaceBase*                        __SUBINSTANCE_BS_CWalk_20BD5BAF4CD71DA33DEB5C8A761C4A88; // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpaceBase*                        __SUBINSTANCE_BS_Walk_20BD5BAF4CD71DA33DEB5C8A761C4A88; // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          __SUBINSTANCE_AS_CIdle_20BD5BAF4CD71DA33DEB5C8A761C4A88; // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          __SUBINSTANCE_AS_Idle_20BD5BAF4CD71DA33DEB5C8A761C4A88; // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNode_SubInstance                  AnimGraphNode_SubInstance_20BD5BAF4CD71DA33DEB5C8A761C4A88; // 0x0408(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_F29427AF4CB6D4AB481D529C20FB79BB; // 0x04D0(0x0070)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_6F54F1DD4238E939FC38B7983B91A846; // 0x0540(0x00E0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_F4DAC7434E52E51C556DEF9115F2A7A3; // 0x0620(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_51509EA34763461E3FC9999F58DA1D6C; // 0x0700(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5FC6D658457540DDD4D98E830DE2BE5C; // 0x0750(0x0050)()
	struct FAnimNode_SubInstance                  AnimGraphNode_SubInstance_23FA7C2548BAA0C7E725D1A1F6F20072; // 0x07A0(0x00C8)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_454531274D851769BC8801A3D000E385; // 0x0868(0x0160)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_332396234B5AD7081A16EA8D5801561F; // 0x09C8(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_E150A6524B92D15845FDC78822474E03; // 0x0A10(0x0048)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_397CC58C4069E2E8D7A801960B5938AA; // 0x0A58(0x0160)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3BD6F66A4C71B528ED4C67A86BDD4047; // 0x0BB8(0x0160)()
	bool                                          bCriticalFlow;                                     // 0x0D18(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsPreReplay;                                      // 0x0D19(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1A[0x2];                                      // 0x0D1A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               HairRotationDefault;                               // 0x0D1C(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               HairRotationPreReplay;                             // 0x0D28(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ABP_AJBInGameCharacter_DVL(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameCharacter_DVL_AnimGraphNode_ModifyBone_3BD6F66A4C71B528ED4C67A86BDD4047();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameCharacter_DVL_AnimGraphNode_ModifyBone_397CC58C4069E2E8D7A801960B5938AA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameCharacter_DVL_AnimGraphNode_ModifyBone_454531274D851769BC8801A3D000E385();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_AJBInGameCharacter_DVL_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_AJBInGameCharacter_DVL_C")
	}
	static class UABP_AJBInGameCharacter_DVL_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_AJBInGameCharacter_DVL_C>();
	}
};
DUMPER7_ASSERTS_UABP_AJBInGameCharacter_DVL_C;

SDK_NAMESPACE_END
