#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AJBInGameSub_MeshRotate

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START

// AnimBlueprintGeneratedClass ABP_AJBInGameSub_MeshRotate.ABP_AJBInGameSub_MeshRotate_C
// 0x01C0 (0x0518 - 0x0358)
class UABP_AJBInGameSub_MeshRotate_C final : public UAnimInstance
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_A16996C047B561794EC9BFA8F26960B8; // 0x0368(0x0048)()
	struct FAnimNode_SubInput                     AnimGraphNode_SubInput_CA0348064C5B09B3BF250CB029153CB0; // 0x03B0(0x0068)()
	struct FAnimNode_RotateRootBone               AnimGraphNode_RotateRootBone_4B4A5A404F803DB18335ABBFBD56930E; // 0x0418(0x00E0)()
	float                                         RootBoneWorldYaw;                                  // 0x04F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSidling;                                        // 0x04FC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4FD[0x3];                                      // 0x04FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CurrentMeshWorldRotation;                          // 0x0500(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         RootBoneRelativeYaw;                               // 0x050C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EndSidlingInterpSpeed;                             // 0x0510(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BeginSidlingInterpSpeed;                           // 0x0514(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ABP_AJBInGameSub_MeshRotate(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameSub_MeshRotate_AnimGraphNode_RotateRootBone_4B4A5A404F803DB18335ABBFBD56930E();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	float CalcRootBoneRelativeYaw();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_AJBInGameSub_MeshRotate_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_AJBInGameSub_MeshRotate_C")
	}
	static class UABP_AJBInGameSub_MeshRotate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_AJBInGameSub_MeshRotate_C>();
	}
};
DUMPER7_ASSERTS_UABP_AJBInGameSub_MeshRotate_C;

SDK_NAMESPACE_END
