#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AJBInGameStand_ECH01

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "AJB_structs.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START

// AnimBlueprintGeneratedClass ABP_AJBInGameStand_ECH01.ABP_AJBInGameStand_ECH01_C
// 0x0940 (0x0C98 - 0x0358)
class UABP_AJBInGameStand_ECH01_C final : public UAnimInstance
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_FCB551DB42718868CFEF089A51F07CB6; // 0x0368(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_4817454C404BD42D904B76A2933D5DA6; // 0x03B0(0x0070)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8FFB22064D56F89C9C9E00BF21B49899; // 0x0420(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_760635F641E831C8262CFEB43DD68577; // 0x0468(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6F7603DF41B7665C677A8BB8A62FC809; // 0x04B0(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_29E515D241EDC994C7A8AEB573E621EB; // 0x0560(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_163A7E24496CE54F1874C58B88DDAB50; // 0x05A8(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_AB11E78F47D2F886AD2B1EBBFF5219AC; // 0x0658(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_98E01633474A06AC51B984A2527066C1; // 0x06A0(0x00E0)()
	struct FAnimNode_SplineIK                     AnimGraphNode_SplineIK_7091EA7443A937978F44F5AA2EA5C255; // 0x0780(0x02B8)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_148483C54FC8D61BF20F3695DAB2BA70; // 0x0A38(0x0048)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_12170BE341C15A64C278CEB278F0F577; // 0x0A80(0x0048)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_F005C704431ED1C410DC7791727C0B89; // 0x0AC8(0x0160)()
	bool                                          IsSeparate;                                        // 0x0C28(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C29[0x3];                                      // 0x0C29(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MovementVectorForward;                             // 0x0C2C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MovementVectorRight;                               // 0x0C30(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CurrentTailLaunching;                              // 0x0C34(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          BeforeTailLaunching;                               // 0x0C35(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C36[0x2];                                      // 0x0C36(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBMiddleRangeSkill_C*              MiddleRangeSkillComp;                              // 0x0C38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TailAnimationBlendAlpha;                           // 0x0C40(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetLocation;                                    // 0x0C44(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TailFluctuationCoefficient;                        // 0x0C50(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C54[0x4];                                      // 0x0C54(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        SplinePointOriginComponentLocations;               // 0x0C58(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FTransform>                     SplinePointComponentTransforms;                    // 0x0C68(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	struct FVector                                SplinePointComponentLocationOffset;                // 0x0C78(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               SplinePointRotation;                               // 0x0C84(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         MaxFluctuationLength_cm_;                          // 0x0C90(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDebugView;                                        // 0x0C94(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ABP_AJBInGameStand_ECH01(int32 EntryPoint);
	void BlueprintInitializeAnimation();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameStand_ECH01_AnimGraphNode_TransitionResult_8FFB22064D56F89C9C9E00BF21B49899();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameStand_ECH01_AnimGraphNode_ModifyBone_F005C704431ED1C410DC7791727C0B89();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameStand_ECH01_AnimGraphNode_SplineIK_7091EA7443A937978F44F5AA2EA5C255();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameStand_ECH01_AnimGraphNode_TransitionResult_760635F641E831C8262CFEB43DD68577();
	void TryGetCloseRangeSkillComp(class UBP_AJBCloseRangeSkill_C** CloseRangeSkillComp);
	void IsTailStretching(bool* Result);
	void IsTailLaunching(bool* Result);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_AJBInGameStand_ECH01_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_AJBInGameStand_ECH01_C")
	}
	static class UABP_AJBInGameStand_ECH01_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_AJBInGameStand_ECH01_C>();
	}
};
DUMPER7_ASSERTS_UABP_AJBInGameStand_ECH01_C;

SDK_NAMESPACE_END
