#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AJBPostProcessHuman_RBControlled_C28

#include "Basic.hpp"

#include "ImmediatePhysics_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "AJB_structs.hpp"


SDK_NAMESPACE_START

// AnimBlueprintGeneratedClass ABP_AJBPostProcessHuman_RBControlled_C28.ABP_AJBPostProcessHuman_RBControlled_C28_C
// 0x0708 (0x0A60 - 0x0358)
class UABP_AJBPostProcessHuman_RBControlled_C28_C final : public UAnimInstance
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_76A967F04A60626A15C29096888BFD4D; // 0x0368(0x0048)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_26DBD34F476BB35D9DCE2BA0BE94E549; // 0x03B0(0x05A0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3EA54473489BEE98832AC187D0C5F7EA; // 0x0950(0x0048)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_A21B3D634061303DC405028687020693; // 0x0998(0x0048)()
	struct FAnimNode_SubInput                     AnimGraphNode_SubInput_FF8404904C5777960E8C3797F1E4F1F2; // 0x09E0(0x0068)()
	bool                                          bDisableRigidBodyByJump;                           // 0x0A48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bDisableRigidBodyByChangeWalkingState;             // 0x0A49(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bDisableRigidBodyByCrouch;                         // 0x0A4A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bDisableRigidBodyByDirection;                      // 0x0A4B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         RigidBodyAlpha;                                    // 0x0A4C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RigidBodyAlpha_InterpSpeed;                        // 0x0A50(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnableRigidBodyByEmote;                           // 0x0A54(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bCompletedBind;                                    // 0x0A55(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bDuringEmote;                                      // 0x0A56(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_C28(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_C28_AnimGraphNode_RigidBody_26DBD34F476BB35D9DCE2BA0BE94E549();
	void BlueprintUpdateAnimation(float DeltaTimeX);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_AJBPostProcessHuman_RBControlled_C28_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_AJBPostProcessHuman_RBControlled_C28_C")
	}
	static class UABP_AJBPostProcessHuman_RBControlled_C28_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_AJBPostProcessHuman_RBControlled_C28_C>();
	}
};
DUMPER7_ASSERTS_UABP_AJBPostProcessHuman_RBControlled_C28_C;

SDK_NAMESPACE_END
