#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AJBInGameCharacter_ABD

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


SDK_NAMESPACE_START

// AnimBlueprintGeneratedClass ABP_AJBInGameCharacter_ABD.ABP_AJBInGameCharacter_ABD_C
// 0x0500 (0x0858 - 0x0358)
class UABP_AJBInGameCharacter_ABD_C final : public UAnimInstance
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	class UAnimSequenceBase*                      __SUBINSTANCE_AS_JumpLoop_7CA1101B413CC2B0173CF7B352889DCF; // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __SUBINSTANCE_AS_JumpEnd_7CA1101B413CC2B0173CF7B352889DCF; // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __SUBINSTANCE_AS_JumpStart_7CA1101B413CC2B0173CF7B352889DCF; // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __SUBINSTANCE_AS_DeathLoop_7CA1101B413CC2B0173CF7B352889DCF; // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __SUBINSTANCE_AS_Dash_7CA1101B413CC2B0173CF7B352889DCF; // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpaceBase*                        __SUBINSTANCE_BS_Run_7CA1101B413CC2B0173CF7B352889DCF; // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpaceBase*                        __SUBINSTANCE_BS_Walk_7CA1101B413CC2B0173CF7B352889DCF; // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          __SUBINSTANCE_AS_CIdle_7CA1101B413CC2B0173CF7B352889DCF; // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          __SUBINSTANCE_AS_Idle_7CA1101B413CC2B0173CF7B352889DCF; // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNode_SubInstance                  AnimGraphNode_SubInstance_7CA1101B413CC2B0173CF7B352889DCF; // 0x03B0(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_0415FE6D4340C1A5F613DDB2F4101D29; // 0x0478(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_Root_DE147E4C4E8AA1FA026D39B2E527BC7C; // 0x04E8(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_BECDEC6A4B5EDF8D6A8D14976EC382E7; // 0x0530(0x00E0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_B39BD8974EB07DD6029F29A6E52E658C; // 0x0610(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_ACCC110B4A8F4E001A29F1A144214703; // 0x06F0(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1D9CD181487AC9474C632BB626688A73; // 0x0740(0x0050)()
	struct FAnimNode_SubInstance                  AnimGraphNode_SubInstance_6B1311EA460AA88B72B9E2B57EE10D66; // 0x0790(0x00C8)()

public:
	void ExecuteUbergraph_ABP_AJBInGameCharacter_ABD(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_AJBInGameCharacter_ABD_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_AJBInGameCharacter_ABD_C")
	}
	static class UABP_AJBInGameCharacter_ABD_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_AJBInGameCharacter_ABD_C>();
	}
};
DUMPER7_ASSERTS_UABP_AJBInGameCharacter_ABD_C;

SDK_NAMESPACE_END
