#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AJBInGameSub_SkillActivated

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "AJB_structs.hpp"


SDK_NAMESPACE_START

// AnimBlueprintGeneratedClass ABP_AJBInGameSub_SkillActivated.ABP_AJBInGameSub_SkillActivated_C
// 0x17F0 (0x1B48 - 0x0358)
class UABP_AJBInGameSub_SkillActivated_C final : public UAnimInstance
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_F6485962458765D49BD88CA63B15CA6D; // 0x0368(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_340C48A743694243A1FE26A87C834E8C; // 0x03B0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_A9AD742348BE4C3E0CEC0FABF4CF7F9C; // 0x03F8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_426C34684DB5043F3E18AA81A2876445; // 0x0440(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_A9D77A3A4748810AB5779EA8695DBAF6; // 0x0488(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8344C4F5422FC8FC8F2EF7BCD9597DBC; // 0x04D0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_0E00B7034BEA86D7D36F4C9BA8DE0A11; // 0x0518(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_50E252C947F45835B6BBE4877A16C511; // 0x0560(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_B2A067774C818E58095AA59C67E3E5C5; // 0x05A8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_CDEF5BF242285F40EF774DB0B8304BA7; // 0x05F0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_EE63B1F4465E4972C312FDA17910A9AC; // 0x0638(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7D3C2AE04BC3B85710EBB699E6DD24CA; // 0x0680(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_CAEDF9AE4F68E63563622C84728F67DB; // 0x0730(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3BDC20EA4202EE506FE75FA81359F0D9; // 0x0778(0x00D0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_04BC65DF487FAEA7697D9887467E26E0; // 0x0848(0x0128)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_088EF07043A23AE607B3DC81F50BC15D; // 0x0970(0x0128)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_BD7CD84943B3C8FA628610AFBD9E6E7B; // 0x0A98(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_F13716CB482A3A445E2751850F6F0EC6; // 0x0AE0(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_9F0FD5424F6B674F379FB39506D362F5; // 0x0B90(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6EB0498145DBFC71D5D87688529D7D57; // 0x0BD8(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_ED740CC246EBDE86674D4DA795A12CE0; // 0x0C88(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_D94FB5C74D4EB155657B7BBAD2BC77B0; // 0x0CD0(0x00E0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_E99C8C74460B4111F9ECE096CA4AFE6E; // 0x0DB0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_41D2A41149DDD3D81FCFDB9706491866; // 0x0DF8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_C1F3E126472132048655CB8B34A31978; // 0x0E40(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_04BE636D44B8FE1249E0ED88039232FB; // 0x0E88(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_ECAE2291495E55F9D1DB8DBB3818CA22; // 0x0ED0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_89D0FC0248046ECDBB9E3FBAF2CE3F65; // 0x0F18(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6AEEFCE64980852FE9DD4D90CC004AF9; // 0x0F60(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_C0929283454C04105A5FAFB4DBD6F9DC; // 0x1010(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_9693E6A14B811FA8246510B3FE0781BF; // 0x1058(0x00D0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_A7477A7E4B54D0E0C2537985507C9B0C; // 0x1128(0x0128)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_31EADE8A4CC9C2EF4005CA9AA4592C29; // 0x1250(0x0128)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_C40DDAE3434697AB32BBE78E81218324; // 0x1378(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_50E5F92C4B2E55A107B5DDABFDDE975C; // 0x13C0(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_DC7EB0AD4215584CB02B7EACCD26A3A3; // 0x1470(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7D2A7DFE4C9883411A6CF2A1354CA306; // 0x14B8(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_13BBE1B0405877B83E85C1BF42ABCEBD; // 0x1568(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_38448716409F5FBDEDCF8797DB57E518; // 0x15B0(0x00E0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_D0979B534AD3F8AC8B29139CB745D905; // 0x1690(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_D6C6038C49E700CD9908C481C9ED9033; // 0x16D8(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_8CA792394E7D08AD04B278B09F24578E; // 0x1788(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_355FD55041EDBB8026306EBA9DC8D06B; // 0x17D0(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_E14CC0724372F15CC8F066AE6F56AB56; // 0x1818(0x00E0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_48C1BD4E429E9D91BAECCE80DC366BFA; // 0x18F8(0x00E0)()
	struct FAnimNode_SubInput                     AnimGraphNode_SubInput_5C05AFD94E71AA812BC57AB0C2D8583B; // 0x19D8(0x0068)()
	float                                         SkillAnimationBlendWeight;                         // 0x1A40(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsCrouch;                                         // 0x1A44(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsDash;                                           // 0x1A45(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsSidling;                                        // 0x1A46(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A47[0x1];                                     // 0x1A47(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MovementVectorRight_CameraSpace;                   // 0x1A48(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MovementVectorForward_CameraSpace;                 // 0x1A4C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TargetRight;                                       // 0x1A50(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TargetForward;                                     // 0x1A54(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldSkipReadyAnimation;                          // 0x1A58(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay)
	bool                                          ShouldSkipFinishAnimation;                         // 0x1A59(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay)
	uint8                                         Pad_1A5A[0x2];                                     // 0x1A5A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DeltaSeconds;                                      // 0x1A5C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnabledUltimate_L1_SkillLoopAnimation;           // 0x1A60(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A61[0x3];                                     // 0x1A61(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Ultimate_L1_SkillLoopAnimationIndex;               // 0x1A64(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnabledBasic_L2_SkillLoopAnimation;              // 0x1A68(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A69[0x3];                                     // 0x1A69(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Basic_L2_SkillAnimationIndex;                      // 0x1A6C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnabledSpecial_R1_SkillLoopAnimation;            // 0x1A70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A71[0x3];                                     // 0x1A71(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Special_R1_SkillAnimationIndex;                    // 0x1A74(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnabledBase_R2_SkillLoopAnimation;               // 0x1A78(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A79[0x3];                                     // 0x1A79(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Base_R2_SkillAnimationIndex;                       // 0x1A7C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnabledSupportSkillLoopAnimation;                // 0x1A80(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A81[0x3];                                     // 0x1A81(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SupportSkillAnimationIndex;                        // 0x1A84(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          AS_SkillLoopAnimationStart01;                      // 0x1A88(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            BS_SkillLoopAnimationLoop01;                       // 0x1A90(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          AS_SkillLoopAnimationFinish01;                     // 0x1A98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BeginSkillAnimationBlendSpeed01;                   // 0x1AA0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SkippableStartAnimationRemainingTime01;            // 0x1AA4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LoopSkillAnimationRecoveryTime01;                  // 0x1AA8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FinishSkillAnimationRecoveryTime01;                // 0x1AAC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SkippableFinishAnimationRemainingTime01;           // 0x1AB0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EndSkillAnimationBlendSpeed01;                     // 0x1AB4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsTimingCustomizedFinishSkillAnimation01;          // 0x1AB8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ShouldPlaySkillAnimationWhileCrouching01;          // 0x1AB9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1ABA[0x6];                                     // 0x1ABA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          AS_SkillLoopAnimationStart02;                      // 0x1AC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            BS_SkillLoopAnimationLoop02;                       // 0x1AC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayingSkillLoopAnimationIndex;                    // 0x1AD0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	float                                         RemainingTimeSkillAnimationRecovery;               // 0x1AD4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                          IsPlayingAnimation;                                // 0x1AD8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay)
	bool                                          IsSkillRunning;                                    // 0x1AD9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay)
	uint8                                         Pad_1ADA[0x6];                                     // 0x1ADA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          AS_SkillLoopAnimationFinish02;                     // 0x1AE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BeginSkillAnimationBlendSpeed02;                   // 0x1AE8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SkippableStartAnimationRemainingTime02;            // 0x1AEC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LoopSkillAnimationRecoveryTime02;                  // 0x1AF0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FinishSkillAnimationRecoveryTime02;                // 0x1AF4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SkippableFinishAnimationRemainingTime02;           // 0x1AF8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EndSkillAnimationBlendSpeed02;                     // 0x1AFC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentBeginSkillAnimationBlendSpeed;              // 0x1B00(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	float                                         CurrentEndSkillAnimationBlendSpeed;                // 0x1B04(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                          IsTimingCustomizedFinishSkillAnimation02;          // 0x1B08(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsOnReadyFiredFrame;                               // 0x1B09(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay)
	uint8                                         Pad_1B0A[0x2];                                     // 0x1B0A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReadyCount;                                        // 0x1B0C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	int32                                         InactivatedCount;                                  // 0x1B10(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                          ShouldPlayCurrentSkillAnimationWhileCrouching;     // 0x1B14(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay)
	bool                                          ShouldPlaySkillAnimationWhileCrouching02;          // 0x1B15(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsEnableFaceTheCameraForPitchSkillAnimation02;     // 0x1B16(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B17[0x1];                                     // 0x1B17(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CameraPitchSpace;                                  // 0x1B18(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1C[0x4];                                     // 0x1B1C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            BS_SKillLoopAnimationFaceTheCameraPitchLoop02;     // 0x1B20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnableFaceTheCameraForPitchSkillAnimation01;     // 0x1B28(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B29[0x7];                                     // 0x1B29(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            BS_SKillLoopAnimationFaceTheCameraPitchLoop01;     // 0x1B30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCameraPitchSpaceLimit;                           // 0x1B38(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B39[0x3];                                     // 0x1B39(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CameraPitchSpaceLimitUpper;                        // 0x1B3C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bValidBehavior;                                    // 0x1B40(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated(int32 EntryPoint);
	void InitVariables(int32 AnimIndex);
	void FinishSkillAnimation(class UBP_AJBSkillBase_C* TargetSkill, bool ShouldFinishImmidiately);
	void OnBeginSkillFinishedAnimation(class UBP_AJBSkillBase_C* FinishingSkill);
	void OnSkilCanceled(class UBP_AJBSkillBase_C* CanceledSkill);
	void EndSkillAnimation(bool bImmediate);
	void OnSkillInactive(class UBP_AJBSkillBase_C* InactiveSkill, bool bRenaturation);
	void OnSkillActivated(class UBP_AJBSkillBase_C* ActiveSkill, bool bRenaturation);
	void OnSkillReady(class UBP_AJBSkillBase_C* ReadySkill, bool bRenaturation);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated_AnimGraphNode_LayeredBoneBlend_48C1BD4E429E9D91BAECCE80DC366BFA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated_AnimGraphNode_SequencePlayer_50E5F92C4B2E55A107B5DDABFDDE975C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated_AnimGraphNode_BlendSpacePlayer_31EADE8A4CC9C2EF4005CA9AA4592C29();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated_AnimGraphNode_BlendSpacePlayer_A7477A7E4B54D0E0C2537985507C9B0C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated_AnimGraphNode_BlendListByBool_9693E6A14B811FA8246510B3FE0781BF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated_AnimGraphNode_SequencePlayer_6AEEFCE64980852FE9DD4D90CC004AF9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated_AnimGraphNode_TransitionResult_89D0FC0248046ECDBB9E3FBAF2CE3F65();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated_AnimGraphNode_TransitionResult_ECAE2291495E55F9D1DB8DBB3818CA22();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated_AnimGraphNode_TransitionResult_04BE636D44B8FE1249E0ED88039232FB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated_AnimGraphNode_TransitionResult_C1F3E126472132048655CB8B34A31978();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated_AnimGraphNode_TransitionResult_41D2A41149DDD3D81FCFDB9706491866();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated_AnimGraphNode_SequencePlayer_F13716CB482A3A445E2751850F6F0EC6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated_AnimGraphNode_BlendSpacePlayer_088EF07043A23AE607B3DC81F50BC15D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated_AnimGraphNode_BlendSpacePlayer_04BC65DF487FAEA7697D9887467E26E0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated_AnimGraphNode_BlendListByBool_3BDC20EA4202EE506FE75FA81359F0D9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated_AnimGraphNode_SequencePlayer_7D3C2AE04BC3B85710EBB699E6DD24CA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated_AnimGraphNode_TransitionResult_EE63B1F4465E4972C312FDA17910A9AC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated_AnimGraphNode_TransitionResult_CDEF5BF242285F40EF774DB0B8304BA7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated_AnimGraphNode_TransitionResult_B2A067774C818E58095AA59C67E3E5C5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated_AnimGraphNode_TransitionResult_50E252C947F45835B6BBE4877A16C511();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated_AnimGraphNode_TransitionResult_0E00B7034BEA86D7D36F4C9BA8DE0A11();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated_AnimGraphNode_TransitionResult_A9D77A3A4748810AB5779EA8695DBAF6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated_AnimGraphNode_TransitionResult_426C34684DB5043F3E18AA81A2876445();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated_AnimGraphNode_TransitionResult_A9AD742348BE4C3E0CEC0FABF4CF7F9C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameSub_SkillActivated_AnimGraphNode_TransitionResult_340C48A743694243A1FE26A87C834E8C();
	void GetSkillLoopAnimationIndex(EAJBSkillType SkillType, int32* Index_0);
	void GetSkillLoopAnimation(int32 Index_0, class UAnimSequence** AS_AnimStart, class UBlendSpace** BS_AnimLoop, class UAnimSequence** AS_AnimFinish);
	void IsEnabledSkillLoopAnimation(EAJBSkillType SkillType, bool* IsEnabled);
	void GetEndSkillAnimationBlendSpeed(int32 Index_0, float* EndSkillAnimationBlendSpeed);
	void GetBeginSkillAnimationBlendSpeed(int32 Index_0, float* SkillAnimationBlendSpeed);
	void GetLoopSkillAnimationRecoveryTime(int32 Index_0, float* SkillAnimationRecoveryTime);
	void GetFinishSkillAnimationRecoveryTime(int32 Index_0, float* SkillAnimationRecoveryTime);
	void ShouldRunFinishStateOnInactivated(int32 Index_0, bool* IsCustomized);
	void ShouldPlaySkillAnimationWhileCrouching(int32 Index_0, bool* ShouldPlayAnim);
	void SetCameraPitchSpace(float CameraPitch);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_AJBInGameSub_SkillActivated_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_AJBInGameSub_SkillActivated_C")
	}
	static class UABP_AJBInGameSub_SkillActivated_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_AJBInGameSub_SkillActivated_C>();
	}
};
DUMPER7_ASSERTS_UABP_AJBInGameSub_SkillActivated_C;

SDK_NAMESPACE_END
