#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_InGameStand_MGR

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


SDK_NAMESPACE_START

// AnimBlueprintGeneratedClass ABP_InGameStand_MGR.ABP_InGameStand_MGR_C
// 0x0438 (0x0790 - 0x0358)
class UABP_InGameStand_MGR_C final : public UAnimInstance
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_2C9222DA4638CB2D9D778481C737AC5D; // 0x0368(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_AC1D4708479D4B744A7457B7AA45FDA7; // 0x03B0(0x0070)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9501D30642B8CC56941040AB12C970C9; // 0x0420(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_66EEA35444A04010A9A19CAAB9618B76; // 0x0468(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_936D6947451CF8AFA2A446A0BEE8314E; // 0x04B0(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_0BE24A5C4EFD4FD305F76592BFE7E8A2; // 0x0560(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_A85F826F4BA3749617AD60BF78AFA46A; // 0x05A8(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_15B6ABFD48DF4B03B41D87A9C11CEF5C; // 0x0658(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_942E1C18428FB4CC280E56841D2619CE; // 0x06A0(0x00E0)()
	float                                         OwnerMovementRate;                                 // 0x0780(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MoveRate;                                          // 0x0784(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOwnerMove;                                       // 0x0788(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ABP_InGameStand_MGR(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_InGameStand_MGR_AnimGraphNode_TransitionResult_66EEA35444A04010A9A19CAAB9618B76();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_InGameStand_MGR_AnimGraphNode_TransitionResult_9501D30642B8CC56941040AB12C970C9();
	bool CanOwnerMove();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_InGameStand_MGR_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_InGameStand_MGR_C")
	}
	static class UABP_InGameStand_MGR_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_InGameStand_MGR_C>();
	}
};
DUMPER7_ASSERTS_UABP_InGameStand_MGR_C;

SDK_NAMESPACE_END
