#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AJBInGameCharacter_KWK

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


SDK_NAMESPACE_START

// AnimBlueprintGeneratedClass ABP_AJBInGameCharacter_KWK.ABP_AJBInGameCharacter_KWK_C
// 0x04F8 (0x0850 - 0x0358)
class UABP_AJBInGameCharacter_KWK_C final : public UAnimInstance
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_0E41EE7042819F1192678590437126FD; // 0x0368(0x0048)()
	class UAnimSequenceBase*                      __SUBINSTANCE_AS_JumpLoop_C71F927C4AFC2D72D202149ED0377ED6; // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __SUBINSTANCE_AS_JumpStart_C71F927C4AFC2D72D202149ED0377ED6; // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __SUBINSTANCE_AS_DeathLoop_C71F927C4AFC2D72D202149ED0377ED6; // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __SUBINSTANCE_AS_Dash_C71F927C4AFC2D72D202149ED0377ED6; // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpaceBase*                        __SUBINSTANCE_BS_Run_C71F927C4AFC2D72D202149ED0377ED6; // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpaceBase*                        __SUBINSTANCE_BS_Walk_C71F927C4AFC2D72D202149ED0377ED6; // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          __SUBINSTANCE_AS_CIdle_C71F927C4AFC2D72D202149ED0377ED6; // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          __SUBINSTANCE_AS_Idle_C71F927C4AFC2D72D202149ED0377ED6; // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNode_SubInstance                  AnimGraphNode_SubInstance_C71F927C4AFC2D72D202149ED0377ED6; // 0x03F0(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_DFA90CC64934B2BA8379D286404E9C0C; // 0x04B8(0x0070)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_33ACF74B4476A813D4AC94A7BBE244EA; // 0x0528(0x00E0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_B7D076224863667B4E60ED898B77F25A; // 0x0608(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_EDF1FCC04FA1F24A694C2380E3FEB224; // 0x06E8(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_87189BBA4529ADFCB53A14A5AF4CD39E; // 0x0738(0x0050)()
	struct FAnimNode_SubInstance                  AnimGraphNode_SubInstance_CB229C284FCA90A1D1CC7E960441ABFB; // 0x0788(0x00C8)()

public:
	void ExecuteUbergraph_ABP_AJBInGameCharacter_KWK(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_AJBInGameCharacter_KWK_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_AJBInGameCharacter_KWK_C")
	}
	static class UABP_AJBInGameCharacter_KWK_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_AJBInGameCharacter_KWK_C>();
	}
};
DUMPER7_ASSERTS_UABP_AJBInGameCharacter_KWK_C;

SDK_NAMESPACE_END
