#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_InGameStand_S28

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


SDK_NAMESPACE_START

// AnimBlueprintGeneratedClass ABP_InGameStand_S28.ABP_InGameStand_S28_C
// 0x0430 (0x0788 - 0x0358)
class UABP_InGameStand_S28_C final : public UAnimInstance
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_2323DC834E8A125D5442D6892FDDD6A6; // 0x0368(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_FE6E863D4A5A2B5312DFDAA89181D4D7; // 0x03B0(0x0070)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_033D2E1A4BDF99EA77AFC18CF4323583; // 0x0420(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_134FD997431839E00ED449915C0D69D1; // 0x0468(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4ACB0E0B4A75B33D146B4A9C3662A320; // 0x04B0(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_A2F4733B41C44139DBEFE29346908048; // 0x0560(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2D8204834C78A8A503E642B3BB72FBCC; // 0x05A8(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_755596B1466AE8E4AC782A8ADFE0D2FE; // 0x0658(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_CDEF9B6F4BB85A376CE248898B1DB882; // 0x06A0(0x00E0)()
	bool                                          IsSeparate;                                        // 0x0780(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ABP_InGameStand_S28(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_InGameStand_S28_AnimGraphNode_TransitionResult_033D2E1A4BDF99EA77AFC18CF4323583();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_InGameStand_S28_AnimGraphNode_TransitionResult_134FD997431839E00ED449915C0D69D1();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_InGameStand_S28_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_InGameStand_S28_C")
	}
	static class UABP_InGameStand_S28_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_InGameStand_S28_C>();
	}
};
DUMPER7_ASSERTS_UABP_InGameStand_S28_C;

SDK_NAMESPACE_END
