#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AJBInGameCharacter_JLN

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


SDK_NAMESPACE_START

// AnimBlueprintGeneratedClass ABP_AJBInGameCharacter_JLN.ABP_AJBInGameCharacter_JLN_C
// 0x04E8 (0x0840 - 0x0358)
class UABP_AJBInGameCharacter_JLN_C final : public UAnimInstance
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	class UAnimSequenceBase*                      __SUBINSTANCE_AS_JumpLoop_EA5B9A9B44430A6E0F3F36AAE77A6CA3; // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __SUBINSTANCE_AS_DeathLoop_EA5B9A9B44430A6E0F3F36AAE77A6CA3; // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __SUBINSTANCE_AS_Dash_EA5B9A9B44430A6E0F3F36AAE77A6CA3; // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpaceBase*                        __SUBINSTANCE_BS_CWalk_EA5B9A9B44430A6E0F3F36AAE77A6CA3; // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpaceBase*                        __SUBINSTANCE_BS_Walk_EA5B9A9B44430A6E0F3F36AAE77A6CA3; // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          __SUBINSTANCE_AS_Idle_EA5B9A9B44430A6E0F3F36AAE77A6CA3; // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNode_SubInstance                  AnimGraphNode_SubInstance_EA5B9A9B44430A6E0F3F36AAE77A6CA3; // 0x0398(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_C03E919247706428D604608C7708D40B; // 0x0460(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_9C61B9934270F01F8C5BD6B13BE374F2; // 0x04A8(0x0070)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_7349D7BD465F81AB18DC7CAEB957121A; // 0x0518(0x00E0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_8E02AE724050CBBEC0D039B04CDE31A1; // 0x05F8(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_373DF60A4478F957C7FBACAAAC0540F5; // 0x06D8(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6DBA32C3412941E52E57C19AE47112D3; // 0x0728(0x0050)()
	struct FAnimNode_SubInstance                  AnimGraphNode_SubInstance_71C0AB324CB8515C358FAEB865F95E5D; // 0x0778(0x00C8)()

public:
	void ExecuteUbergraph_ABP_AJBInGameCharacter_JLN(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_AJBInGameCharacter_JLN_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_AJBInGameCharacter_JLN_C")
	}
	static class UABP_AJBInGameCharacter_JLN_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_AJBInGameCharacter_JLN_C>();
	}
};
DUMPER7_ASSERTS_UABP_AJBInGameCharacter_JLN_C;

SDK_NAMESPACE_END
