#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AJBIngameStand_STP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


SDK_NAMESPACE_START

// AnimBlueprintGeneratedClass ABP_AJBIngameStand_STP.ABP_AJBInGameStand_STP_C
// 0x0700 (0x0A58 - 0x0358)
class UABP_AJBInGameStand_STP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_119012FC4BABE66CADBEA283AE85DAEB; // 0x0368(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_F4E6D99C42FFC90AEA0F74BFDA424BDC; // 0x03B0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_EFD806B54683FBE476B7EA8E8F36BBC9; // 0x03F8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_691F3D4A4FA805F248BEFFACE93CBCCB; // 0x0440(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_C55698564AFBD09F5D48C387A2820170; // 0x0488(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_00C18F214A5B7845C0B14195476A6BA9; // 0x04D0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_96D008314B7B9FDDD6C7518018AEDC2F; // 0x0518(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_2FEBE40F4B53C4316346CDB7442CDB46; // 0x05C8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_17AAA0B24A89D9083A750293A1199855; // 0x0610(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_A73B36BB4174D6BDE1404EABFAB10DB3; // 0x06C0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_53227207405157A4D5546EA72C761CFC; // 0x0708(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_BC35792748C0B8E7533A7DBFBEFA3BD7; // 0x07B8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_36248CB74115DAD177D2BE97255F591E; // 0x0800(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_5B4BA653462D346DE3395F9FC7CF558E; // 0x08B0(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_607A871D4D9D4E4A37FB8B9F9E9C46DF; // 0x08F8(0x00E0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_BD643552440D42E2A0F84DB042C65CFA; // 0x09D8(0x0070)()
	float                                         OwnerMovementRate;                                 // 0x0A48(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MoveRate;                                          // 0x0A4C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOwnerMove;                                       // 0x0A50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bBlocking;                                         // 0x0A51(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          NewVar_0;                                          // 0x0A52(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ABP_AJBInGameStand_STP(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameStand_STP_AnimGraphNode_TransitionResult_00C18F214A5B7845C0B14195476A6BA9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameStand_STP_AnimGraphNode_TransitionResult_F4E6D99C42FFC90AEA0F74BFDA424BDC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameStand_STP_AnimGraphNode_TransitionResult_C55698564AFBD09F5D48C387A2820170();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameStand_STP_AnimGraphNode_TransitionResult_691F3D4A4FA805F248BEFFACE93CBCCB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameStand_STP_AnimGraphNode_TransitionResult_EFD806B54683FBE476B7EA8E8F36BBC9();
	void CanOwnerMove(bool* CanMove);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_AJBInGameStand_STP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_AJBInGameStand_STP_C")
	}
	static class UABP_AJBInGameStand_STP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_AJBInGameStand_STP_C>();
	}
};
DUMPER7_ASSERTS_UABP_AJBInGameStand_STP_C;

SDK_NAMESPACE_END
