#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AJBInGameCharacter_JTR

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


SDK_NAMESPACE_START

// AnimBlueprintGeneratedClass ABP_AJBInGameCharacter_JTR.ABP_AJBInGameCharacter_JTR_C
// 0x04F8 (0x0850 - 0x0358)
class UABP_AJBInGameCharacter_JTR_C final : public UAnimInstance
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	class UAnimSequenceBase*                      __SUBINSTANCE_AS_JumpLoop_7CD983424D13CF37CB9E348829DB45CF; // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __SUBINSTANCE_AS_JumpStart_7CD983424D13CF37CB9E348829DB45CF; // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __SUBINSTANCE_AS_DeathLoop_7CD983424D13CF37CB9E348829DB45CF; // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __SUBINSTANCE_AS_Dash_7CD983424D13CF37CB9E348829DB45CF; // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpaceBase*                        __SUBINSTANCE_BS_Run_7CD983424D13CF37CB9E348829DB45CF; // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpaceBase*                        __SUBINSTANCE_BS_Walk_7CD983424D13CF37CB9E348829DB45CF; // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          __SUBINSTANCE_AS_CIdle_7CD983424D13CF37CB9E348829DB45CF; // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          __SUBINSTANCE_AS_Idle_7CD983424D13CF37CB9E348829DB45CF; // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNode_SubInstance                  AnimGraphNode_SubInstance_7CD983424D13CF37CB9E348829DB45CF; // 0x03A8(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_7A1AB4D343D0933BC3D8438A0393B189; // 0x0470(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2F12459542EA9D5B0077BCA35A394305; // 0x04E0(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_B43DC7A343483C9571834FBCBA526E48; // 0x0528(0x00E0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_7A772AC94EE15725B44CB5AF9561A823; // 0x0608(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_EFAA2E434C0E9135321E0BBA2FE96E2A; // 0x06E8(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_55D1F08E4073607DD6A7D8BBE98441DF; // 0x0738(0x0050)()
	struct FAnimNode_SubInstance                  AnimGraphNode_SubInstance_45D3657E4F7174C8196D21A838D9EDD2; // 0x0788(0x00C8)()

public:
	void ExecuteUbergraph_ABP_AJBInGameCharacter_JTR(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_AJBInGameCharacter_JTR_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_AJBInGameCharacter_JTR_C")
	}
	static class UABP_AJBInGameCharacter_JTR_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_AJBInGameCharacter_JTR_C>();
	}
};
DUMPER7_ASSERTS_UABP_AJBInGameCharacter_JTR_C;

SDK_NAMESPACE_END
