#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AJBPostProcessHuman_RBControlled

#include "Basic.hpp"

#include "ImmediatePhysics_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ELipType_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


SDK_NAMESPACE_START

// AnimBlueprintGeneratedClass ABP_AJBPostProcessHuman_RBControlled.ABP_AJBPostProcessHuman_RBControlled_C
// 0x0708 (0x0A60 - 0x0358)
class UABP_AJBPostProcessHuman_RBControlled_C final : public UAnimInstance
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_4E8004A64EEE848D2257C18010459447; // 0x0368(0x0048)()
	struct FAnimNode_SubInput                     AnimGraphNode_SubInput_E353352F4ABAC85871DF509D0182681D; // 0x03B0(0x0068)()
	uint8                                         Pad_418[0x8];                                      // 0x0418(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_B6A13A334EF824A2BBBD9E86F81E0873; // 0x0420(0x05A0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_E738BB6246DB3A1D603934AE0D3C8116; // 0x09C0(0x0048)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_013087F84244AD6EE2F613B7DCFCCEFC; // 0x0A08(0x0048)()
	bool                                          bDuringEmote;                                      // 0x0A50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void UpdateLipBlendTime(float NewBlendTime);
	void SetEnableLip(bool NewFlag);
	void SetLipAnimSequence(class UAnimSequenceBase* Lip_A, class UAnimSequenceBase* Lip_I, class UAnimSequenceBase* Lip_U, class UAnimSequenceBase* Lip_E, class UAnimSequenceBase* Lip_O);
	void UpdateLipType(ELipType NewType);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_AnimGraphNode_RigidBody_B6A13A334EF824A2BBBD9E86F81E0873();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_AJBPostProcessHuman_RBControlled_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_AJBPostProcessHuman_RBControlled_C")
	}
	static class UABP_AJBPostProcessHuman_RBControlled_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_AJBPostProcessHuman_RBControlled_C>();
	}
};
DUMPER7_ASSERTS_UABP_AJBPostProcessHuman_RBControlled_C;

SDK_NAMESPACE_END
