#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AJBInGameStand_WLD

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


SDK_NAMESPACE_START

// AnimBlueprintGeneratedClass ABP_AJBInGameStand_WLD.ABP_AJBInGameStand_WLD_C
// 0x0700 (0x0A58 - 0x0358)
class UABP_AJBInGameStand_WLD_C final : public UAnimInstance
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_BD83E0A34BB3C7A53DEEA8B18023256D; // 0x0368(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_EC03B96D47DEBE24929357AECDB8AD9E; // 0x03B0(0x0070)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_AC5852734610392DAD20F4B99B057AB7; // 0x0420(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_AA3EF5A2490AF94D198BF3A0E7F0FC56; // 0x0468(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_B8A1711E47912798FE8D3C84B88D58FA; // 0x04B0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_D432D1294F6D8EB98454F9BD5B9A8AE3; // 0x04F8(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_F34F234B4A95D6991E0F1F91036D41D7; // 0x0540(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_0A6404A041FFAEBAE65320BF14428029; // 0x0588(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_16D82A9D46030F8D5E70BA919B1B170E; // 0x0638(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_95A7CF7148555509E4D930AFA2B8D295; // 0x0680(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_496A6FA44CFE5738FF00028CE322C4C5; // 0x0730(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2B8488214FA50C09D0BF91A016FB04DE; // 0x0778(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_909C7FC0444A222965F566844D5C9B61; // 0x0828(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_C15EB5DD4141C56F4DE6099F2AAE0947; // 0x0870(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_EEE2C26749CACDB475FF4690D55AC1CB; // 0x0920(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_A322D63546CD160F2E31AE95DBEEA9BC; // 0x0968(0x00E0)()
	float                                         OwnerMovementRate;                                 // 0x0A48(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MoveRate;                                          // 0x0A4C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsOwnerMove;                                       // 0x0A50(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bBlocking;                                         // 0x0A51(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ABP_AJBInGameStand_WLD(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameStand_WLD_AnimGraphNode_TransitionResult_F34F234B4A95D6991E0F1F91036D41D7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameStand_WLD_AnimGraphNode_TransitionResult_AC5852734610392DAD20F4B99B057AB7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameStand_WLD_AnimGraphNode_TransitionResult_D432D1294F6D8EB98454F9BD5B9A8AE3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameStand_WLD_AnimGraphNode_TransitionResult_B8A1711E47912798FE8D3C84B88D58FA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameStand_WLD_AnimGraphNode_TransitionResult_AA3EF5A2490AF94D198BF3A0E7F0FC56();
	void CanOwnerMove(bool* bCanMove);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_AJBInGameStand_WLD_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_AJBInGameStand_WLD_C")
	}
	static class UABP_AJBInGameStand_WLD_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_AJBInGameStand_WLD_C>();
	}
};
DUMPER7_ASSERTS_UABP_AJBInGameStand_WLD_C;

SDK_NAMESPACE_END
