#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AJBInGameCharacter_C30

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


SDK_NAMESPACE_START

// AnimBlueprintGeneratedClass ABP_AJBInGameCharacter_C30.ABP_AJBInGameCharacter_C30_C
// 0x1078 (0x13D0 - 0x0358)
class UABP_AJBInGameCharacter_C30_C final : public UAnimInstance
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	class UAnimSequenceBase*                      __SUBINSTANCE_AS_Dash_3E12D8CB496D6E70979AE48EC158FFCC; // 0x0368(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpaceBase*                        __SUBINSTANCE_BS_Run_3E12D8CB496D6E70979AE48EC158FFCC; // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpaceBase*                        __SUBINSTANCE_BS_CWalk_3E12D8CB496D6E70979AE48EC158FFCC; // 0x0378(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpaceBase*                        __SUBINSTANCE_BS_Walk_3E12D8CB496D6E70979AE48EC158FFCC; // 0x0380(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          __SUBINSTANCE_AS_CIdle_3E12D8CB496D6E70979AE48EC158FFCC; // 0x0388(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          __SUBINSTANCE_AS_Idle_3E12D8CB496D6E70979AE48EC158FFCC; // 0x0390(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNode_SubInstance                  AnimGraphNode_SubInstance_3E12D8CB496D6E70979AE48EC158FFCC; // 0x0398(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_712D95194C33171A9CBE9586E095AC50; // 0x0460(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_Root_C0C52B60418393C9CBBE63AE545E5FA3; // 0x04D0(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_FC03399A4A0533E7B49124A588E2AA62; // 0x0518(0x00E0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_111795D145D6DE117571DFA98B72F7F2; // 0x05F8(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_94D9EE624CAD8725E139EE9885E199BA; // 0x06D8(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_0B2BB65D4D7154CB64D1C195BC96037C; // 0x0728(0x0050)()
	struct FAnimNode_SubInstance                  AnimGraphNode_SubInstance_6814764D4329DFCD4576F4BFC89018EE; // 0x0778(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_F5881A36433B9708F144559EE8322D95; // 0x0840(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3335FEE74B6F0E777EB58A9DDA341FE5; // 0x0920(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_A30B613646ECEC431DFB4BBB266F192F; // 0x0970(0x0050)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_271C3B9D47F42C5D9552B29D376C3C52; // 0x09C0(0x0070)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_31EFEAFA400DFACC8311CE9C88C3D0B5; // 0x0A30(0x00E0)()
	float                                         __SUBINSTANCE_CameraPitchSpaceLimitUpper_8A7AB2454F14126FA29AA1BE7C1E83C3; // 0x0B10(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __SUBINSTANCE_IsCameraPitchSpaceLimit_8A7AB2454F14126FA29AA1BE7C1E83C3; // 0x0B14(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B15[0x3];                                      // 0x0B15(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            __SUBINSTANCE_BS_SKillLoopAnimationFaceTheCameraPitchLoop01_8A7AB2454F14126FA29AA1BE7C1E83C3; // 0x0B18(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __SUBINSTANCE_IsEnableFaceTheCameraForPitchSkillAnimation01_8A7AB2454F14126FA29AA1BE7C1E83C3; // 0x0B20(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B21[0x7];                                      // 0x0B21(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            __SUBINSTANCE_BS_SKillLoopAnimationFaceTheCameraPitchLoop02_8A7AB2454F14126FA29AA1BE7C1E83C3; // 0x0B28(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __SUBINSTANCE_IsEnableFaceTheCameraForPitchSkillAnimation02_8A7AB2454F14126FA29AA1BE7C1E83C3; // 0x0B30(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          __SUBINSTANCE_ShouldPlaySkillAnimationWhileCrouching02_8A7AB2454F14126FA29AA1BE7C1E83C3; // 0x0B31(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B32[0x2];                                      // 0x0B32(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __SUBINSTANCE_LoopSkillAnimationRecoveryTime02_8A7AB2454F14126FA29AA1BE7C1E83C3; // 0x0B34(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            __SUBINSTANCE_BS_SkillLoopAnimationLoop02_8A7AB2454F14126FA29AA1BE7C1E83C3; // 0x0B38(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          __SUBINSTANCE_AS_SkillLoopAnimationStart02_8A7AB2454F14126FA29AA1BE7C1E83C3; // 0x0B40(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __SUBINSTANCE_ShouldPlaySkillAnimationWhileCrouching01_8A7AB2454F14126FA29AA1BE7C1E83C3; // 0x0B48(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B49[0x3];                                      // 0x0B49(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         __SUBINSTANCE_LoopSkillAnimationRecoveryTime01_8A7AB2454F14126FA29AA1BE7C1E83C3; // 0x0B4C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         __SUBINSTANCE_SkippableStartAnimationRemainingTime01_8A7AB2454F14126FA29AA1BE7C1E83C3; // 0x0B50(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B54[0x4];                                      // 0x0B54(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            __SUBINSTANCE_BS_SkillLoopAnimationLoop01_8A7AB2454F14126FA29AA1BE7C1E83C3; // 0x0B58(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          __SUBINSTANCE_AS_SkillLoopAnimationStart01_8A7AB2454F14126FA29AA1BE7C1E83C3; // 0x0B60(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         __SUBINSTANCE_Special_R1_SkillAnimationIndex_8A7AB2454F14126FA29AA1BE7C1E83C3; // 0x0B68(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __SUBINSTANCE_IsEnabledSpecial_R1_SkillLoopAnimation_8A7AB2454F14126FA29AA1BE7C1E83C3; // 0x0B6C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B6D[0x3];                                      // 0x0B6D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         __SUBINSTANCE_Ultimate_L1_SkillLoopAnimationIndex_8A7AB2454F14126FA29AA1BE7C1E83C3; // 0x0B70(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __SUBINSTANCE_IsEnabledUltimate_L1_SkillLoopAnimation_8A7AB2454F14126FA29AA1BE7C1E83C3; // 0x0B74(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B75[0x3];                                      // 0x0B75(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_SubInstance                  AnimGraphNode_SubInstance_8A7AB2454F14126FA29AA1BE7C1E83C3; // 0x0B78(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_B692BE5C49E4543ED4B7008D7597D27A; // 0x0C40(0x00D0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_70134FA549344E0EF72763B1F8292493; // 0x0D10(0x00E0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_6EDD23E847FA509A7D46BAB896A4A76A; // 0x0DF0(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_057649B0479D432F24204B862DBAACF1; // 0x0ED0(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_985325874CBA6A4CC9D7CCBDC2ED447A; // 0x0F20(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1AB6945440931DC385A2E7A1DC8B08F2; // 0x0F70(0x0050)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2E2217734194BEFF68D29BAC02ED49E2; // 0x0FC0(0x0070)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_A932C8DE4D5EC7448290E881D8EA44E5; // 0x1030(0x00E0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_E29FAACB49F7CF190ADAFFA68DBC6EBD; // 0x1110(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_72107D474BA3AC8F674862BAC853476B; // 0x11F0(0x0050)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_247D4E69439F40109B3975BC71AD21E9; // 0x1240(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_00F9E9F641EA7626AC1E11B919E44B17; // 0x1320(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_B4DFA8E44CF1ACD537051298BCF1696F; // 0x1370(0x0050)()
	bool                                          IsUlt;                                             // 0x13C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsCameraPitchSpaceLimit;                           // 0x13C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_13C2[0x6];                                     // 0x13C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C30_C*           OwnerCharacter;                                    // 0x13C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ABP_AJBInGameCharacter_C30(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void Inactive_Skill(class UBP_AJBSkillBase_C* InactiveSkill, bool bRenaturation);
	void Ready_Skill(class UBP_AJBSkillBase_C* ReadySkill, bool bRenaturation);
	void BlueprintBeginPlay();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameCharacter_C30_AnimGraphNode_BlendListByBool_B692BE5C49E4543ED4B7008D7597D27A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameCharacter_C30_AnimGraphNode_SubInstance_8A7AB2454F14126FA29AA1BE7C1E83C3();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_AJBInGameCharacter_C30_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_AJBInGameCharacter_C30_C")
	}
	static class UABP_AJBInGameCharacter_C30_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_AJBInGameCharacter_C30_C>();
	}
};
DUMPER7_ASSERTS_UABP_AJBInGameCharacter_C30_C;

SDK_NAMESPACE_END
