#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AJBInGameCharacter_ABC

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


SDK_NAMESPACE_START

// AnimBlueprintGeneratedClass ABP_AJBInGameCharacter_ABC.ABP_AJBInGameCharacter_ABC_C
// 0x0508 (0x0860 - 0x0358)
class UABP_AJBInGameCharacter_ABC_C final : public UAnimInstance
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_C1A5213E45684B0F949A83B03FDD538C; // 0x0368(0x0048)()
	class UAnimSequenceBase*                      __SUBINSTANCE_AS_JumpLoop_A933DDC3402639B6236E54913CE93271; // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __SUBINSTANCE_AS_JumpEnd_A933DDC3402639B6236E54913CE93271; // 0x03B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __SUBINSTANCE_AS_JumpStart_A933DDC3402639B6236E54913CE93271; // 0x03C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __SUBINSTANCE_AS_DeathLoop_A933DDC3402639B6236E54913CE93271; // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      __SUBINSTANCE_AS_Dash_A933DDC3402639B6236E54913CE93271; // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpaceBase*                        __SUBINSTANCE_BS_Run_A933DDC3402639B6236E54913CE93271; // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpaceBase*                        __SUBINSTANCE_BS_CWalk_A933DDC3402639B6236E54913CE93271; // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpaceBase*                        __SUBINSTANCE_BS_Walk_A933DDC3402639B6236E54913CE93271; // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          __SUBINSTANCE_AS_CIdle_A933DDC3402639B6236E54913CE93271; // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          __SUBINSTANCE_AS_Idle_A933DDC3402639B6236E54913CE93271; // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAnimNode_SubInstance                  AnimGraphNode_SubInstance_A933DDC3402639B6236E54913CE93271; // 0x0400(0x00C8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_31A1B26346C026FFCF4DBE9A0FF7F2E2; // 0x04C8(0x0070)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_47C98072429E430F1A81FEAFC0AEEC2F; // 0x0538(0x00E0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_128084CA4D4837358E968E8E82B652F8; // 0x0618(0x00E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_D8AB923C4977FBD8A72D73AC11BCDFA2; // 0x06F8(0x0050)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_E5B909BF453B916937A408BF1D48E86B; // 0x0748(0x0050)()
	struct FAnimNode_SubInstance                  AnimGraphNode_SubInstance_6D55EC3648F7E84BBBB2DC92B82647DA; // 0x0798(0x00C8)()

public:
	void ExecuteUbergraph_ABP_AJBInGameCharacter_ABC(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_AJBInGameCharacter_ABC_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_AJBInGameCharacter_ABC_C")
	}
	static class UABP_AJBInGameCharacter_ABC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_AJBInGameCharacter_ABC_C>();
	}
};
DUMPER7_ASSERTS_UABP_AJBInGameCharacter_ABC_C;

SDK_NAMESPACE_END
