#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AJBInGameStand_PPH

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


SDK_NAMESPACE_START

// AnimBlueprintGeneratedClass ABP_AJBInGameStand_PPH.ABP_AJBInGameStand_PPH_C
// 0x0D18 (0x1070 - 0x0358)
class UABP_AJBInGameStand_PPH_C final : public UAnimInstance
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_019106BB449573C1E68A188CBBA798AE; // 0x0368(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_A1C878B044CFFB2D3AF7DF8BE63A2D25; // 0x03B0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_FF0007C94789EE30A79EBC99B3814AE1; // 0x03F8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_E251543C4D74B717092B78922EBAFE87; // 0x0440(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_0CF72A7A451D3D4F7013D8A294C9331A; // 0x04F0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6313BF4F4A89ADFB8023DC8BC1530218; // 0x0538(0x00B0)()
	struct FAnimNode_Root                         AnimGraphNode_StateResult_EA905E6C405595C3A004C3A0B39C2033; // 0x05E8(0x0048)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_47F53CFC4A37D10C5E6701A2F738DFE2; // 0x0630(0x00E0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_F325C2CD46CB022EBEB615B1B2917A89; // 0x0710(0x0070)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_FB63CDF34B916A8C9CABE78A76144B52; // 0x0780(0x0160)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_46C0B8DA4A63E814827D99B4FBEC2370; // 0x08E0(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4B03BA6D4BE02551EADE4AB6D126DC6E; // 0x0928(0x0048)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8EEDC0C14BE4391F90D9B585D9E3BB7A; // 0x0970(0x0160)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_54C7EF35464672AAFE80E28874AAF2FF; // 0x0AD0(0x0160)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6E36F7B94022834378D3AE92F20B0F7F; // 0x0C30(0x0160)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4D4C9249474D63440C4C2DB93E249155; // 0x0D90(0x0160)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2649FD5F4D861D0D1C8F8B9ADA1C6F09; // 0x0EF0(0x0160)()
	bool                                          bIsOwnerMove;                                      // 0x1050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1051[0x3];                                     // 0x1051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OwnerMovementRate;                                 // 0x1054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MoveRate;                                          // 0x1058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_105C[0x4];                                     // 0x105C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<bool>                                  CapsuleBoneVisibilityList;                         // 0x1060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_ABP_AJBInGameStand_PPH(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameStand_PPH_AnimGraphNode_ModifyBone_2649FD5F4D861D0D1C8F8B9ADA1C6F09();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameStand_PPH_AnimGraphNode_ModifyBone_4D4C9249474D63440C4C2DB93E249155();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameStand_PPH_AnimGraphNode_ModifyBone_6E36F7B94022834378D3AE92F20B0F7F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameStand_PPH_AnimGraphNode_ModifyBone_54C7EF35464672AAFE80E28874AAF2FF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameStand_PPH_AnimGraphNode_ModifyBone_8EEDC0C14BE4391F90D9B585D9E3BB7A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameStand_PPH_AnimGraphNode_ModifyBone_FB63CDF34B916A8C9CABE78A76144B52();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameStand_PPH_AnimGraphNode_TransitionResult_FF0007C94789EE30A79EBC99B3814AE1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBInGameStand_PPH_AnimGraphNode_TransitionResult_A1C878B044CFFB2D3AF7DF8BE63A2D25();
	void CanOwnerMove(bool* bCanMove);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_AJBInGameStand_PPH_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_AJBInGameStand_PPH_C")
	}
	static class UABP_AJBInGameStand_PPH_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_AJBInGameStand_PPH_C>();
	}
};
DUMPER7_ASSERTS_UABP_AJBInGameStand_PPH_C;

SDK_NAMESPACE_END
