#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_AJBPostProcessHuman_RBControlled_FGO

#include "Basic.hpp"

#include "ImmediatePhysics_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


SDK_NAMESPACE_START

// AnimBlueprintGeneratedClass ABP_AJBPostProcessHuman_RBControlled_FGO.ABP_AJBPostProcessHuman_RBControlled_FGO_C
// 0x06F8 (0x0A50 - 0x0358)
class UABP_AJBPostProcessHuman_RBControlled_FGO_C final : public UAnimInstance
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0360(0x0008)(Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_72DD009740E947F3E8D10984B9D5F5D3; // 0x0368(0x0048)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_B8BA368F4558BD2968B09B9434ECB571; // 0x03B0(0x05A0)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_A349F9BA457992F709D2F8BDD8ECDDF2; // 0x0950(0x0048)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_0922EB17450DA9507A8F13A35714AFDF; // 0x0998(0x0048)()
	struct FAnimNode_SubInput                     AnimGraphNode_SubInput_C0962BAD4F59733E8026DA9C019F1453; // 0x09E0(0x0068)()
	bool                                          bDisableRigidBodyByJump;                           // 0x0A48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bDuringEmote;                                      // 0x0A49(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bDuringAction;                                     // 0x0A4A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_FGO(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_AJBPostProcessHuman_RBControlled_FGO_AnimGraphNode_RigidBody_B8BA368F4558BD2968B09B9434ECB571();
	void OnJump();
	void BlueprintUpdateAnimation(float DeltaTimeX);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_AJBPostProcessHuman_RBControlled_FGO_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_AJBPostProcessHuman_RBControlled_FGO_C")
	}
	static class UABP_AJBPostProcessHuman_RBControlled_FGO_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_AJBPostProcessHuman_RBControlled_FGO_C>();
	}
};
DUMPER7_ASSERTS_UABP_AJBPostProcessHuman_RBControlled_FGO_C;

SDK_NAMESPACE_END
