#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AJB_CommonExtension

#include "Basic.hpp"

#include "AIModule_classes.hpp"


SDK_NAMESPACE_START

// Class AJB_CommonExtension.BTComposite_RandomSequence
// 0x0018 (0x00A8 - 0x0090)
class UBTComposite_RandomSequence final : public UBTCompositeNode
{
public:
	uint8                                         Pad_90[0x18];                                      // 0x0090(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BTComposite_RandomSequence")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTComposite_RandomSequence")
	}
	static class UBTComposite_RandomSequence* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTComposite_RandomSequence>();
	}
};
DUMPER7_ASSERTS_UBTComposite_RandomSequence;

// Class AJB_CommonExtension.BTComposite_WeightedRandom
// 0x0008 (0x0098 - 0x0090)
class UBTComposite_WeightedRandom final : public UBTCompositeNode
{
public:
	float                                         LeftChildSelectingRate;                            // 0x0090(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BTComposite_WeightedRandom")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTComposite_WeightedRandom")
	}
	static class UBTComposite_WeightedRandom* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTComposite_WeightedRandom>();
	}
};
DUMPER7_ASSERTS_UBTComposite_WeightedRandom;

// Class AJB_CommonExtension.EnvQueryTest_DistanceAlongLine
// 0x0010 (0x01D0 - 0x01C0)
class UEnvQueryTest_DistanceAlongLine final : public UEnvQueryTest
{
public:
	TSubclassOf<class UEnvQueryContext>           LineFromActor;                                     // 0x01C0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UEnvQueryContext>           LineToVector;                                      // 0x01C8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EnvQueryTest_DistanceAlongLine")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EnvQueryTest_DistanceAlongLine")
	}
	static class UEnvQueryTest_DistanceAlongLine* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnvQueryTest_DistanceAlongLine>();
	}
};
DUMPER7_ASSERTS_UEnvQueryTest_DistanceAlongLine;

// Class AJB_CommonExtension.EnvQueryTest_DistanceToLine
// 0x0010 (0x01D0 - 0x01C0)
class UEnvQueryTest_DistanceToLine final : public UEnvQueryTest
{
public:
	TSubclassOf<class UEnvQueryContext>           LineFromActor;                                     // 0x01C0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UEnvQueryContext>           LineToVector;                                      // 0x01C8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EnvQueryTest_DistanceToLine")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EnvQueryTest_DistanceToLine")
	}
	static class UEnvQueryTest_DistanceToLine* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnvQueryTest_DistanceToLine>();
	}
};
DUMPER7_ASSERTS_UEnvQueryTest_DistanceToLine;

// Class AJB_CommonExtension.EnvQueryTest_RandomScore
// 0x0008 (0x01C8 - 0x01C0)
class UEnvQueryTest_RandomScore final : public UEnvQueryTest
{
public:
	float                                         RandomValueMin;                                    // 0x01C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RandomValueMax;                                    // 0x01C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EnvQueryTest_RandomScore")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EnvQueryTest_RandomScore")
	}
	static class UEnvQueryTest_RandomScore* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnvQueryTest_RandomScore>();
	}
};
DUMPER7_ASSERTS_UEnvQueryTest_RandomScore;

SDK_NAMESPACE_END
