#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AJB

#include "Basic.hpp"

#include "AJB_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "InputCore_structs.hpp"
#include "AIModule_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AmwPlugin_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "MovieScene_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function AJB.AJBInGame2DGeoManager.FindDistance
// 0x0010 (0x0010 - 0x0000)
struct AJBInGame2DGeoManager_FindDistance final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBInGame2DGeoManager_FindDistance;

// Function AJB.ActorCluster.CalcCenterLocationOfActors
// 0x000C (0x000C - 0x0000)
struct ActorCluster_CalcCenterLocationOfActors final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorCluster_CalcCenterLocationOfActors;

// Function AJB.ActorClusterHost.ClusterKMeansPPByLocation
// 0x0020 (0x0020 - 0x0000)
struct ActorClusterHost_ClusterKMeansPPByLocation final
{
public:
	TArray<class AActor*>                         Actors;                                            // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         CountOfCluster;                                    // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CountOfClusteringMax;                              // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLocationXYOnlyArg;                                // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ActorClusterHost_ClusterKMeansPPByLocation;

// Function AJB.AJBInGameAIController.GetContextActor
// 0x0008 (0x0008 - 0x0000)
struct AJBInGameAIController_GetContextActor final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBInGameAIController_GetContextActor;

// Function AJB.AJBAIEnvironmentBlock.AddBurningActor
// 0x0008 (0x0008 - 0x0000)
struct AJBAIEnvironmentBlock_AddBurningActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBAIEnvironmentBlock_AddBurningActor;

// Function AJB.AJBAIEnvironmentBlock.AddDoor
// 0x0010 (0x0010 - 0x0000)
struct AJBAIEnvironmentBlock_AddDoor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsNotInHouse;                                     // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AJBAIEnvironmentBlock_AddDoor;

// Function AJB.AJBAIEnvironmentBlock.AddGate
// 0x0008 (0x0008 - 0x0000)
struct AJBAIEnvironmentBlock_AddGate final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBAIEnvironmentBlock_AddGate;

// Function AJB.AJBAIEnvironmentBlock.AddHouseInfo
// 0x0008 (0x0008 - 0x0000)
struct AJBAIEnvironmentBlock_AddHouseInfo final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBAIEnvironmentBlock_AddHouseInfo;

// Function AJB.AJBAIEnvironmentBlock.AddStartPoint
// 0x000C (0x000C - 0x0000)
struct AJBAIEnvironmentBlock_AddStartPoint final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBAIEnvironmentBlock_AddStartPoint;

// Function AJB.AJBAIEnvironmentBlock.AddTrap
// 0x0008 (0x0008 - 0x0000)
struct AJBAIEnvironmentBlock_AddTrap final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBAIEnvironmentBlock_AddTrap;

// Function AJB.AJBAIEnvironmentBlock.AddWaySpotByActor
// 0x0008 (0x0008 - 0x0000)
struct AJBAIEnvironmentBlock_AddWaySpotByActor final
{
public:
	const class AActor*                           Actor;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBAIEnvironmentBlock_AddWaySpotByActor;

// Function AJB.AJBAIEnvironmentBlock.AddWaySpotByLocation
// 0x000C (0x000C - 0x0000)
struct AJBAIEnvironmentBlock_AddWaySpotByLocation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBAIEnvironmentBlock_AddWaySpotByLocation;

// Function AJB.AJBAIEnvironmentBlock.AddWindow
// 0x0008 (0x0008 - 0x0000)
struct AJBAIEnvironmentBlock_AddWindow final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBAIEnvironmentBlock_AddWindow;

// Function AJB.AJBAIEnvironmentBlock.RemoveBurningActor
// 0x0008 (0x0008 - 0x0000)
struct AJBAIEnvironmentBlock_RemoveBurningActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBAIEnvironmentBlock_RemoveBurningActor;

// Function AJB.AJBAIEnvironmentBlock.RemoveTrap
// 0x0008 (0x0008 - 0x0000)
struct AJBAIEnvironmentBlock_RemoveTrap final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBAIEnvironmentBlock_RemoveTrap;

// Function AJB.AJBAIEnvironmentBlock.GetCenterLocation
// 0x000C (0x000C - 0x0000)
struct AJBAIEnvironmentBlock_GetCenterLocation final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBAIEnvironmentBlock_GetCenterLocation;

// Function AJB.AJBInGameAIDirectorComponent.DebugRequestAddNPCFromDebugActor
// 0x0008 (0x0008 - 0x0000)
struct AJBInGameAIDirectorComponent_DebugRequestAddNPCFromDebugActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBInGameAIDirectorComponent_DebugRequestAddNPCFromDebugActor;

// Function AJB.AJBInGameAIDirectorComponent.DebugRequestAddNPCFromDebugArgs
// 0x0040 (0x0040 - 0x0000)
struct AJBInGameAIDirectorComponent_DebugRequestAddNPCFromDebugArgs final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x000C(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  AddInfoTags;                                       // 0x0018(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	int32                                         AILevel;                                           // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AJBInGameAIDirectorComponent_DebugRequestAddNPCFromDebugArgs;

// Function AJB.AJBInGameAIDirectorComponent.DebugRequestByGameplayTags
// 0x0038 (0x0038 - 0x0000)
struct AJBInGameAIDirectorComponent_DebugRequestByGameplayTags final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  Tags;                                              // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FVector                                VectorIn;                                          // 0x0028(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AJBInGameAIDirectorComponent_DebugRequestByGameplayTags;

// Function AJB.AJBInGameAIDirectorComponent.DebugRequestHideDebugInfo
// 0x0008 (0x0008 - 0x0000)
struct AJBInGameAIDirectorComponent_DebugRequestHideDebugInfo final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBInGameAIDirectorComponent_DebugRequestHideDebugInfo;

// Function AJB.AJBInGameAIDirectorComponent.DebugRequestNPCAllLog
// 0x0010 (0x0010 - 0x0000)
struct AJBInGameAIDirectorComponent_DebugRequestNPCAllLog final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NPCId;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AJBInGameAIDirectorComponent_DebugRequestNPCAllLog;

// Function AJB.AJBInGameAIDirectorComponent.DebugRequestRestartBehavior
// 0x0004 (0x0004 - 0x0000)
struct AJBInGameAIDirectorComponent_DebugRequestRestartBehavior final
{
public:
	int32                                         DebugMenuIndex;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBInGameAIDirectorComponent_DebugRequestRestartBehavior;

// Function AJB.AJBInGameAIDirectorComponent.DebugRequestShowDebugInfo
// 0x0008 (0x0008 - 0x0000)
struct AJBInGameAIDirectorComponent_DebugRequestShowDebugInfo final
{
public:
	class APlayerController*                      PlayerController;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBInGameAIDirectorComponent_DebugRequestShowDebugInfo;

// Function AJB.AJBAIFunctionLibrary.AabbContainsAabb
// 0x003C (0x003C - 0x0000)
struct AJBAIFunctionLibrary_AabbContainsAabb final
{
public:
	struct FBox                                   Box;                                               // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FBox                                   Other;                                             // 0x001C(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AJBAIFunctionLibrary_AabbContainsAabb;

// Function AJB.AJBAIFunctionLibrary.AabbContainsPoint
// 0x002C (0x002C - 0x0000)
struct AJBAIFunctionLibrary_AabbContainsPoint final
{
public:
	struct FBox                                   Box;                                               // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                Point;                                             // 0x001C(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AJBAIFunctionLibrary_AabbContainsPoint;

// Function AJB.AJBAIFunctionLibrary.DeprojectScreenPositionToWorldForAI
// 0x0048 (0x0048 - 0x0000)
struct AJBAIFunctionLibrary_DeprojectScreenPositionToWorldForAI final
{
public:
	float                                         ScreenX;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScreenY;                                           // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0008(0x000C)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x0014(0x000C)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         FOV;                                               // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ViewSize;                                          // 0x0024(0x0008)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                WorldLocation;                                     // 0x002C(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                WorldDirection;                                    // 0x0038(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0044(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AJBAIFunctionLibrary_DeprojectScreenPositionToWorldForAI;

// Function AJB.AJBAIFunctionLibrary.GetBlackboardKeyName
// 0x0030 (0x0030 - 0x0000)
struct AJBAIFunctionLibrary_GetBlackboardKeyName final
{
public:
	struct FBlackboardKeySelector                 Key;                                               // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBAIFunctionLibrary_GetBlackboardKeyName;

// Function AJB.AJBAIFunctionLibrary.GetClosestPointOnAabb
// 0x0034 (0x0034 - 0x0000)
struct AJBAIFunctionLibrary_GetClosestPointOnAabb final
{
public:
	struct FBox                                   Box;                                               // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                Point;                                             // 0x001C(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0028(0x000C)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBAIFunctionLibrary_GetClosestPointOnAabb;

// Function AJB.AJBAIFunctionLibrary.InvalidLocation
// 0x000C (0x000C - 0x0000)
struct AJBAIFunctionLibrary_InvalidLocation final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBAIFunctionLibrary_InvalidLocation;

// Function AJB.AJBAIFunctionLibrary.IsFinite
// 0x0008 (0x0008 - 0x0000)
struct AJBAIFunctionLibrary_IsFinite final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AJBAIFunctionLibrary_IsFinite;

// Function AJB.AJBAIFunctionLibrary.IsNaN
// 0x0008 (0x0008 - 0x0000)
struct AJBAIFunctionLibrary_IsNaN final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AJBAIFunctionLibrary_IsNaN;

// Function AJB.AJBAIFunctionLibrary.IsSameParentBTNode
// 0x0018 (0x0018 - 0x0000)
struct AJBAIFunctionLibrary_IsSameParentBTNode final
{
public:
	class UBTDecorator_BlueprintBase*             Decorator;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBTService_BlueprintBase*               Service;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AJBAIFunctionLibrary_IsSameParentBTNode;

// Function AJB.AJBAIFunctionLibrary.LineAabbIntersection
// 0x0038 (0x0038 - 0x0000)
struct AJBAIFunctionLibrary_LineAabbIntersection final
{
public:
	struct FBox                                   Box;                                               // 0x0000(0x001C)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                Start;                                             // 0x001C(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                End;                                               // 0x0028(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0034(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AJBAIFunctionLibrary_LineAabbIntersection;

// Function AJB.AJBAIFunctionLibrary.MakeBoundingBoxFromLocations
// 0x0030 (0x0030 - 0x0000)
struct AJBAIFunctionLibrary_MakeBoundingBoxFromLocations final
{
public:
	TArray<struct FVector>                        Locations;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	struct FBox                                   OutBox;                                            // 0x0010(0x001C)(Parm, OutParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AJBAIFunctionLibrary_MakeBoundingBoxFromLocations;

// Function AJB.AJBInGameAIEnvironmentComponent.RequestAddBurningActor
// 0x0008 (0x0008 - 0x0000)
struct AJBInGameAIEnvironmentComponent_RequestAddBurningActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBInGameAIEnvironmentComponent_RequestAddBurningActor;

// Function AJB.AJBInGameAIEnvironmentComponent.RequestAddSpawnedItem
// 0x0008 (0x0008 - 0x0000)
struct AJBInGameAIEnvironmentComponent_RequestAddSpawnedItem final
{
public:
	class AActor*                                 Item;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBInGameAIEnvironmentComponent_RequestAddSpawnedItem;

// Function AJB.AJBInGameAIEnvironmentComponent.RequestAddTrap
// 0x0008 (0x0008 - 0x0000)
struct AJBInGameAIEnvironmentComponent_RequestAddTrap final
{
public:
	class AActor*                                 Trap;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBInGameAIEnvironmentComponent_RequestAddTrap;

// Function AJB.AJBInGameAIEnvironmentComponent.RequestAIGion
// 0x0020 (0x0020 - 0x0000)
struct AJBInGameAIEnvironmentComponent_RequestAIGion final
{
public:
	struct FGameplayTag                           GionEffectType;                                    // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 GionOwner;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0010(0x000C)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AJBInGameAIEnvironmentComponent_RequestAIGion;

// Function AJB.AJBInGameAIEnvironmentComponent.SetupEnvironmentBlocks
// 0x0010 (0x0010 - 0x0000)
struct AJBInGameAIEnvironmentComponent_SetupEnvironmentBlocks final
{
public:
	class AActor*                                 NavMeshVolume;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlockUnitSizeIn;                                   // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AJBInGameAIEnvironmentComponent_SetupEnvironmentBlocks;

// Function AJB.AJBInGameAIEnvironmentComponent.GetBlockIndex
// 0x0010 (0x0010 - 0x0000)
struct AJBInGameAIEnvironmentComponent_GetBlockIndex final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBInGameAIEnvironmentComponent_GetBlockIndex;

// Function AJB.AJBInGameAIEnvironmentComponent.GetBlockIndexAround
// 0x0010 (0x0010 - 0x0000)
struct AJBInGameAIEnvironmentComponent_GetBlockIndexAround final
{
public:
	int32                                         BlockIndexCenter;                                  // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OffsetCountX;                                      // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OffsetCountY;                                      // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBInGameAIEnvironmentComponent_GetBlockIndexAround;

// Function AJB.AJBInGameAIEnvironmentComponent.IsInNavMeshVolume
// 0x0010 (0x0010 - 0x0000)
struct AJBInGameAIEnvironmentComponent_IsInNavMeshVolume final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AJBInGameAIEnvironmentComponent_IsInNavMeshVolume;

// Function AJB.AJBAMErrorObserverActor.FinishGameServerCheck
// 0x0001 (0x0001 - 0x0000)
struct AJBAMErrorObserverActor_FinishGameServerCheck final
{
public:
	EAJBTestModeGameServerError                   Result;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBAMErrorObserverActor_FinishGameServerCheck;

// Function AJB.AJBAMErrorObserverActor.FinishUploapErrorLog
// 0x0001 (0x0001 - 0x0000)
struct AJBAMErrorObserverActor_FinishUploapErrorLog final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBAMErrorObserverActor_FinishUploapErrorLog;

// Function AJB.AJBAMErrorObserverActor.FinishUploapHeadClerk
// 0x0001 (0x0001 - 0x0000)
struct AJBAMErrorObserverActor_FinishUploapHeadClerk final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBAMErrorObserverActor_FinishUploapHeadClerk;

// Function AJB.AJBAMErrorObserverActor.OnShowErrorWindow
// 0x0001 (0x0001 - 0x0000)
struct AJBAMErrorObserverActor_OnShowErrorWindow final
{
public:
	EAJBErrorID                                   ErrorID;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBAMErrorObserverActor_OnShowErrorWindow;

// Function AJB.AJBAMErrorObserverActor.SetEnableErrorCheck
// 0x0001 (0x0001 - 0x0000)
struct AJBAMErrorObserverActor_SetEnableErrorCheck final
{
public:
	bool                                          bIsEnable;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBAMErrorObserverActor_SetEnableErrorCheck;

// Function AJB.AJBAMErrorObserverActor.SetEnableUpload
// 0x0001 (0x0001 - 0x0000)
struct AJBAMErrorObserverActor_SetEnableUpload final
{
public:
	bool                                          bIsEnable;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBAMErrorObserverActor_SetEnableUpload;

// Function AJB.AJBInGameAIInputProxyComponent.DebugResetOwnerController
// 0x0008 (0x0008 - 0x0000)
struct AJBInGameAIInputProxyComponent_DebugResetOwnerController final
{
public:
	class AController*                            OwnerControllerIn;                                 // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBInGameAIInputProxyComponent_DebugResetOwnerController;

// Function AJB.AJBInGameAIInputProxyComponent.SetMovement
// 0x0010 (0x0010 - 0x0000)
struct AJBInGameAIInputProxyComponent_SetMovement final
{
public:
	float                                         Forward;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Right;                                             // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Turn;                                              // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LookUp;                                            // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBInGameAIInputProxyComponent_SetMovement;

// Function AJB.AJBAMLED.ALLOffLED
// 0x0008 (0x0008 - 0x0000)
struct AJBAMLED_ALLOffLED final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBAMLED_ALLOffLED;

// Function AJB.AJBAMLED.SetAJBBoardLEDPattern
// 0x0010 (0x0010 - 0x0000)
struct AJBAMLED_SetAJBBoardLEDPattern final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAJBBoardLEDPattern                           Pattern;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AJBAMLED_SetAJBBoardLEDPattern;

// Function AJB.AJBAMLED.SetBoardBackLEDColor
// 0x0010 (0x0010 - 0x0000)
struct AJBAMLED_SetBoardBackLEDColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBAMLED_SetBoardBackLEDColor;

// Function AJB.AJBAMLED.SetBoardCenterLEDColor
// 0x0010 (0x0010 - 0x0000)
struct AJBAMLED_SetBoardCenterLEDColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBAMLED_SetBoardCenterLEDColor;

// Function AJB.AJBAMLED.SetBoardFrontLEDColor
// 0x0004 (0x0004 - 0x0000)
struct AJBAMLED_SetBoardFrontLEDColor final
{
public:
	int32                                         bright;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBAMLED_SetBoardFrontLEDColor;

// Function AJB.AJBAMLED.SetQRCameraLED
// 0x0001 (0x0001 - 0x0000)
struct AJBAMLED_SetQRCameraLED final
{
public:
	bool                                          bOn;                                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBAMLED_SetQRCameraLED;

// Function AJB.AJBAMLED.SetSideLEDColor
// 0x0010 (0x0010 - 0x0000)
struct AJBAMLED_SetSideLEDColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBAMLED_SetSideLEDColor;

// Function AJB.AJBAMSystemObject.ActiveAJBError
// 0x0020 (0x0020 - 0x0000)
struct AJBAMSystemObject_ActiveAJBError final
{
public:
	class UAJBGameInstance*                       GameInstance;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAJBErrorID                                   ErrorID;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DetailLog;                                         // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBAMSystemObject_ActiveAJBError;

// Function AJB.AJBAMSystemObject.AddAJBError
// 0x0020 (0x0020 - 0x0000)
struct AJBAMSystemObject_AddAJBError final
{
public:
	class UAJBGameInstance*                       GameInstance;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAJBErrorID                                   ErrorID;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DetailLog;                                         // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBAMSystemObject_AddAJBError;

// Function AJB.AJBAMSystemObject.AddNoticeNetError
// 0x0010 (0x0010 - 0x0000)
struct AJBAMSystemObject_AddNoticeNetError final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAJBNetAPIResult                              Result;                                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AJBAMSystemObject_AddNoticeNetError;

// Function AJB.AJBAMSystemObject.ChangeAMStatus
// 0x0010 (0x0010 - 0x0000)
struct AJBAMSystemObject_ChangeAMStatus final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAMStatus                                     ChangeStatus;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AJBAMSystemObject_ChangeAMStatus;

// Function AJB.AJBAMSystemObject.CheckAJBDongleError
// 0x0008 (0x0008 - 0x0000)
struct AJBAMSystemObject_CheckAJBDongleError final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBAMSystemObject_CheckAJBDongleError;

// Function AJB.AJBAMSystemObject.CheckAJBSerialNumber
// 0x0020 (0x0020 - 0x0000)
struct AJBAMSystemObject_CheckAJBSerialNumber final
{
public:
	bool                                          Repossession;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 outSerialNumber;                                   // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAJBErrorID                                   ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AJBAMSystemObject_CheckAJBSerialNumber;

// Function AJB.AJBAMSystemObject.CheckAJBSerialNumberAndNetID
// 0x0028 (0x0028 - 0x0000)
struct AJBAMSystemObject_CheckAJBSerialNumberAndNetID final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Repossession;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 outSerialNumber;                                   // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAJBErrorID                                   ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AJBAMSystemObject_CheckAJBSerialNumberAndNetID;

// Function AJB.AJBAMSystemObject.GetActiveDongleError
// 0x0010 (0x0010 - 0x0000)
struct AJBAMSystemObject_GetActiveDongleError final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAJBErrorID                                   ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AJBAMSystemObject_GetActiveDongleError;

// Function AJB.AJBAMSystemObject.InactiveAJBError
// 0x0010 (0x0010 - 0x0000)
struct AJBAMSystemObject_InactiveAJBError final
{
public:
	class UAJBGameInstance*                       GameInstance;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAJBErrorID                                   ErrorID;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AJBAMSystemObject_InactiveAJBError;

// Function AJB.AJBAMSystemObject.InactiveAMErrorFromList
// 0x0018 (0x0018 - 0x0000)
struct AJBAMSystemObject_InactiveAMErrorFromList final
{
public:
	class UAJBGameInstance*                       GameInstance;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<EAJBErrorID>                           ErrorList;                                         // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBAMSystemObject_InactiveAMErrorFromList;

// Function AJB.AJBAMSystemObject.IsAMSystemErrorMode
// 0x0010 (0x0010 - 0x0000)
struct AJBAMSystemObject_IsAMSystemErrorMode final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AJBAMSystemObject_IsAMSystemErrorMode;

// Function AJB.AJBAMSystemObject.OutNoticeNetError
// 0x0010 (0x0010 - 0x0000)
struct AJBAMSystemObject_OutNoticeNetError final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAJBNetAPIResult                              ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AJBAMSystemObject_OutNoticeNetError;

// Function AJB.AJBAMSystemObject.SetAJBCoinLock
// 0x0010 (0x0010 - 0x0000)
struct AJBAMSystemObject_SetAJBCoinLock final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Lock;                                              // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AJBAMSystemObject_SetAJBCoinLock;

// Function AJB.AJBAMSystemObject.SetAJBEmoneyTouchWaitStatus
// 0x0010 (0x0010 - 0x0000)
struct AJBAMSystemObject_SetAJBEmoneyTouchWaitStatus final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsWait;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AJBAMSystemObject_SetAJBEmoneyTouchWaitStatus;

// Function AJB.AJBAMSystemObject.UpdateAMErrorFromList
// 0x0020 (0x0020 - 0x0000)
struct AJBAMSystemObject_UpdateAMErrorFromList final
{
public:
	class UAJBGameInstance*                       GameInstance;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAJBErrorID                                   ErrorID;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EAJBErrorID>                           ErrorList;                                         // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBAMSystemObject_UpdateAMErrorFromList;

// Function AJB.AJBAMSystemObject.FindFistAMSystemErrorMode
// 0x0001 (0x0001 - 0x0000)
struct AJBAMSystemObject_FindFistAMSystemErrorMode final
{
public:
	EAJBErrorID                                   ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBAMSystemObject_FindFistAMSystemErrorMode;

// Function AJB.AJBAMSystemObject.FindFistLocalNetworkError
// 0x0001 (0x0001 - 0x0000)
struct AJBAMSystemObject_FindFistLocalNetworkError final
{
public:
	EAJBErrorID                                   ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBAMSystemObject_FindFistLocalNetworkError;

// Function AJB.AJBAMSystemObject.FindFistNetworkError
// 0x0001 (0x0001 - 0x0000)
struct AJBAMSystemObject_FindFistNetworkError final
{
public:
	EAJBErrorID                                   ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBAMSystemObject_FindFistNetworkError;

// Function AJB.AJBAMSystemObject.IsActiveAJBError
// 0x0002 (0x0002 - 0x0000)
struct AJBAMSystemObject_IsActiveAJBError final
{
public:
	EAJBErrorID                                   ErrorID;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBAMSystemObject_IsActiveAJBError;

// Function AJB.AJBAMSystemObject.ReserveTestModeTransition
// 0x0008 (0x0008 - 0x0000)
struct AJBAMSystemObject_ReserveTestModeTransition final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBAMSystemObject_ReserveTestModeTransition;

// Function AJB.AJBInGameCharacterBase.CleanUp
// 0x0001 (0x0001 - 0x0000)
struct AJBInGameCharacterBase_CleanUp final
{
public:
	bool                                          bShouldDestroy;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBInGameCharacterBase_CleanUp;

// Function AJB.AJBInGameCharacterBase.LookupRate
// 0x0004 (0x0004 - 0x0000)
struct AJBInGameCharacterBase_LookupRate final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBInGameCharacterBase_LookupRate;

// Function AJB.AJBInGameCharacterBase.MoveForward
// 0x0004 (0x0004 - 0x0000)
struct AJBInGameCharacterBase_MoveForward final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBInGameCharacterBase_MoveForward;

// Function AJB.AJBInGameCharacterBase.MoveRight
// 0x0004 (0x0004 - 0x0000)
struct AJBInGameCharacterBase_MoveRight final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBInGameCharacterBase_MoveRight;

// Function AJB.AJBInGameCharacterBase.SetMatchingPlayerIndex
// 0x0004 (0x0004 - 0x0000)
struct AJBInGameCharacterBase_SetMatchingPlayerIndex final
{
public:
	int32                                         NewMatchingPlayerIndex;                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBInGameCharacterBase_SetMatchingPlayerIndex;

// Function AJB.AJBInGameCharacterBase.SetPairCharacter
// 0x0008 (0x0008 - 0x0000)
struct AJBInGameCharacterBase_SetPairCharacter final
{
public:
	class AAJBInGameCharacterBase*                InPairCharacter;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBInGameCharacterBase_SetPairCharacter;

// Function AJB.AJBInGameCharacterBase.SetPairID
// 0x0010 (0x0010 - 0x0000)
struct AJBInGameCharacterBase_SetPairID final
{
public:
	class FString                                 InPairID;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBInGameCharacterBase_SetPairID;

// Function AJB.AJBInGameCharacterBase.SetRole
// 0x0001 (0x0001 - 0x0000)
struct AJBInGameCharacterBase_SetRole final
{
public:
	ENetRole                                      NewRole;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBInGameCharacterBase_SetRole;

// Function AJB.AJBInGameCharacterBase.SetSharedController
// 0x0008 (0x0008 - 0x0000)
struct AJBInGameCharacterBase_SetSharedController final
{
public:
	class AController*                            InController;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBInGameCharacterBase_SetSharedController;

// Function AJB.AJBInGameCharacterBase.TryGetEmoteAnimMontageByIndex
// 0x0010 (0x0010 - 0x0000)
struct AJBInGameCharacterBase_TryGetEmoteAnimMontageByIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBInGameCharacterBase_TryGetEmoteAnimMontageByIndex;

// Function AJB.AJBInGameCharacterBase.TryGetEmoteVoiceByIndex
// 0x0008 (0x0008 - 0x0000)
struct AJBInGameCharacterBase_TryGetEmoteVoiceByIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AJBInGameCharacterBase_TryGetEmoteVoiceByIndex;

// Function AJB.AJBInGameCharacterBase.TryGetMatchingPlayerInfo
// 0x0090 (0x0090 - 0x0000)
struct AJBInGameCharacterBase_TryGetMatchingPlayerInfo final
{
public:
	struct FMatchingPlayerInfo                    Out;                                               // 0x0000(0x0088)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0088(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AJBInGameCharacterBase_TryGetMatchingPlayerInfo;

// Function AJB.AJBInGameCharacterBase.TryGetPlayerCustomData
// 0x0030 (0x0030 - 0x0000)
struct AJBInGameCharacterBase_TryGetPlayerCustomData final
{
