#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AMActivatorPlugin

#include "Basic.hpp"

#include "AMActivatorPlugin_structs.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function AMActivatorPlugin.AMActivationFunctionLibrary.GetOneTimeKey
// 0x0004 (0x0004 - 0x0000)
struct AMActivationFunctionLibrary_GetOneTimeKey final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AMActivationFunctionLibrary_GetOneTimeKey;

// Function AMActivatorPlugin.AMActivationFunctionLibrary.GetOneTimeKeyExpiration
// 0x0008 (0x0008 - 0x0000)
struct AMActivationFunctionLibrary_GetOneTimeKeyExpiration final
{
public:
	struct FDateTime                              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AMActivationFunctionLibrary_GetOneTimeKeyExpiration;

// Function AMActivatorPlugin.AMActivationFunctionLibrary.GetOneTimeKeyLastStatus
// 0x0001 (0x0001 - 0x0000)
struct AMActivationFunctionLibrary_GetOneTimeKeyLastStatus final
{
public:
	EOnetimeKeyStatus                             ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AMActivationFunctionLibrary_GetOneTimeKeyLastStatus;

// Function AMActivatorPlugin.AMActivationFunctionLibrary.GetSignatureGeneration
// 0x0004 (0x0004 - 0x0000)
struct AMActivationFunctionLibrary_GetSignatureGeneration final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AMActivationFunctionLibrary_GetSignatureGeneration;

// Function AMActivatorPlugin.AMActivationFunctionLibrary.GetSignatureLastStatus
// 0x0001 (0x0001 - 0x0000)
struct AMActivationFunctionLibrary_GetSignatureLastStatus final
{
public:
	ESignatureStatus                              ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AMActivationFunctionLibrary_GetSignatureLastStatus;

// Function AMActivatorPlugin.AMActivationFunctionLibrary.initializeAMActivator
// 0x0010 (0x0010 - 0x0000)
struct AMActivationFunctionLibrary_initializeAMActivator final
{
public:
	class FString                                 serial;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AMActivationFunctionLibrary_initializeAMActivator;

// Function AMActivatorPlugin.AMActivationFunctionLibrary.IsBusy
// 0x0001 (0x0001 - 0x0000)
struct AMActivationFunctionLibrary_IsBusy final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AMActivationFunctionLibrary_IsBusy;

// Function AMActivatorPlugin.AMActivationFunctionLibrary.Lock
// 0x0001 (0x0001 - 0x0000)
struct AMActivationFunctionLibrary_Lock final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AMActivationFunctionLibrary_Lock;

// Function AMActivatorPlugin.AMActivationFunctionLibrary.RequestOneTimeKey
// 0x0001 (0x0001 - 0x0000)
struct AMActivationFunctionLibrary_RequestOneTimeKey final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AMActivationFunctionLibrary_RequestOneTimeKey;

// Function AMActivatorPlugin.AMActivationFunctionLibrary.RequestSignature
// 0x0001 (0x0001 - 0x0000)
struct AMActivationFunctionLibrary_RequestSignature final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AMActivationFunctionLibrary_RequestSignature;

// Function AMActivatorPlugin.AMActivationFunctionLibrary.Restore
// 0x0001 (0x0001 - 0x0000)
struct AMActivationFunctionLibrary_Restore final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AMActivationFunctionLibrary_Restore;

// Function AMActivatorPlugin.AMActivationFunctionLibrary.UnLock
// 0x0001 (0x0001 - 0x0000)
struct AMActivationFunctionLibrary_UnLock final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AMActivationFunctionLibrary_UnLock;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
