#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AmwPlugin

#include "Basic.hpp"

#include "AmwPlugin_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function AmwPlugin.AmwDisplayCancelTest.AmwDisplayCancelTest
// 0x0010 (0x0010 - 0x0000)
struct AmwDisplayCancelTest_AmwDisplayCancelTest final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAmwDisplayCancelTest*                  ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AmwDisplayCancelTest_AmwDisplayCancelTest;

// Function AmwPlugin.AmwDisplayStartTest.AmwDisplayStartTest
// 0x0010 (0x0010 - 0x0000)
struct AmwDisplayStartTest_AmwDisplayStartTest final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAmwDisplayStartTest*                   ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AmwDisplayStartTest_AmwDisplayStartTest;

// Function AmwPlugin.AmwEmoneyAuthTerminal.AmwEmoneyAuthTerminal
// 0x0018 (0x0018 - 0x0000)
struct AmwEmoneyAuthTerminal_AmwEmoneyAuthTerminal final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TimeOutSeconds;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAmwEmoneyAuthTerminal*                 ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AmwEmoneyAuthTerminal_AmwEmoneyAuthTerminal;

// Function AmwPlugin.AmwEmoneyCancel.AmwEmoneyCancel
// 0x0010 (0x0010 - 0x0000)
struct AmwEmoneyCancel_AmwEmoneyCancel final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAmwEmoneyCancel*                       ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AmwEmoneyCancel_AmwEmoneyCancel;

// Function AmwPlugin.AmwEmoneyPayAmount.AmwEmoneyPayAmount
// 0x0018 (0x0018 - 0x0000)
struct AmwEmoneyPayAmount_AmwEmoneyPayAmount final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAmwEmoneyBrand                               Brand;                                             // 0x0008(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Value;                                             // 0x000C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAmwEmoneyPayAmount*                    ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AmwEmoneyPayAmount_AmwEmoneyPayAmount;

// Function AmwPlugin.AmwEmoneyRemoveTerminal.AmwEmoneyRemoveTerminal
// 0x0010 (0x0010 - 0x0000)
struct AmwEmoneyRemoveTerminal_AmwEmoneyRemoveTerminal final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAmwEmoneyRemoveTerminal*               ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AmwEmoneyRemoveTerminal_AmwEmoneyRemoveTerminal;

// Function AmwPlugin.AmwEmoneyRequestBalance.AmwEmoneyRequestBalance
// 0x0018 (0x0018 - 0x0000)
struct AmwEmoneyRequestBalance_AmwEmoneyRequestBalance final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAmwEmoneyBrand                               Brand;                                             // 0x0008(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAmwEmoneyRequestBalance*               ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AmwEmoneyRequestBalance_AmwEmoneyRequestBalance;

// Function AmwPlugin.AmwLEDTest.AmwLEDTest
// 0x0018 (0x0018 - 0x0000)
struct AmwLEDTest_AmwLEDTest final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DeviceIndex;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAmwLEDTest*                            ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AmwLEDTest_AmwLEDTest;

// Function AmwPlugin.AmwPluginFunctionLibrary.AmwChangeSequenceMode
// 0x0002 (0x0002 - 0x0000)
struct AmwPluginFunctionLibrary_AmwChangeSequenceMode final
{
public:
	EAmwSequenceMode                              NewMode;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AmwPluginFunctionLibrary_AmwChangeSequenceMode;

// Function AmwPlugin.AmwPluginFunctionLibrary.AmwEmoneyCancelNoWait
// 0x0001 (0x0001 - 0x0000)
struct AmwPluginFunctionLibrary_AmwEmoneyCancelNoWait final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AmwPluginFunctionLibrary_AmwEmoneyCancelNoWait;

// Function AmwPlugin.AmwPluginFunctionLibrary.AmwGetBuildType
// 0x0001 (0x0001 - 0x0000)
struct AmwPluginFunctionLibrary_AmwGetBuildType final
{
public:
	EAmwBuildType                                 ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AmwPluginFunctionLibrary_AmwGetBuildType;

// Function AmwPlugin.AmwPluginFunctionLibrary.AmwInsertCoin
// 0x0010 (0x0010 - 0x0000)
struct AmwPluginFunctionLibrary_AmwInsertCoin final
{
public:
	int32                                         Num;                                               // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Slot;                                              // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Coin;                                              // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AmwPluginFunctionLibrary_AmwInsertCoin;

// Function AmwPlugin.AmwPluginFunctionLibrary.CancelAmwCommand
// 0x0008 (0x0008 - 0x0000)
struct AmwPluginFunctionLibrary_CancelAmwCommand final
{
public:
	int32                                         DeviceIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AmwPluginFunctionLibrary_CancelAmwCommand;

// Function AmwPlugin.AmwPluginFunctionLibrary.CancelAmwDisplayTest
// 0x0001 (0x0001 - 0x0000)
struct AmwPluginFunctionLibrary_CancelAmwDisplayTest final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AmwPluginFunctionLibrary_CancelAmwDisplayTest;

// Function AmwPlugin.AmwPluginFunctionLibrary.EmoneyCompletePay
// 0x0001 (0x0001 - 0x0000)
struct AmwPluginFunctionLibrary_EmoneyCompletePay final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AmwPluginFunctionLibrary_EmoneyCompletePay;

// Function AmwPlugin.AmwPluginFunctionLibrary.GetAmCardReaderProperty
// 0x0030 (0x0030 - 0x0000)
struct AmwPluginFunctionLibrary_GetAmCardReaderProperty final
{
public:
	int32                                         DeviceIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 OutHWVersion;                                      // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutFWVersion;                                      // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AmwPluginFunctionLibrary_GetAmCardReaderProperty;

// Function AmwPlugin.AmwPluginFunctionLibrary.GetAmwEmoneyTerminalId
// 0x0010 (0x0010 - 0x0000)
struct AmwPluginFunctionLibrary_GetAmwEmoneyTerminalId final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AmwPluginFunctionLibrary_GetAmwEmoneyTerminalId;

// Function AmwPlugin.AmwPluginFunctionLibrary.GetAmwMacAddressString
// 0x0020 (0x0020 - 0x0000)
struct AmwPluginFunctionLibrary_GetAmwMacAddressString final
{
public:
	class FString                                 Delimiter;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AmwPluginFunctionLibrary_GetAmwMacAddressString;

// Function AmwPlugin.AmwPluginFunctionLibrary.GetEmoneyAvailableBrandInfo
// 0x0030 (0x0030 - 0x0000)
struct AmwPluginFunctionLibrary_GetEmoneyAvailableBrandInfo final
{
public:
	int32                                         Num;                                               // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAmwEmoneyBrand                               OutBrand;                                          // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 OutName;                                           // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutIconFilePath;                                   // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AmwPluginFunctionLibrary_GetEmoneyAvailableBrandInfo;

// Function AmwPlugin.AmwPluginFunctionLibrary.GetEmoneyAvailableBrandTotal
// 0x0004 (0x0004 - 0x0000)
struct AmwPluginFunctionLibrary_GetEmoneyAvailableBrandTotal final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AmwPluginFunctionLibrary_GetEmoneyAvailableBrandTotal;

// Function AmwPlugin.AmwPluginFunctionLibrary.GetEmoneyDealResults
// 0x0018 (0x0018 - 0x0000)
struct AmwPluginFunctionLibrary_GetEmoneyDealResults final
{
public:
	TArray<struct FAmwEmoneyDealResult>           OutDealResults;                                    // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AmwPluginFunctionLibrary_GetEmoneyDealResults;

// Function AmwPlugin.AmwPluginFunctionLibrary.GetEmoneyReportResults
// 0x0018 (0x0018 - 0x0000)
struct AmwPluginFunctionLibrary_GetEmoneyReportResults final
{
public:
	TArray<struct FAmwEmoneyReportResult>         OutReportResults;                                  // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AmwPluginFunctionLibrary_GetEmoneyReportResults;

// Function AmwPlugin.AmwPluginFunctionLibrary.GetEventListener
// 0x0008 (0x0008 - 0x0000)
struct AmwPluginFunctionLibrary_GetEventListener final
{
public:
	class UAmwPluginEventListener*                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AmwPluginFunctionLibrary_GetEventListener;

// Function AmwPlugin.AmwPluginFunctionLibrary.GetLastEAmwTouchResult
// 0x0001 (0x0001 - 0x0000)
struct AmwPluginFunctionLibrary_GetLastEAmwTouchResult final
{
public:
	EAmwTouchResult                               ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AmwPluginFunctionLibrary_GetLastEAmwTouchResult;

// Function AmwPlugin.AmwPluginFunctionLibrary.InitializeAmwLibrary
// 0x0028 (0x0028 - 0x0000)
struct AmwPluginFunctionLibrary_InitializeAmwLibrary final
{
public:
	EAmwBuildType                                 Type;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 OverwriteMainId;                                   // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AMCUSMacAddress;                                   // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AmwPluginFunctionLibrary_InitializeAmwLibrary;

// Function AmwPlugin.AmwPluginFunctionLibrary.IsAmwConnect
// 0x0008 (0x0008 - 0x0000)
struct AmwPluginFunctionLibrary_IsAmwConnect final
{
public:
	int32                                         DeviceIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AmwPluginFunctionLibrary_IsAmwConnect;

// Function AmwPlugin.AmwPluginFunctionLibrary.IsAmwDisplayConnected
// 0x0001 (0x0001 - 0x0000)
struct AmwPluginFunctionLibrary_IsAmwDisplayConnected final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AmwPluginFunctionLibrary_IsAmwDisplayConnected;

// Function AmwPlugin.AmwPluginFunctionLibrary.IsAmwDoneTask
// 0x0008 (0x0008 - 0x0000)
struct AmwPluginFunctionLibrary_IsAmwDoneTask final
{
public:
	int32                                         DeviceIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AmwPluginFunctionLibrary_IsAmwDoneTask;

// Function AmwPlugin.AmwPluginFunctionLibrary.IsAmwEmoneyActivated
// 0x0001 (0x0001 - 0x0000)
struct AmwPluginFunctionLibrary_IsAmwEmoneyActivated final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AmwPluginFunctionLibrary_IsAmwEmoneyActivated;

// Function AmwPlugin.AmwPluginFunctionLibrary.IsAmwEmoneyAliveServer
// 0x0001 (0x0001 - 0x0000)
struct AmwPluginFunctionLibrary_IsAmwEmoneyAliveServer final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AmwPluginFunctionLibrary_IsAmwEmoneyAliveServer;

// Function AmwPlugin.AmwPluginFunctionLibrary.IsAmwEmoneyCancelCommand
// 0x0001 (0x0001 - 0x0000)
struct AmwPluginFunctionLibrary_IsAmwEmoneyCancelCommand final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AmwPluginFunctionLibrary_IsAmwEmoneyCancelCommand;

// Function AmwPlugin.AmwPluginFunctionLibrary.IsAmwLibraryReady
// 0x0001 (0x0001 - 0x0000)
struct AmwPluginFunctionLibrary_IsAmwLibraryReady final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AmwPluginFunctionLibrary_IsAmwLibraryReady;

// Function AmwPlugin.AmwPluginFunctionLibrary.IsAmwSystemError
// 0x0001 (0x0001 - 0x0000)
struct AmwPluginFunctionLibrary_IsAmwSystemError final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AmwPluginFunctionLibrary_IsAmwSystemError;

// Function AmwPlugin.AmwPluginFunctionLibrary.IsSuccessAmwUpdateFirmwar
// 0x0008 (0x0008 - 0x0000)
struct AmwPluginFunctionLibrary_IsSuccessAmwUpdateFirmwar final
{
public:
	int32                                         DeviceIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AmwPluginFunctionLibrary_IsSuccessAmwUpdateFirmwar;

// Function AmwPlugin.AmwPluginFunctionLibrary.SetAmwLED
// 0x0008 (0x0008 - 0x0000)
struct AmwPluginFunctionLibrary_SetAmwLED final
{
public:
	int32                                         DeviceIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAmwLedType                                   LedType;                                           // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AmwPluginFunctionLibrary_SetAmwLED;

// Function AmwPlugin.AmwPluginFunctionLibrary.SetupEventListener
// 0x0008 (0x0008 - 0x0000)
struct AmwPluginFunctionLibrary_SetupEventListener final
{
public:
	class UAmwPluginEventListener*                EventListener;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AmwPluginFunctionLibrary_SetupEventListener;

// Function AmwPlugin.AmwPluginFunctionLibrary.TryGetAmwEmoneyBrandInfo
// 0x0030 (0x0030 - 0x0000)
struct AmwPluginFunctionLibrary_TryGetAmwEmoneyBrandInfo final
{
public:
	EAmwEmoneyBrand                               Brand;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 OutName;                                           // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutFilePath;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AmwPluginFunctionLibrary_TryGetAmwEmoneyBrandInfo;

// Function AmwPlugin.AmwPluginFunctionLibrary.TryGetEmoneyLatestDealResult
// 0x0060 (0x0060 - 0x0000)
struct AmwPluginFunctionLibrary_TryGetEmoneyLatestDealResult final
{
public:
	struct FAmwEmoneyDealResult                   OutResult;                                         // 0x0000(0x0058)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0058(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AmwPluginFunctionLibrary_TryGetEmoneyLatestDealResult;

// Function AmwPlugin.AmwSystemCheck.AmwSystenCheck
// 0x0018 (0x0018 - 0x0000)
struct AmwSystemCheck_AmwSystenCheck final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DeviceIndex;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAmwSystemCheck*                        ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AmwSystemCheck_AmwSystenCheck;

// Function AmwPlugin.AmwWaitTouch.AmwWaitTouch
// 0x0020 (0x0020 - 0x0000)
struct AmwWaitTouch_AmwWaitTouch final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DeviceIndex;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMobileOnly;                                       // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TimeOutSeconds;                                    // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsEnableLED;                                      // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAmwWaitTouch*                          ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AmwWaitTouch_AmwWaitTouch;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
