#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AmwPlugin

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "AmwPlugin_structs.hpp"
#include "CoreUObject_classes.hpp"


SDK_NAMESPACE_START

// Class AmwPlugin.AmwAsyncActionBase
// 0x0010 (0x0040 - 0x0030)
class UAmwAsyncActionBase : public UBlueprintAsyncActionBase
{
public:
	uint8                                         Pad_30[0x10];                                      // 0x0030(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AmwAsyncActionBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AmwAsyncActionBase")
	}
	static class UAmwAsyncActionBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAmwAsyncActionBase>();
	}
};
DUMPER7_ASSERTS_UAmwAsyncActionBase;

// Class AmwPlugin.AmwDisplayCancelTest
// 0x0030 (0x0070 - 0x0040)
class UAmwDisplayCancelTest final : public UAmwAsyncActionBase
{
public:
	UMulticastDelegateProperty_                   OnSuccess;                                         // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnFailed;                                          // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_60[0x10];                                      // 0x0060(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAmwDisplayCancelTest* AmwDisplayCancelTest(class UObject* WorldContextObject);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AmwDisplayCancelTest")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AmwDisplayCancelTest")
	}
	static class UAmwDisplayCancelTest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAmwDisplayCancelTest>();
	}
};
DUMPER7_ASSERTS_UAmwDisplayCancelTest;

// Class AmwPlugin.AmwDisplayStartTest
// 0x0030 (0x0070 - 0x0040)
class UAmwDisplayStartTest final : public UAmwAsyncActionBase
{
public:
	UMulticastDelegateProperty_                   OnSuccess;                                         // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnFailed;                                          // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_60[0x10];                                      // 0x0060(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAmwDisplayStartTest* AmwDisplayStartTest(class UObject* WorldContextObject);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AmwDisplayStartTest")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AmwDisplayStartTest")
	}
	static class UAmwDisplayStartTest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAmwDisplayStartTest>();
	}
};
DUMPER7_ASSERTS_UAmwDisplayStartTest;

// Class AmwPlugin.AmwEmoneyAuthTerminal
// 0x0050 (0x0090 - 0x0040)
class UAmwEmoneyAuthTerminal final : public UAmwAsyncActionBase
{
public:
	UMulticastDelegateProperty_                   OnSuccess;                                         // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnFailed;                                          // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnFailedProcessingTask;                            // 0x0060(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnFailedNotActivate;                               // 0x0070(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_80[0x10];                                      // 0x0080(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAmwEmoneyAuthTerminal* AmwEmoneyAuthTerminal(class UObject* WorldContextObject, int32 TimeOutSeconds);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AmwEmoneyAuthTerminal")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AmwEmoneyAuthTerminal")
	}
	static class UAmwEmoneyAuthTerminal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAmwEmoneyAuthTerminal>();
	}
};
DUMPER7_ASSERTS_UAmwEmoneyAuthTerminal;

// Class AmwPlugin.AmwEmoneyCancel
// 0x0030 (0x0070 - 0x0040)
class UAmwEmoneyCancel final : public UAmwAsyncActionBase
{
public:
	UMulticastDelegateProperty_                   OnSuccess;                                         // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnFailed;                                          // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_60[0x10];                                      // 0x0060(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAmwEmoneyCancel* AmwEmoneyCancel(class UObject* WorldContextObject);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AmwEmoneyCancel")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AmwEmoneyCancel")
	}
	static class UAmwEmoneyCancel* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAmwEmoneyCancel>();
	}
};
DUMPER7_ASSERTS_UAmwEmoneyCancel;

// Class AmwPlugin.AmwEmoneyPayAmount
// 0x0038 (0x0078 - 0x0040)
class UAmwEmoneyPayAmount final : public UAmwAsyncActionBase
{
public:
	UMulticastDelegateProperty_                   OnInComplete;                                      // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnFailed;                                          // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_60[0x18];                                      // 0x0060(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAmwEmoneyPayAmount* AmwEmoneyPayAmount(class UObject* WorldContextObject, const EAmwEmoneyBrand& Brand, const int32 Value);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AmwEmoneyPayAmount")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AmwEmoneyPayAmount")
	}
	static class UAmwEmoneyPayAmount* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAmwEmoneyPayAmount>();
	}
};
DUMPER7_ASSERTS_UAmwEmoneyPayAmount;

// Class AmwPlugin.AmwEmoneyRemoveTerminal
// 0x0040 (0x0070 - 0x0030)
class UAmwEmoneyRemoveTerminal final : public UBlueprintAsyncActionBase
{
public:
	UMulticastDelegateProperty_                   OnSuccess;                                         // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnFailed;                                          // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x20];                                      // 0x0050(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAmwEmoneyRemoveTerminal* AmwEmoneyRemoveTerminal(class UObject* WorldContextObject);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AmwEmoneyRemoveTerminal")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AmwEmoneyRemoveTerminal")
	}
	static class UAmwEmoneyRemoveTerminal* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAmwEmoneyRemoveTerminal>();
	}
};
DUMPER7_ASSERTS_UAmwEmoneyRemoveTerminal;

// Class AmwPlugin.AmwEmoneyRequestBalance
// 0x0048 (0x0078 - 0x0030)
class UAmwEmoneyRequestBalance final : public UBlueprintAsyncActionBase
{
public:
	UMulticastDelegateProperty_                   OnSuccess;                                         // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnFailed;                                          // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x28];                                      // 0x0050(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAmwEmoneyRequestBalance* AmwEmoneyRequestBalance(class UObject* WorldContextObject, const EAmwEmoneyBrand& Brand);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AmwEmoneyRequestBalance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AmwEmoneyRequestBalance")
	}
	static class UAmwEmoneyRequestBalance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAmwEmoneyRequestBalance>();
	}
};
DUMPER7_ASSERTS_UAmwEmoneyRequestBalance;

// Class AmwPlugin.AmwLEDTest
// 0x0038 (0x0078 - 0x0040)
class UAmwLEDTest final : public UAmwAsyncActionBase
{
public:
	UMulticastDelegateProperty_                   OnSuccess;                                         // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnFailed;                                          // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_60[0x18];                                      // 0x0060(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAmwLEDTest* AmwLEDTest(class UObject* WorldContextObject, int32 DeviceIndex);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AmwLEDTest")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AmwLEDTest")
	}
	static class UAmwLEDTest* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAmwLEDTest>();
	}
};
DUMPER7_ASSERTS_UAmwLEDTest;

// Class AmwPlugin.AmwPluginEventListener
// 0x0010 (0x0038 - 0x0028)
class UAmwPluginEventListener final : public UObject
{
public:
	UMulticastDelegateProperty_                   EMoneySoundEventDispatcher;                        // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AmwPluginEventListener")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AmwPluginEventListener")
	}
	static class UAmwPluginEventListener* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAmwPluginEventListener>();
	}
};
DUMPER7_ASSERTS_UAmwPluginEventListener;

// Class AmwPlugin.AmwPluginFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UAmwPluginFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool AmwChangeSequenceMode(EAmwSequenceMode NewMode);
	static bool AmwEmoneyCancelNoWait();
	static EAmwBuildType AmwGetBuildType();
	static bool AmwInsertCoin(int32 Num, int32 Slot, int32 Coin);
	static bool CancelAmwCommand(int32 DeviceIndex);
	static bool CancelAmwDisplayTest();
	static bool EmoneyCompletePay();
	static void FinalizeAmwLibrary();
	static bool GetAmCardReaderProperty(int32 DeviceIndex, class FString* OutHWVersion, class FString* OutFWVersion);
	static class FString GetAmwEmoneyTerminalId();
	static class FString GetAmwMacAddressString(const class FString& Delimiter);
	static bool GetEmoneyAvailableBrandInfo(const int32 Num, EAmwEmoneyBrand* OutBrand, class FString* OutName, class FString* OutIconFilePath);
	static int32 GetEmoneyAvailableBrandTotal();
	static bool GetEmoneyDealResults(TArray<struct FAmwEmoneyDealResult>* OutDealResults);
	static bool GetEmoneyReportResults(TArray<struct FAmwEmoneyReportResult>* OutReportResults);
	static class UAmwPluginEventListener* GetEventListener();
	static EAmwTouchResult GetLastEAmwTouchResult();
	static void InitializeAmwLibrary(EAmwBuildType Type, const class FString& OverwriteMainId, const class FString& AMCUSMacAddress);
	static bool IsAmwConnect(int32 DeviceIndex);
	static bool IsAmwDisplayConnected();
	static bool IsAmwDoneTask(int32 DeviceIndex);
	static bool IsAmwEmoneyActivated();
	static bool IsAmwEmoneyAliveServer();
	static bool IsAmwEmoneyCancelCommand();
	static bool IsAmwLibraryReady();
	static bool IsAmwSystemError();
	static bool IsSuccessAmwUpdateFirmwar(int32 DeviceIndex);
	static void RequestSystemPause();
	static void RequestSystemResume();
	static void SetAmwLED(int32 DeviceIndex, EAmwLedType LedType);
	static void SetupEventListener(class UAmwPluginEventListener* EventListener);
	static bool TryGetAmwEmoneyBrandInfo(EAmwEmoneyBrand Brand, class FString* OutName, class FString* OutFilePath);
	static bool TryGetEmoneyLatestDealResult(struct FAmwEmoneyDealResult* OutResult);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AmwPluginFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AmwPluginFunctionLibrary")
	}
	static class UAmwPluginFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAmwPluginFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UAmwPluginFunctionLibrary;

// Class AmwPlugin.AmwSystemCheck
// 0x0038 (0x0078 - 0x0040)
class UAmwSystemCheck final : public UAmwAsyncActionBase
{
public:
	UMulticastDelegateProperty_                   OnSuccess;                                         // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnFailed;                                          // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_60[0x18];                                      // 0x0060(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAmwSystemCheck* AmwSystenCheck(class UObject* WorldContextObject, int32 DeviceIndex);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AmwSystemCheck")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AmwSystemCheck")
	}
	static class UAmwSystemCheck* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAmwSystemCheck>();
	}
};
DUMPER7_ASSERTS_UAmwSystemCheck;

// Class AmwPlugin.AmwWaitTouch
// 0x0050 (0x0090 - 0x0040)
class UAmwWaitTouch final : public UAmwAsyncActionBase
{
public:
	UMulticastDelegateProperty_                   OnSuccess;                                         // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnFailed;                                          // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnCanceled;                                        // 0x0060(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_70[0x20];                                      // 0x0070(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAmwWaitTouch* AmwWaitTouch(class UObject* WorldContextObject, int32 DeviceIndex, bool bMobileOnly, int32 TimeOutSeconds, bool bIsEnableLED);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AmwWaitTouch")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AmwWaitTouch")
	}
	static class UAmwWaitTouch* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAmwWaitTouch>();
	}
};
DUMPER7_ASSERTS_UAmwWaitTouch;

SDK_NAMESPACE_END
