#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_AJBGameplayTagOwnerInterface

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function BI_AJBGameplayTagOwnerInterface.BI_AJBGameplayTagOwnerInterface_C.AddGameplayTag
// 0x0028 (0x0028 - 0x0000)
struct BI_AJBGameplayTagOwnerInterface_C_AddGameplayTag final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Operator;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Target;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CauserType;                                        // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	int32                                         SerialNumber;                                      // 0x0020(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_AJBGameplayTagOwnerInterface_C_AddGameplayTag;

// Function BI_AJBGameplayTagOwnerInterface.BI_AJBGameplayTagOwnerInterface_C.RemoveGameplayTag
// 0x0008 (0x0008 - 0x0000)
struct BI_AJBGameplayTagOwnerInterface_C_RemoveGameplayTag final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_AJBGameplayTagOwnerInterface_C_RemoveGameplayTag;

// Function BI_AJBGameplayTagOwnerInterface.BI_AJBGameplayTagOwnerInterface_C.GetGameplayTags
// 0x0020 (0x0020 - 0x0000)
struct BI_AJBGameplayTagOwnerInterface_C_GetGameplayTags final
{
public:
	struct FGameplayTagContainer                  TagContainerCopy;                                  // 0x0000(0x0020)(Parm, OutParm)
};
DUMPER7_ASSERTS_BI_AJBGameplayTagOwnerInterface_C_GetGameplayTags;

// Function BI_AJBGameplayTagOwnerInterface.BI_AJBGameplayTagOwnerInterface_C.AddGameplayTagWithFloat
// 0x0010 (0x0010 - 0x0000)
struct BI_AJBGameplayTagOwnerInterface_C_AddGameplayTagWithFloat final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	float                                         FloatValue;                                        // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_AJBGameplayTagOwnerInterface_C_AddGameplayTagWithFloat;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
