#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_AJBInGameCameraAccessor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function BI_AJBInGameCameraAccessor.BI_AJBInGameCameraAccessor_C.GetCameraLocation
// 0x000C (0x000C - 0x0000)
struct BI_AJBInGameCameraAccessor_C_GetCameraLocation final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_AJBInGameCameraAccessor_C_GetCameraLocation;

// Function BI_AJBInGameCameraAccessor.BI_AJBInGameCameraAccessor_C.GetCameraForwardVector
// 0x000C (0x000C - 0x0000)
struct BI_AJBInGameCameraAccessor_C_GetCameraForwardVector final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_AJBInGameCameraAccessor_C_GetCameraForwardVector;

// Function BI_AJBInGameCameraAccessor.BI_AJBInGameCameraAccessor_C.GetCameraInfo
// 0x001C (0x001C - 0x0000)
struct BI_AJBInGameCameraAccessor_C_GetCameraInfo final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rotation;                                          // 0x000C(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor)
	float                                         FOV;                                               // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_AJBInGameCameraAccessor_C_GetCameraInfo;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
