#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_AdditionalAP

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function BI_AdditionalAP.BI_AdditionalAP_C.GetValue
// 0x0004 (0x0004 - 0x0000)
struct BI_AdditionalAP_C_GetValue final
{
public:
	int32                                         AAPValue;                                          // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_AdditionalAP_C_GetValue;

// Function BI_AdditionalAP.BI_AdditionalAP_C.Consume
// 0x0010 (0x0010 - 0x0000)
struct BI_AdditionalAP_C_Consume final
{
public:
	int32                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LeftDamage;                                        // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BeforeValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AfterValue;                                        // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_AdditionalAP_C_Consume;

// Function BI_AdditionalAP.BI_AdditionalAP_C.GetValueMax
// 0x0004 (0x0004 - 0x0000)
struct BI_AdditionalAP_C_GetValueMax final
{
public:
	int32                                         AAPValueMax;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_AdditionalAP_C_GetValueMax;

// Function BI_AdditionalAP.BI_AdditionalAP_C.OnConsumed
// 0x0008 (0x0008 - 0x0000)
struct BI_AdditionalAP_C_OnConsumed final
{
public:
	int32                                         BeforeValue;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AfterValue;                                        // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_AdditionalAP_C_OnConsumed;

// Function BI_AdditionalAP.BI_AdditionalAP_C.GetParticleTagBlocked
// 0x0008 (0x0008 - 0x0000)
struct BI_AdditionalAP_C_GetParticleTagBlocked final
{
public:
	struct FGameplayTag                           ParticleTag;                                       // 0x0000(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_AdditionalAP_C_GetParticleTagBlocked;

// Function BI_AdditionalAP.BI_AdditionalAP_C.AddValue
// 0x0010 (0x0010 - 0x0000)
struct BI_AdditionalAP_C_AddValue final
{
public:
	int32                                         Point;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Causer;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_AdditionalAP_C_AddValue;

// Function BI_AdditionalAP.BI_AdditionalAP_C.GetSETagBlocked
// 0x0008 (0x0008 - 0x0000)
struct BI_AdditionalAP_C_GetSETagBlocked final
{
public:
	struct FGameplayTag                           SETag;                                             // 0x0000(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_AdditionalAP_C_GetSETagBlocked;

// Function BI_AdditionalAP.BI_AdditionalAP_C.ConsumeSimulated
// 0x0010 (0x0010 - 0x0000)
struct BI_AdditionalAP_C_ConsumeSimulated final
{
public:
	int32                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LeftDamage;                                        // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BeforeValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AfterValue;                                        // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_AdditionalAP_C_ConsumeSimulated;

// Function BI_AdditionalAP.BI_AdditionalAP_C.ChangeParticleVisibility
// 0x0001 (0x0001 - 0x0000)
struct BI_AdditionalAP_C_ChangeParticleVisibility final
{
public:
	bool                                          NewVisibility;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BI_AdditionalAP_C_ChangeParticleVisibility;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
