#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_AJBInGameCharacterProperty

#include "Basic.hpp"

#include "AJB_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function BI_AJBInGameCharacterProperty.BI_AJBInGameCharacterProperty_C.SetSerialNumber
// 0x0004 (0x0004 - 0x0000)
struct BI_AJBInGameCharacterProperty_C_SetSerialNumber final
{
public:
	int32                                         SerialNumber;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_AJBInGameCharacterProperty_C_SetSerialNumber;

// Function BI_AJBInGameCharacterProperty.BI_AJBInGameCharacterProperty_C.GetPropertyOwnerCharacterBP
// 0x0008 (0x0008 - 0x0000)
struct BI_AJBInGameCharacterProperty_C_GetPropertyOwnerCharacterBP final
{
public:
	class ABP_AJBInGameCharacter_C*               CharacterBP;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_AJBInGameCharacterProperty_C_GetPropertyOwnerCharacterBP;

// Function BI_AJBInGameCharacterProperty.BI_AJBInGameCharacterProperty_C.GetPropertyType
// 0x0001 (0x0001 - 0x0000)
struct BI_AJBInGameCharacterProperty_C_GetPropertyType final
{
public:
	EAJBCharacterPropertyType                     PropertyType;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_AJBInGameCharacterProperty_C_GetPropertyType;

// Function BI_AJBInGameCharacterProperty.BI_AJBInGameCharacterProperty_C.ChangeEnableServer
// 0x0001 (0x0001 - 0x0000)
struct BI_AJBInGameCharacterProperty_C_ChangeEnableServer final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BI_AJBInGameCharacterProperty_C_ChangeEnableServer;

// Function BI_AJBInGameCharacterProperty.BI_AJBInGameCharacterProperty_C.ChangeEnableCore
// 0x0001 (0x0001 - 0x0000)
struct BI_AJBInGameCharacterProperty_C_ChangeEnableCore final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BI_AJBInGameCharacterProperty_C_ChangeEnableCore;

// Function BI_AJBInGameCharacterProperty.BI_AJBInGameCharacterProperty_C.ChangeMeshVisibleServer
// 0x0001 (0x0001 - 0x0000)
struct BI_AJBInGameCharacterProperty_C_ChangeMeshVisibleServer final
{
public:
	bool                                          bNewVisibility;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BI_AJBInGameCharacterProperty_C_ChangeMeshVisibleServer;

// Function BI_AJBInGameCharacterProperty.BI_AJBInGameCharacterProperty_C.ChangeMeshVisibleCore
// 0x0001 (0x0001 - 0x0000)
struct BI_AJBInGameCharacterProperty_C_ChangeMeshVisibleCore final
{
public:
	bool                                          bNewVisibility;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BI_AJBInGameCharacterProperty_C_ChangeMeshVisibleCore;

// Function BI_AJBInGameCharacterProperty.BI_AJBInGameCharacterProperty_C.TracableByAI
// 0x0001 (0x0001 - 0x0000)
struct BI_AJBInGameCharacterProperty_C_TracableByAI final
{
public:
	bool                                          bTracable;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BI_AJBInGameCharacterProperty_C_TracableByAI;

// Function BI_AJBInGameCharacterProperty.BI_AJBInGameCharacterProperty_C.DetectableByTrap
// 0x0001 (0x0001 - 0x0000)
struct BI_AJBInGameCharacterProperty_C_DetectableByTrap final
{
public:
	bool                                          bDetectable;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BI_AJBInGameCharacterProperty_C_DetectableByTrap;

// Function BI_AJBInGameCharacterProperty.BI_AJBInGameCharacterProperty_C.IsDetectableByDirectAttackGuide
// 0x0001 (0x0001 - 0x0000)
struct BI_AJBInGameCharacterProperty_C_IsDetectableByDirectAttackGuide final
{
public:
	bool                                          bIsDetectable;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BI_AJBInGameCharacterProperty_C_IsDetectableByDirectAttackGuide;

// Function BI_AJBInGameCharacterProperty.BI_AJBInGameCharacterProperty_C.TreatAsCharacterBySpecialProjectile
// 0x0001 (0x0001 - 0x0000)
struct BI_AJBInGameCharacterProperty_C_TreatAsCharacterBySpecialProjectile final
{
public:
	bool                                          bTreat;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BI_AJBInGameCharacterProperty_C_TreatAsCharacterBySpecialProjectile;

// Function BI_AJBInGameCharacterProperty.BI_AJBInGameCharacterProperty_C.IsTargetCO2Scan
// 0x0001 (0x0001 - 0x0000)
struct BI_AJBInGameCharacterProperty_C_IsTargetCO2Scan final
{
public:
	bool                                          IsTarget;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BI_AJBInGameCharacterProperty_C_IsTargetCO2Scan;

// Function BI_AJBInGameCharacterProperty.BI_AJBInGameCharacterProperty_C.IsTargetClourBarrier
// 0x0001 (0x0001 - 0x0000)
struct BI_AJBInGameCharacterProperty_C_IsTargetClourBarrier final
{
public:
	bool                                          IsTarget;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BI_AJBInGameCharacterProperty_C_IsTargetClourBarrier;

// Function BI_AJBInGameCharacterProperty.BI_AJBInGameCharacterProperty_C.IsTargetOverGrow
// 0x0001 (0x0001 - 0x0000)
struct BI_AJBInGameCharacterProperty_C_IsTargetOverGrow final
{
public:
	bool                                          IsTarget;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BI_AJBInGameCharacterProperty_C_IsTargetOverGrow;

// Function BI_AJBInGameCharacterProperty.BI_AJBInGameCharacterProperty_C.IsPlayOwnerVoiceOnGetItem
// 0x0001 (0x0001 - 0x0000)
struct BI_AJBInGameCharacterProperty_C_IsPlayOwnerVoiceOnGetItem final
{
public:
	bool                                          bIsPlay;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BI_AJBInGameCharacterProperty_C_IsPlayOwnerVoiceOnGetItem;

// Function BI_AJBInGameCharacterProperty.BI_AJBInGameCharacterProperty_C.IsPlayOwnerVoiceOnJump
// 0x0001 (0x0001 - 0x0000)
struct BI_AJBInGameCharacterProperty_C_IsPlayOwnerVoiceOnJump final
{
public:
	bool                                          bIsPlay;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BI_AJBInGameCharacterProperty_C_IsPlayOwnerVoiceOnJump;

// Function BI_AJBInGameCharacterProperty.BI_AJBInGameCharacterProperty_C.IsPlayOwnerVoiceOnPassThruEnter
// 0x0001 (0x0001 - 0x0000)
struct BI_AJBInGameCharacterProperty_C_IsPlayOwnerVoiceOnPassThruEnter final
{
public:
	bool                                          bIsPlay;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BI_AJBInGameCharacterProperty_C_IsPlayOwnerVoiceOnPassThruEnter;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
