#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_Barrier

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function BI_Barrier.BI_Barrier_C.IsIgnitionBySpecialProjectile
// 0x0001 (0x0001 - 0x0000)
struct BI_Barrier_C_IsIgnitionBySpecialProjectile final
{
public:
	bool                                          bIgnition;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BI_Barrier_C_IsIgnitionBySpecialProjectile;

// Function BI_Barrier.BI_Barrier_C.IsIgnoreImpulseVoice
// 0x0001 (0x0001 - 0x0000)
struct BI_Barrier_C_IsIgnoreImpulseVoice final
{
public:
	bool                                          bInclude;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BI_Barrier_C_IsIgnoreImpulseVoice;

// Function BI_Barrier.BI_Barrier_C.IsStopPenetrateProjectile
// 0x0001 (0x0001 - 0x0000)
struct BI_Barrier_C_IsStopPenetrateProjectile final
{
public:
	bool                                          bStop;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BI_Barrier_C_IsStopPenetrateProjectile;

// Function BI_Barrier.BI_Barrier_C.IsHitPenetrateAttack
// 0x0001 (0x0001 - 0x0000)
struct BI_Barrier_C_IsHitPenetrateAttack final
{
public:
	bool                                          bHit;                                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BI_Barrier_C_IsHitPenetrateAttack;

// Function BI_Barrier.BI_Barrier_C.IsStopDirectAttackGuide
// 0x0010 (0x0010 - 0x0000)
struct BI_Barrier_C_IsStopDirectAttackGuide final
{
public:
	class AActor*                                 Owner;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsStop;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BI_Barrier_C_IsStopDirectAttackGuide;

// Function BI_Barrier.BI_Barrier_C.DamageLocal
// 0x0004 (0x0004 - 0x0000)
struct BI_Barrier_C_DamageLocal final
{
public:
	int32                                         Damage;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_Barrier_C_DamageLocal;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
