#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_BlockingRushOperatorInterface

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function BI_BlockingRushOperatorInterface.BI_BlockingRushOperatorInterface_C.CheckBlockingValid
// 0x0010 (0x0010 - 0x0000)
struct BI_BlockingRushOperatorInterface_C_CheckBlockingValid final
{
public:
	class AActor*                                 DamageActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bBlockingValid;                                    // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BI_BlockingRushOperatorInterface_C_CheckBlockingValid;

// Function BI_BlockingRushOperatorInterface.BI_BlockingRushOperatorInterface_C.OnBlocking
// 0x0020 (0x0020 - 0x0000)
struct BI_BlockingRushOperatorInterface_C_OnBlocking final
{
public:
	struct FVector                                BlockingLocation;                                  // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Reflect;                                           // 0x000C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsPairAttack;                                     // 0x000D(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bImpulseDamage;                                    // 0x000E(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 DamageOwner;                                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSeparateStandAttack;                              // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BI_BlockingRushOperatorInterface_C_OnBlocking;

// Function BI_BlockingRushOperatorInterface.BI_BlockingRushOperatorInterface_C.CheckBlockingComponent
// 0x0010 (0x0010 - 0x0000)
struct BI_BlockingRushOperatorInterface_C_CheckBlockingComponent final
{
public:
	class UPrimitiveComponent*                    Component;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bBlockingComponent;                                // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BI_BlockingRushOperatorInterface_C_CheckBlockingComponent;

// Function BI_BlockingRushOperatorInterface.BI_BlockingRushOperatorInterface_C.IgnoreGivePassive
// 0x0010 (0x0010 - 0x0000)
struct BI_BlockingRushOperatorInterface_C_IgnoreGivePassive final
{
public:
	class UPrimitiveComponent*                    Component;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIgnore;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BI_BlockingRushOperatorInterface_C_IgnoreGivePassive;

// Function BI_BlockingRushOperatorInterface.BI_BlockingRushOperatorInterface_C.BlockPenetrate
// 0x0010 (0x0010 - 0x0000)
struct BI_BlockingRushOperatorInterface_C_BlockPenetrate final
{
public:
	class AActor*                                 CauserActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bBlock;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BI_BlockingRushOperatorInterface_C_BlockPenetrate;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
