#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_InteractOperatorInterface

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function BI_InteractOperatorInterface.BI_InteractOperatorInterface_C.CheckErrorConditionOperator
// 0x0010 (0x0010 - 0x0000)
struct BI_InteractOperatorInterface_C_CheckErrorConditionOperator final
{
public:
	class AActor*                                 InteractActor;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bErrorCondition;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         ErrorType;                                         // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_InteractOperatorInterface_C_CheckErrorConditionOperator;

// Function BI_InteractOperatorInterface.BI_InteractOperatorInterface_C.InteractableOperator
// 0x0010 (0x0010 - 0x0000)
struct BI_InteractOperatorInterface_C_InteractableOperator final
{
public:
	class AActor*                                 InteractActor;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReturnValue;                                      // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BI_InteractOperatorInterface_C_InteractableOperator;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
