#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_PassThruInterface

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function BI_PassThruInterface.BI_PassThruInterface_C.LocationEnterFrom
// 0x0018 (0x0018 - 0x0000)
struct BI_PassThruInterface_C_LocationEnterFrom final
{
public:
	class ABP_AJBInGameCharacter_C*               Character;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bOriginToCounterpart;                              // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ReturnValue;                                       // 0x000C(0x000C)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_PassThruInterface_C_LocationEnterFrom;

// Function BI_PassThruInterface.BI_PassThruInterface_C.LocationEnterTo
// 0x0010 (0x0010 - 0x0000)
struct BI_PassThruInterface_C_LocationEnterTo final
{
public:
	bool                                          bOriginToCounterpart;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ReturnValue;                                       // 0x0004(0x000C)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_PassThruInterface_C_LocationEnterTo;

// Function BI_PassThruInterface.BI_PassThruInterface_C.LocationExitFrom
// 0x0010 (0x0010 - 0x0000)
struct BI_PassThruInterface_C_LocationExitFrom final
{
public:
	bool                                          bOriginToCounterpart;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ReturnValue;                                       // 0x0004(0x000C)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_PassThruInterface_C_LocationExitFrom;

// Function BI_PassThruInterface.BI_PassThruInterface_C.LocationExitTo
// 0x0010 (0x0010 - 0x0000)
struct BI_PassThruInterface_C_LocationExitTo final
{
public:
	bool                                          bOriginToCounterpart;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ReturnValue;                                       // 0x0004(0x000C)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_PassThruInterface_C_LocationExitTo;

// Function BI_PassThruInterface.BI_PassThruInterface_C.NormalOfEntrance
// 0x0010 (0x0010 - 0x0000)
struct BI_PassThruInterface_C_NormalOfEntrance final
{
public:
	bool                                          bOriginToCounterpart;                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ReturnValue;                                       // 0x0004(0x000C)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_PassThruInterface_C_NormalOfEntrance;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
