#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BI_ShotNGPoint

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function BI_ShotNGPoint.BI_ShotNGPoint_C.CheckLocallyControlled
// 0x0001 (0x0001 - 0x0000)
struct BI_ShotNGPoint_C_CheckLocallyControlled final
{
public:
	bool                                          bLocallyControlled;                                // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BI_ShotNGPoint_C_CheckLocallyControlled;

// Function BI_ShotNGPoint.BI_ShotNGPoint_C.GetShotLocation
// 0x0020 (0x0020 - 0x0000)
struct BI_ShotNGPoint_C_GetShotLocation final
{
public:
	bool                                          bConsiderCharacterCapsuleRadius;                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           SkillTag;                                          // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        Locations;                                         // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor)
};
DUMPER7_ASSERTS_BI_ShotNGPoint_C_GetShotLocation;

// Function BI_ShotNGPoint.BI_ShotNGPoint_C.GetShutTraceRadius
// 0x0004 (0x0004 - 0x0000)
struct BI_ShotNGPoint_C_GetShutTraceRadius final
{
public:
	float                                         Radius;                                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_ShotNGPoint_C_GetShutTraceRadius;

// Function BI_ShotNGPoint.BI_ShotNGPoint_C.ShouldShowNGPoint
// 0x0001 (0x0001 - 0x0000)
struct BI_ShotNGPoint_C_ShouldShowNGPoint final
{
public:
	bool                                          bResult;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BI_ShotNGPoint_C_ShouldShowNGPoint;

// Function BI_ShotNGPoint.BI_ShotNGPoint_C.GetDummyShotLocation
// 0x000C (0x000C - 0x0000)
struct BI_ShotNGPoint_C_GetDummyShotLocation final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BI_ShotNGPoint_C_GetDummyShotLocation;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
