#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBLongPressInteract

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "BP_AJBSupportSkillBase_classes.hpp"
#include "AJB_structs.hpp"
#include "AkAudio_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBLongPressInteract.BP_AJBLongPressInteract_C
// 0x00D8 (0x0230 - 0x0158)
class UBP_AJBLongPressInteract_C : public UBP_AJBSupportSkillBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBLongPressInteract_C;          // 0x0158(0x0008)(Transient, DuplicateTransient)
	struct FGameplayTag                           InteractParticleTag;                               // 0x0160(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameParticleEffect_C*          InteractParticle;                                  // 0x0168(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPlayEndSection;                                   // 0x0170(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           InteractMontageStand;                              // 0x0178(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReadyTime;                                         // 0x0180(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInteractDownedCharacter;                          // 0x0184(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bInteractFootLocation;                             // 0x0185(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bInteractOwnerCharacterSpecifiedBone;              // 0x0186(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_187[0x1];                                      // 0x0187(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   InteractOwnerCharacterSpecifiedBoneName;           // 0x0188(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StandMontageBlendOutTime;                          // 0x0190(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bStandRotateToTarget;                              // 0x0194(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_195[0x3];                                      // 0x0195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 InteractActor;                                     // 0x0198(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         YawToPlayer_deg_;                                  // 0x01A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DistanceToPlayer_cm_;                              // 0x01A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OffsetZToPlayer_cm_;                               // 0x01A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           LongPressInteractSETag;                            // 0x01B0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           LongPressInteractSE;                               // 0x01B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InteractMontageStand_StartSectionName;             // 0x01C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InteractMontageStand_EndSectionName;               // 0x01C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          InteractMontageStand_EndSectionAnim;               // 0x01D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCompPlayStandMontage_EndSection;                  // 0x01D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TraceLength;                                       // 0x01DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ExtensionTimeToChangeNormalWalkingMode;            // 0x01E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E4[0x4];                                      // 0x01E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           InteractMontageCharacter;                          // 0x01E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   InteractMontageCharacter_EndSectionName;           // 0x01F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          InteractMontageCharacter_EndSectionAnim;           // 0x01F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCompPlayCharacterMontage_EndSection;              // 0x0200(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bShouldInputDisableDuringLongPress;                // 0x0201(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bCustomSpawnInteractParticle;                      // 0x0202(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bInteractedForMovedCharacter;                      // 0x0203(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bContinueAppearStandOnSucceed;                     // 0x0204(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         NextStateOnSucceed;                                // 0x0205(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bForceInactiveBasicSkillOnBegin;                   // 0x0206(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_207[0x1];                                      // 0x0207(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           LongPressInteractSuccessSETag;                     // 0x0208(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           StartVoiceTag;                                     // 0x0210(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           SuccessVoiceTag;                                   // 0x0218(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         ProgressedTime;                                    // 0x0220(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseProgressTime;                                  // 0x0224(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_225[0x3];                                      // 0x0225(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DivisionNum;                                       // 0x0228(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBLongPressInteract(int32 EntryPoint);
	void PlayLongInteractEndSE();
	void TryDisappearStand();
	void StopLongInteractSe();
	void PlayLongInteractSE();
	void UpdateErrorTypeUI(uint8 ErrorType);
	void ReceiveTick(float DeltaSeconds);
	void OnLongPressInteractEnded(bool bSuccess, bool bForceCancel, class AActor* InteractActor_0, bool bFlag01, float ProgressedTime_0);
	void OnLongPressInteractBegan(class AActor* InteractActor_0);
	void OnEndInteract(class AActor* TargetActor, bool bSuccess, bool bForceCancel, bool bFlag01, float ProgressedTime_0);
	void OnBeginInteract(class AActor* TargetActor);
	void OnRelatedCharacterBecomeLastSurvivor();
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	void OnCompleted_6D9C0F5845C72D1FE2E944AE6F9DEF66(class FName NotifyName);
	void OnBlendOut_6D9C0F5845C72D1FE2E944AE6F9DEF66(class FName NotifyName);
	void OnInterrupted_6D9C0F5845C72D1FE2E944AE6F9DEF66(class FName NotifyName);
	void OnNotifyBegin_6D9C0F5845C72D1FE2E944AE6F9DEF66(class FName NotifyName);
	void OnNotifyEnd_6D9C0F5845C72D1FE2E944AE6F9DEF66(class FName NotifyName);
	void OnCompleted_6D9C0F5845C72D1FE2E944AEA42BE1E1(class FName NotifyName);
	void OnBlendOut_6D9C0F5845C72D1FE2E944AEA42BE1E1(class FName NotifyName);
	void OnInterrupted_6D9C0F5845C72D1FE2E944AEA42BE1E1(class FName NotifyName);
	void OnNotifyBegin_6D9C0F5845C72D1FE2E944AEA42BE1E1(class FName NotifyName);
	void OnNotifyEnd_6D9C0F5845C72D1FE2E944AEA42BE1E1(class FName NotifyName);
	void OnCompleted_C5A469DF48C56780B0E2F69F99F682E3(class FName NotifyName);
	void OnBlendOut_C5A469DF48C56780B0E2F69F99F682E3(class FName NotifyName);
	void OnInterrupted_C5A469DF48C56780B0E2F69F99F682E3(class FName NotifyName);
	void OnNotifyBegin_C5A469DF48C56780B0E2F69F99F682E3(class FName NotifyName);
	void OnNotifyEnd_C5A469DF48C56780B0E2F69F99F682E3(class FName NotifyName);
	void OnCompleted_C5A469DF48C56780B0E2F69FCC377909(class FName NotifyName);
	void OnBlendOut_C5A469DF48C56780B0E2F69FCC377909(class FName NotifyName);
	void OnInterrupted_C5A469DF48C56780B0E2F69FCC377909(class FName NotifyName);
	void OnNotifyBegin_C5A469DF48C56780B0E2F69FCC377909(class FName NotifyName);
	void OnNotifyEnd_C5A469DF48C56780B0E2F69FCC377909(class FName NotifyName);
	void GetTraceLength(float* TraceLength_0);
	void CheckActive(bool* bActive);
	void DecideSpawnParticleInfo(struct FVector* Location, struct FRotator* Rotation, class USceneComponent** SceneComponent, class FName* SocketName);
	void TrySpawnInteractParticle();
	void CalcProgressTime(float InProgressTime, float* OutProgressedTime);
	void BeginInteract(bool* bSuccess);
	void GetPriority(int32* Priority);
	void GetText(bool* bSuccess, class FText* Text);
	void CheckInteractable(class ABP_AJBInGameCharacter_C* OperatorCharacter, class AActor* TargetActor, float BaseTraceLength, bool* bInteractable);
	void GetDeltaSecondsRate(float* Rate);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBLongPressInteract_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBLongPressInteract_C")
	}
	static class UBP_AJBLongPressInteract_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBLongPressInteract_C>();
	}
};
DUMPER7_ASSERTS_UBP_AJBLongPressInteract_C;

SDK_NAMESPACE_END
