#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBFirstBombSkill

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "BP_AJBPlacementSkill_classes.hpp"
#include "AJB_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBFirstBombSkill.BP_AJBFirstBombSkill_C
// 0x0050 (0x0370 - 0x0320)
class UBP_AJBFirstBombSkill_C final : public UBP_AJBPlacementSkill_C
{
public:
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBFirstBombSkill_C;             // 0x0318(0x0008)(Transient, DuplicateTransient)
	struct FGameplayTag                           GivePassiveTag;                                    // 0x0320(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         SpawnedActorList_Server_;                          // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          bDebugShowImpulseInfo_Server_;                     // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_339[0x7];                                      // 0x0339(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClass*>                         ExclusionPassiveClassList;                         // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class ABP_AJBInGameCharacter_C*>       BombingTargetCache_Server;                         // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	struct FGameplayTag                           PlacementVoiceTag_Character;                       // 0x0360(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBFirstBombSkill(int32 EntryPoint);
	void OnBecomeLastSurvivor(bool bBitesTheDust);
	void OnCharacterDead(const struct FGameplayTag& DamageType, class AActor* DeadActor, class AActor* DamageCauser);
	void ROC_SendEffectiveValue(int32 Value);
	void SendEffectiveValue_Server();
	void OnPassiveAdded(const struct FGameplayTag& AddCondition, const struct FGameplayTag& SecondTag);
	void OnReadyToDestroy(class ABP_AJBPlacementBase_C* SelfObject);
	void OnPassiveRemoved(const struct FGameplayTag& RemoveCondition, const struct FGameplayTag& SecondTag, class ABP_AJBInGameCharacter_C* CharacterBP);
	void ClearingOldObject();
	void SpawnNewObject(const struct FTransform& Transform, class AActor* TargetActor);
	void GetValidatedObjects(TArray<class UObject*>* Objects);
	void RemoveBombing_Server_(class UObject* Object);
	void CheckAnyExclusionPassiveActive(class ABP_AJBInGameCharacter_C* CharacterBP, bool* bValid);
	void CacheBombingTarget(class ABP_AJBInGameCharacter_C* Target);
	void ChangeEnableShouldUpdateBombing(class ABP_AJBInGameCharacter_C* IngameCharacterBP, bool bEnable, bool bIgnoreActiveCheck);
	void TraceObjectTransform(bool* bPossiblePlacement_0, struct FTransform* Transform, class AActor** TargetActor);
	void AddToObjectList(class AActor* TargetActor);
	void CalcValidatedObjectNum(int32* Num);
	void CalcMostOldestObject(class AActor** Object);
	void TryToSpeakPlacementVoice();
	void CheckCharacterCondition(class ABP_AJBInGameCharacter_C* CharacterBP, bool* bIgnore);
	void ReceiveBeginPlay();
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBFirstBombSkill_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBFirstBombSkill_C")
	}
	static class UBP_AJBFirstBombSkill_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBFirstBombSkill_C>();
	}
};
DUMPER7_ASSERTS_UBP_AJBFirstBombSkill_C;

SDK_NAMESPACE_END
