#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBGEXRequiemSkill

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "BP_AJBSkillBase_classes.hpp"
#include "AJB_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBGEXRequiemSkill.BP_AJBGEXRequiemSkill_C
// 0x0030 (0x0218 - 0x01E8)
class UBP_AJBGEXRequiemSkill_C final : public UBP_AJBSkillBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBGEXRequiemSkill_C;            // 0x01E8(0x0008)(Transient, DuplicateTransient)
	class UAnimMontage*                           BeginAnimation;                                    // 0x01F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           EndAnimation;                                      // 0x01F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           StandStartParticleTag;                             // 0x0200(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameParticleEffect_C*          StartParticleEffectOnGEX;                          // 0x0208(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDuringRequiemAction;                              // 0x0210(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x3];                                      // 0x0211(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RequiemActionSafetyTime;                           // 0x0214(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBGEXRequiemSkill(int32 EntryPoint);
	void OnPassiveRemoved(const struct FGameplayTag& RemoveCondition, const struct FGameplayTag& SecondTag, class ABP_AJBInGameCharacter_C* CharacterBP);
	void OnPassiveAdded(const struct FGameplayTag& AddCondition, const struct FGameplayTag& SecondTag);
	void OnPassiveRemovedEvent(const struct FGameplayTag& RemoveCondition, const struct FGameplayTag& SecondTag, class ABP_AJBInGameCharacter_C* CharacterBP);
	void MC_StateEnd(bool bCancel);
	void ROS_StateEnd(bool bCancel);
	void OnStateEnd(bool bCancel);
	void StateTick();
	void TickState_Action();
	void StateEnd(bool bCancel);
	void BeginState_Action();
	void OnCompleted_7B45FB9D406D5826C78546BCEDF22BF7(class FName NotifyName);
	void OnBlendOut_7B45FB9D406D5826C78546BCEDF22BF7(class FName NotifyName);
	void OnInterrupted_7B45FB9D406D5826C78546BCEDF22BF7(class FName NotifyName);
	void OnNotifyBegin_7B45FB9D406D5826C78546BCEDF22BF7(class FName NotifyName);
	void OnNotifyEnd_7B45FB9D406D5826C78546BCEDF22BF7(class FName NotifyName);
	void SpawnStartParticle();
	void DestroyStartParticle();
	void OnDisconnected();
	void ReceiveBeginPlay();
	void OnCancel();
	void OnActive();
	void ReceiveTick(float DeltaSeconds);
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBGEXRequiemSkill_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBGEXRequiemSkill_C")
	}
	static class UBP_AJBGEXRequiemSkill_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBGEXRequiemSkill_C>();
	}
};
DUMPER7_ASSERTS_UBP_AJBGEXRequiemSkill_C;

SDK_NAMESPACE_END
