#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBHearingThings

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_AJBPassiveSkillBase_classes.hpp"
#include "AkAudio_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBHearingThings.BP_AJBHearingThings_C
// 0x0048 (0x0260 - 0x0218)
class UBP_AJBHearingThings_C final : public UBP_AJBPassiveSkillBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBHearingThings_C;              // 0x0218(0x0008)(Transient, DuplicateTransient)
	TArray<struct FGameplayTag>                   SpawnGionList;                                     // 0x0220(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	float                                         Sec_;                                              // 0x0230(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GionSpawningRateOn3D;                              // 0x0234(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GionSpawningPointForwardOffset_cm_;                // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GionSpawningPointVelocityOffsetMultiplier;         // 0x023C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                GionSpawningBoxExtent;                             // 0x0240(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameProjectileKOIEcho_C*       PassiveSkillCausingEcho;                           // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HearingAbilityRate;                                // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBHearingThings(int32 EntryPoint);
	void ChangeEnable(bool bEnable);
	void MC_RequestEchoGion(const struct FGameplayTag& EffectType, const struct FVector& WorldLocation, class USceneComponent* SceneComponentToAttachWwise);
	void ROS_RequestEchoGion(const struct FGameplayTag& EffectType, const struct FVector& WorldLocation, class USceneComponent* SceneComponentToAttachWwise);
	void ChangeStatus(bool bEnable);
	void ReceiveBeginPlay();
	void PlaySE(class UObject* Causer);
	void OnActionActivate(bool bTriggeredByStand);
	void OnActionInactivate(bool bTriggeredByStand);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBHearingThings_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBHearingThings_C")
	}
	static class UBP_AJBHearingThings_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBHearingThings_C>();
	}
};
DUMPER7_ASSERTS_UBP_AJBHearingThings_C;

SDK_NAMESPACE_END
