#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBDrawnPSBuffSkill

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "BP_AJBBuffSkill_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBDrawnPSBuffSkill.BP_AJBDrawnPSBuffSkill_C
// 0x0030 (0x0278 - 0x0248)
class UBP_AJBDrawnPSBuffSkill_C final : public UBP_AJBBuffSkill_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBDrawnPSBuffSkill_C;           // 0x0248(0x0008)(Transient, DuplicateTransient)
	struct FGameplayTag                           StartGionTag;                                      // 0x0250(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           StartSETag;                                        // 0x0258(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         ActiveUISafetyTime;                                // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCompletedAddPassive;                              // 0x0264(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_265[0x3];                                      // 0x0265(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         s__BP_AJBDrawnPSBuffSkill_C;                       // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SowrdEnableTime;                                   // 0x026C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCompletedEnableSword;                             // 0x0270(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_271[0x3];                                      // 0x0271(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LoweringMoveScale;                                 // 0x0274(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBDrawnPSBuffSkill(int32 EntryPoint);
	void MC_CancelSword();
	void OnCompleted_7DDD297442D7CC4375E0C99B8C9AE494(class FName NotifyName);
	void OnBlendOut_7DDD297442D7CC4375E0C99B8C9AE494(class FName NotifyName);
	void OnInterrupted_7DDD297442D7CC4375E0C99B8C9AE494(class FName NotifyName);
	void OnNotifyBegin_7DDD297442D7CC4375E0C99B8C9AE494(class FName NotifyName);
	void OnNotifyEnd_7DDD297442D7CC4375E0C99B8C9AE494(class FName NotifyName);
	void RequestParticleSword(const struct FGameplayTag& ParticleTag);
	void OnBeginPassive();
	void PlayMontage();
	void BeginState_Action();
	void OnStateEnd(bool bCancel);
	void TickState_Action();
	void InitializeVariables();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBDrawnPSBuffSkill_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBDrawnPSBuffSkill_C")
	}
	static class UBP_AJBDrawnPSBuffSkill_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBDrawnPSBuffSkill_C>();
	}
};
DUMPER7_ASSERTS_UBP_AJBDrawnPSBuffSkill_C;

SDK_NAMESPACE_END
