#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBSkillBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AJB_structs.hpp"
#include "AJB_classes.hpp"
#include "E_SidlingFinishTiming_structs.hpp"
#include "E_VoiceProcessType_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBSkillBase.BP_AJBSkillBase_C
// 0x00D8 (0x01E8 - 0x0110)
class UBP_AJBSkillBase_C : public UAJBInGameSkillComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0110(0x0008)(Transient, DuplicateTransient)
	struct FGameplayTag                           SkillTag;                                          // 0x0118(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         ConsumptionMP;                                     // 0x0120(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ConsumptionMPOnCritical;                           // 0x0124(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         s_;                                                // 0x0128(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Damage;                                            // 0x012C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDefaultLock;                                      // 0x0130(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_131[0x3];                                      // 0x0131(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LeftUseNum;                                        // 0x0134(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Phase;                                             // 0x0138(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  GameplayTagContainer;                              // 0x0140(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         StateTime;                                         // 0x0160(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         SkillState;                                        // 0x0164(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bContinuedHealMP;                                  // 0x0165(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          CustomConsumeSkill;                                // 0x0166(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bShouldCancelOnLandingStop;                        // 0x0167(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bShouldCancelOnDash;                               // 0x0168(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bWithCharacterMovement;                            // 0x0169(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16A[0x6];                                      // 0x016A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           PassiveSkillTag;                                   // 0x0170(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         DamageOnSeparate;                                  // 0x0178(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PassiveSkillDuration_Sec_;                         // 0x017C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAJBSkillType                                 SkillType;                                         // 0x0180(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bMovable;                                          // 0x0181(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bRotatable;                                        // 0x0182(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_183[0x1];                                      // 0x0183(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         UseCount;                                          // 0x0184(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDuringTheWorld;                                   // 0x0188(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189[0x3];                                      // 0x0189(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PropertiesForUIReplicationFrequency;               // 0x018C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         _ForSkipOwner_LeftUseNum;                          // 0x0190(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_194[0x4];                                      // 0x0194(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  _ForSkipOwner_GamePlayTagContainer;                // 0x0198(0x0020)(Edit, BlueprintVisible, Net, DisableEditOnInstance, RepNotify)
	bool                                          bIsInteractable;                                   // 0x01B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bRequireStand;                                     // 0x01B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         EffectiveState;                                    // 0x01BA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAggregateEffectiveCountWithEffectiveState;        // 0x01BB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bAggregateEffectiveTimeWithEffectiveState;         // 0x01BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bInvisibleReticleMPBar;                            // 0x01BD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BE[0x2];                                      // 0x01BE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SerialNumber;                                      // 0x01C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldSidleOnReady;                               // 0x01C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	E_SidlingFinishTiming                         SidlingFinishTiming;                               // 0x01C5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C6[0x2];                                      // 0x01C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ExtensionTimeToChangeNormalWalkingMode;            // 0x01C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDisableChangeSidlingMode;                         // 0x01CC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bImpossibleDash;                                   // 0x01CD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bShouldCancelWhenOwnerBecomingLastSurvivor;        // 0x01CE(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         RepSkillState;                                     // 0x01CF(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	ESkillFlowState                               RepSkillFlowState;                                 // 0x01D0(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	bool                                          bMulticastHasCome;                                 // 0x01D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bShouldRestoreSkillState;                          // 0x01D2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bMulticastHasComeForSkillFlowState;                // 0x01D3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bCustomStandTransformSettings;                     // 0x01D4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bContinueOnSpecialBreakDown;                       // 0x01D5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          CustomCallSkillComsumend;                          // 0x01D6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bManageSkillFlowStateForRepNotifyOnly;             // 0x01D7(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bShouldCancelDashOnReady;                          // 0x01D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bCustomActiveWidget;                               // 0x01D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bCustomInactiveWidget;                             // 0x01DA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bShouldUpdateMeshLocation;                         // 0x01DB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bCustomTryNotifyUltimateSkillUsedServer;           // 0x01DC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bCountSucceedOnSkillConsumed;                      // 0x01DD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bCanUseOnCritical;                                 // 0x01DE(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DF[0x1];                                      // 0x01DF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DecreaseConsumptionMP;                             // 0x01E0(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bForceIncrementUseCount;                           // 0x01E4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIgnoreLackNum;                                    // 0x01E5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_AJBSkillBase(int32 EntryPoint);
	void ROS_FinishSkillAnimation();
	void MC_FinishSkillAnimation();
	void ROS_CancelSkillAnimation();
	void MC_CancelSkillAnimation();
	void ROS_RequestPowerDown(float Value);
	void RequestPowerDown(float Value);
	void ROS_RequestTimeRewind(float Value);
	void RequestTimeRewind(float Value);
	void ROS_RequestDecrease(int32 Num);
	void RequestDecrease(int32 Num);
	void Lock_Server();
	void FinishSkillAnimation_Local();
	void FinishSkillAnimation_All();
	void CancelSkillAnimation_Local();
	void CancelSkillAnimation_All();
	void ROS_RequestPowerUp(float Value);
	void RequestPowerUp(float Value);
	void Unlock_Server();
	void OnRep_bActive();
	void OnDisconnected();
	void StateBeginPlay(bool bShouldRestore);
	void OnSetViewTargetToNewSpectatorForSkillFlowState();
	void CheckSkillFlowState(bool bShouldRestore);
	void ReceiveBeginPlay();
	void MC_ReadySkill(class UBP_AJBSkillBase_C* ReadySkill_0);
	void ROS_ReadySkill(class UBP_AJBSkillBase_C* ReadySkill_0);
	void InitializeComponentBP();
	void RequestSetLeftUseNum(int32 Num);
	void ROS_RequestIncrease(int32 Num);
	void ROS_RequestTimeExtension(float Value);
	void RequestIncrease(int32 Num);
	void RequestTimeExtension(float Value);
	void OnStartSelfSpectatorReplicateProperties();
	void ROS_ReplicatePropertiesForUI(int32 LeftUseNum_0, const struct FGameplayTagContainer& GameplayTagContainer_0);
	void ReplicatePropertiesForUI();
	void OnCancel();
	void InactiveWidget();
	void ActiveWidget();
	void OnActive();
	void ReceiveTick(float DeltaSeconds);
	void RemoveGameplayTag(const struct FGameplayTag& Tag);
	void AddGameplayTag(const struct FGameplayTag& Tag, class UObject* Operator, class UObject* Target, const struct FGameplayTag& CauserType, int32 SerialNumber_0);
	void OnReady();
	void OnInactive();
	void OnRelatedCharacterBecomeLastSurvivor();
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	void AddGameplayTagWithFloat(const struct FGameplayTag& Tag, float FloatValue);
	bool CanUseSkill(struct FGameplayTagContainer* TagContainer);
	void UseMP(float ConsumptionMP_0);
	void PhaseUp();
	void ConsumeSkill();
	void IsSatisfiedLeftNum(bool* IsSatisfied);
	void ChangeState(uint8 NextState);
	void UnLock();
	void CheckSkillState(uint8 State, bool* bMatch);
	void Increase_Local(int32 Num);
	void ReserveInactive();
	void InitializeVariables();
	void UnreserveInactive();
	bool CheckSkillAction();
	void CheckPossibleInteract(bool* bPossibleInteract);
	void DuringTheWorld(bool* Result);
	void OnRep__ForSkipOwner_LeftUseNum();
	void OnRep__ForSkipOwner_GamePlayTagContainer();
	void TryToSpeakVoice(const struct FGameplayTag& VoiceTag, E_VoiceProcessType VoiceProcessType, bool bSpeakEvenIfNotAlive, bool bSpeakEvenIfDuringTheWorld, bool bSpeakEvenIfNotLocalEnv, bool bAlsoSpeakOnPairEnv, bool bIgnoreIfDuringTheWorld, bool* bWillBeSpoken);
	void ReserveBreakVoice(const struct FGameplayTag& VoiceEventTagToStop);
	void AddMP(float RecoveryMP);
	void ChangeEnableSeal(bool bEnable);
	void AggregateEffectiveCountWithEffectiveState(uint8 NewState, uint8 PreState);
	void GenerateSerialNumber(int32* SerialNumber_0);
	void TimeExtension_Server(float Value);
	void Increase_Server(int32 Num);
	void SetLeftUseNum_Local(int32 NewLeftUseNum);
	void ApplySkillParameter();
	void OnRep_RepSkillState();
	void OnRep_RepSkillFlowState();
	void CheckStateCanAccompany(bool* bCanAccompany);
	void MPUpdateSettingOnActivate();
	void PowerUpServer(float Value);
	void GetSkillTypeAsName(class FName* Name_0);
	void TryNotifyUltimateSkillUsedServer();
	void GetPoliticConsumptionMP(float* ConsumptionMP_0);
	void ShouldCancelOnLandingStop(bool* bShouldCancel);
	void s__0(float* Param_s__0);
	void Lock();
	void Decrease_Local(int32 Num);
	void GetPossibleUseCount(int32 NecessaryCount, int32* PossibleUseCount);
	void Decrease_Server(int32 Num);
	void TimeRewind_Server(float Value);
	void PowerDown_Server(float Value);
	void ResetUseCount();
	void GetPoliticConsumptionMPForSkillIcon(float* ConsumptionMP_0);
	void CheckImpossibleDashTiming(bool* bImpossibleTiming);
	void GetGameplayTags(struct FGameplayTagContainer* TagContainerCopy);
	void GetPassiveSkillTag(struct FGameplayTag* PassiveSkillTag_0);
	void GetDuration(float* Duration);
	void GetCauserOwnerCharacterBP(class ABP_AJBInGameCharacter_C** CharacterBP);

	bool IsInPreview() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBSkillBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBSkillBase_C")
	}
	static class UBP_AJBSkillBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBSkillBase_C>();
	}
};
DUMPER7_ASSERTS_UBP_AJBSkillBase_C;

SDK_NAMESPACE_END
