#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameSceneDirectorComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "E_LastSurvivorCut_structs.hpp"
#include "GameplayTags_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBInGameSceneDirectorComponent.BP_AJBInGameSceneDirectorComponent_C
// 0x00A0 (0x0190 - 0x00F0)
class UBP_AJBInGameSceneDirectorComponent_C : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00F0(0x0008)(Transient, DuplicateTransient)
	float                                         CurrentCutRealTimeSec;                             // 0x00F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RealDeltaTimeSec;                                  // 0x00FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CurrentCut;                                        // 0x0100(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              BeforeTickDateTime;                                // 0x0108(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<struct FGameplayTag, class ABP_AJBInGameSceneCamera_C*> SceneCameraMap;                     // 0x0110(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class ABP_AJBInGameSceneCamera_C*             CurrentSceneCamera;                                // 0x0160(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnBeginCut;                                        // 0x0168(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   OnEndCut;                                          // 0x0178(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	uint8                                         BeforeCut;                                         // 0x0188(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBInGameSceneDirectorComponent(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void CutEnd(uint8 CurrentCut_0, uint8 NextCut);
	void CutBegin(uint8 CurrentCut_0, uint8 BeforeCut_0);
	void ChangeCut(E_LastSurvivorCut NextCut);
	void CutTick(uint8 Cut);
	void UpdateRealDeltaTime();
	void SwitchSceneCamera(const struct FGameplayTag& SceneCameraTag, const class UClass* SceneCameraClass, bool bCreateCameraWhenIsNotFound, bool* bSwitched, class ABP_AJBInGameSceneCamera_C** SceneCamera);
	void CreateSceneCamera(const struct FGameplayTag& SceneCameraTag, class UClass* SceneCameraClass, class ABP_AJBInGameSceneCamera_C** Camera);
	void MoveCamera(float Rate);
	void EnableTargetFollowing(bool bLookAtTarget);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBInGameSceneDirectorComponent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBInGameSceneDirectorComponent_C")
	}
	static class UBP_AJBInGameSceneDirectorComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBInGameSceneDirectorComponent_C>();
	}
};
DUMPER7_ASSERTS_UBP_AJBInGameSceneDirectorComponent_C;

SDK_NAMESPACE_END
