#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBHistoryActorBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_structs.hpp"
#include "BP_AJBActorBase_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBHistoryActorBase.BP_AJBHistoryActorBase_C
// 0x00A0 (0x03D0 - 0x0330)
class ABP_AJBHistoryActorBase_C : public ABP_AJBActorBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0330(0x0008)(Transient, DuplicateTransient)
	class UTextRenderComponent*                   Time;                                              // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   PlayerID;                                          // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   SerialNumber;                                      // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FAJBHistoryInfo                        HistoryInfo;                                       // 0x0350(0x0060)(Edit, BlueprintVisible, Net, ExposeOnSpawn)
	bool                                          bActive;                                           // 0x03B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3B1[0x3];                                      // 0x03B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CheckActivateTime;                                 // 0x03B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIncludeOwner;                                     // 0x03B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bDebugShowInfo;                                    // 0x03B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bDefaultActivate;                                  // 0x03BA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3BB[0x1];                                      // 0x03BB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HistoryTimeFromBattleStart_Sec_;                   // 0x03BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBHistoryManageComponent_C*        HistoryManageComponentRef;                         // 0x03C0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          bCurrentDebugShowHistoryInfo;                      // 0x03C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_AJBHistoryActorBase(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ChangeEnableTimeStop(bool bEnable);
	void DelayedDestroy(float DelayTime);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void ShouldActivate(bool* bShouldActivate);
	void ChangeActive(bool bEnable);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBHistoryActorBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBHistoryActorBase_C")
	}
	static class ABP_AJBHistoryActorBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBHistoryActorBase_C>();
	}
};
DUMPER7_ASSERTS_ABP_AJBHistoryActorBase_C;

SDK_NAMESPACE_END
