#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGamePlayerCameraManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBInGamePlayerCameraManager.BP_AJBInGamePlayerCameraManager_C
// 0x0040 (0x2630 - 0x25F0)
class ABP_AJBInGamePlayerCameraManager_C final : public AAJBPlayerCameraManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x25F0(0x0008)(Transient, DuplicateTransient)
	class APostProcessVolume*                     PostProcessVolume;                                 // 0x25F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PPMIndex_DamageArea;                               // 0x2600(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PPMIndex_TheWorld_TimeStop;                        // 0x2604(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PPMIndex_TheWorld_RadialBlur;                      // 0x2608(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PPMIndex_CrimsonDimension;                         // 0x260C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PPMIndex_BitesTheDust;                             // 0x2610(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PPMIndex_Rondo;                                    // 0x2614(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentDamageAreaEffectOpacity;                    // 0x2618(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261C[0x4];                                     // 0x261C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               DMI_DamageAreaPostProcess;                         // 0x2620(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInDamageArea;                                   // 0x2628(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          DamageAreaExists;                                  // 0x2629(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_AJBInGamePlayerCameraManager(int32 EntryPoint);
	void ChangeRondoEffect(bool bEnable);
	void ChangeBitesTheDustEffect(bool bEnable);
	void ChangeCrimsonDimensionEffect(bool bEnable);
	void OnResetPostProcess();
	void ChangeTheWorldEffect(bool Enable);
	void OpenTickGate();
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void SetPostProcessMaterialBlendWeight(int32 MaterialIndex, float Weight);
	void SetPostProcessMaterialObject(int32 MaterialIndex, class UObject* Object, bool bAutoInsert);
	void SetPostProcessMaterial(class UMaterialInterface* PostprocessMaterial, int32& PostProcesIndex, bool IsEnable);
	void PrepareDamageAreaDynamicMaterialInstance();
	void RequestDestroyDefaultListener();
	void CheckExistPostProcessMaterialFromIndex(int32 MaterialIndex, bool* bExist);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBInGamePlayerCameraManager_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBInGamePlayerCameraManager_C")
	}
	static class ABP_AJBInGamePlayerCameraManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBInGamePlayerCameraManager_C>();
	}
};
DUMPER7_ASSERTS_ABP_AJBInGamePlayerCameraManager_C;

SDK_NAMESPACE_END
