#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameStand_ECH

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_structs.hpp"
#include "BP_AJBInGameStand_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBInGameStand_ECH.BP_AJBInGameStand_ECH_C
// 0x00A0 (0x0580 - 0x04E0)
class ABP_AJBInGameStand_ECH_C final : public ABP_AJBInGameStand_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBInGameStand_ECH_C;            // 0x04E0(0x0008)(Transient, DuplicateTransient)
	class UParticleSystemComponent*               PS_Act3;                                           // 0x04E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Tail_a_09;                                         // 0x04F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Tail_a_01;                                         // 0x04F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               R_UpperArm;                                        // 0x0500(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               L_UpperArm;                                        // 0x0508(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Spine;                                             // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               Head;                                              // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       ThreeFreeze_Attack;                                // 0x0520(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        ShotPoint;                                         // 0x0528(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       MiddleRange_Attack;                                // 0x0530(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ABP_LaunchPart_C*                       Rep_LaunchPart;                                    // 0x0538(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ChangedNewOperation;                               // 0x0540(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EECHState                                     ACT;                                               // 0x0541(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_542[0x6];                                      // 0x0542(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          ACT1Mesh;                                          // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          ACT2Mesh;                                          // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          ACT3Mesh;                                          // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>             ACT1Materials;                                     // 0x0560(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class UMaterialInterface*>             ACT3Materials;                                     // 0x0570(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_AJBInGameStand_ECH(int32 EntryPoint);
	void ChangeEmoteAct(EECHState ACT_0);
	void UpdateAuraVisibility(EECHState ACT_0);
	void ChangeAct_Local(EECHState ACT_0, bool ShouldPlayAct3Montage);
	void MC_Change(EECHState ACT_0, bool ShouldPlayAct3Montage);
	void ROS_Change(EECHState ACT_0, bool ShouldPlayAct3Montage);
	void ChangeAct(EECHState NewACT, bool ShouldPlayAct3Montage);
	void OnReady();
	void OnReturn();
	void OnLaunch();
	void OnCompleted_AE5112D74E9B95EC4A8998BF9C53585E(class FName NotifyName);
	void ChangeSkin(const class FString& StandName, uint8 skinID);
	void CleanUp(bool bShouldDestroy);
	void PlayAppearMontage();
	void StandSetup();
	void OnBlendOut_AE5112D74E9B95EC4A8998BF9C53585E(class FName NotifyName);
	void OnInterrupted_AE5112D74E9B95EC4A8998BF9C53585E(class FName NotifyName);
	void OnNotifyBegin_AE5112D74E9B95EC4A8998BF9C53585E(class FName NotifyName);
	void OnNotifyEnd_AE5112D74E9B95EC4A8998BF9C53585E(class FName NotifyName);
	void OnCompleted_E707BD7D424D88E2F60E5E8E708E45E5(class FName NotifyName);
	void OnBlendOut_E707BD7D424D88E2F60E5E8E708E45E5(class FName NotifyName);
	void OnInterrupted_E707BD7D424D88E2F60E5E8E708E45E5(class FName NotifyName);
	void OnNotifyBegin_E707BD7D424D88E2F60E5E8E708E45E5(class FName NotifyName);
	void OnNotifyEnd_E707BD7D424D88E2F60E5E8E708E45E5(class FName NotifyName);
	void SetActMeshAndMaterial(EECHState ACT_0);
	void StringToAct(const class FString& CharacterTag, EECHState* ACT_0);
	void GetLaunchedActorHomeLocation(int32 CloseRangeSkillNo, struct FVector* Location);
	void GetCloseRangeLaunchedActor(int32 CloseRangeSkillNo, class AActor** LaunchedActor);
	void GetAttackRange(int32 CloseRangeSkillNo, float* AttackRange);
	void GetAttackCollisionRadius(int32 CloseRangeSkillNo, float* Radius);
	void GetAttackLocation(const struct FVector& TargetLocation, struct FVector* Location);
	void GetStandAttackOffset(int32 CloseRangeSkillNo, struct FVector* StandAttackOffset);
	void ShouldShowNGPoint(bool* bResult);
	void GetShutTraceRadius(float* Radius);
	void GetShotLocation(bool bConsiderCharacterCapsuleRadius, const struct FGameplayTag& SkillTag, TArray<struct FVector>* Locations);
	void CheckLocallyControlled(bool* bLocallyControlled);
	void GetDummyShotLocation(struct FVector* Location);
	void GetDamageActorTargetLocation(struct FVector* Location);
	void OnPreEmoteAccompany(TSoftObjectPtr<class UAnimMontage> Montage);
	void UserConstructionScript();
	void SpawnAccompanyEmitter(EStandAccompanyTransition AccompanyTransition);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBInGameStand_ECH_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBInGameStand_ECH_C")
	}
	static class ABP_AJBInGameStand_ECH_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBInGameStand_ECH_C>();
	}
};
DUMPER7_ASSERTS_ABP_AJBInGameStand_ECH_C;

SDK_NAMESPACE_END
