#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBShotNGPointHUD

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "UMG_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBShotNGPointHUD.BP_AJBShotNGPointHUD_C
// 0x0028 (0x0118 - 0x00F0)
class UBP_AJBShotNGPointHUD_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00F0(0x0008)(Transient, DuplicateTransient)
	float                                         TargetTracedDistance;                              // 0x00F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HitDeviationDistance3D;                            // 0x00FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ShutTracedDistance;                                // 0x0100(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HitDeviationDistance2D;                            // 0x0104(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacter*                    TargetInGameCharacter;                             // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ShotNG_C*                           TargetWidget;                                      // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBShotNGPointHUD(int32 EntryPoint);
	void OnStartLastSurvivorScene();
	void ReceiveTick(float DeltaSeconds);
	void OnEndInGameOpeningCountDown();
	void OnStartInGameOpeningCountDown();
	void ReceiveBeginPlay();
	void ShouldTickEnable(bool* bShouldTickEnable);
	void GetShotPointComponent(class USceneComponent** ShotPointComp);
	void GetShutTracedObjectTypes(TArray<EObjectTypeQuery>* ObjectTypes);
	void UpdateUI(class AAJBInGameCharacter* TargetCharacter);
	void ChangeActivate(bool bEnable);
	void Initialize();
	void SetNGPointVisibility(bool bNewVisibility);
	void SetupInGameCharacter(class AAJBInGameCharacter* TargetCharacter);
	void SetupTargetWidget(class UWB_ShotNG_C* TargetWidget_0);
	void CheckEnableElement(int32 Index_0, bool* bEnable);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBShotNGPointHUD_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBShotNGPointHUD_C")
	}
	static class UBP_AJBShotNGPointHUD_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBShotNGPointHUD_C>();
	}
};
DUMPER7_ASSERTS_UBP_AJBShotNGPointHUD_C;

SDK_NAMESPACE_END
