#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInstantWall

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_AJBPlacementDynamicBase_classes.hpp"
#include "GameplayTags_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBInstantWall.BP_AJBInstantWall_C
// 0x0038 (0x0458 - 0x0420)
class ABP_AJBInstantWall_C final : public ABP_AJBPlacementDynamicBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBInstantWall_C;                // 0x0420(0x0008)(Transient, DuplicateTransient)
	class USceneComponent*                        DamageTargetLocation;                              // 0x0428(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Mesh;                                              // 0x0430(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   CollisionMesh;                                     // 0x0438(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         StepZScale;                                        // 0x0440(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_444[0x4];                                      // 0x0444(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           BreakingSETag;                                     // 0x0448(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBCrimsonDimensionAffecter_C*      CrimsonDimensionAffecter;                          // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBInstantWall(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void UpdateCollisionMesh();
	void UpdateRenderCustomDepthPass();
	void ShouldActiveRenderCustomDepthPass(bool* bShouldActive);
	void TryGetDimensionAffecter(class ABP_AJBCrimsonDimensionAffecter_C** CrimsonDimensionAffecter_0);
	void StateTick_Standby(float DeltaSeconds);
	void StateTick_Prepare(float DeltaSeconds);
	void ReceiveBeginPlay();
	void OnBeginState_Standby();
	void OnBeginState_Clearing_OneShot();
	void OnBeginState_Clearing();
	void UserConstructionScript();
	void GetTargetLocation(struct FVector* Location);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBInstantWall_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBInstantWall_C")
	}
	static class ABP_AJBInstantWall_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBInstantWall_C>();
	}
};
DUMPER7_ASSERTS_ABP_AJBInstantWall_C;

SDK_NAMESPACE_END
