#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameAIObservedCharacter

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function BP_AJBInGameAIObservedCharacter.BP_AJBInGameAIObservedCharacter_C.ExecuteUbergraph_BP_AJBInGameAIObservedCharacter
// 0x0028 (0x0028 - 0x0000)
struct BP_AJBInGameAIObservedCharacter_C_ExecuteUbergraph_BP_AJBInGameAIObservedCharacter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* DestroyingActor)> K2Node_CreateDelegate_OutputDelegate;             // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_CustomEvent_bCanSee;                        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_DestroyingActor;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_AJBInGameAIObservedCharacter_C_ExecuteUbergraph_BP_AJBInGameAIObservedCharacter;

// Function BP_AJBInGameAIObservedCharacter.BP_AJBInGameAIObservedCharacter_C.OnInGameLifeTimeElapsed
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBInGameAIObservedCharacter_C_OnInGameLifeTimeElapsed final
{
public:
	class AActor*                                 DestroyingActor;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_AJBInGameAIObservedCharacter_C_OnInGameLifeTimeElapsed;

// Function BP_AJBInGameAIObservedCharacter.BP_AJBInGameAIObservedCharacter_C.UpdateObserverCanSee
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBInGameAIObservedCharacter_C_UpdateObserverCanSee final
{
public:
	bool                                          bCanSee;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_AJBInGameAIObservedCharacter_C_UpdateObserverCanSee;

// Function BP_AJBInGameAIObservedCharacter.BP_AJBInGameAIObservedCharacter_C.GetImaginaryCharacter
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBInGameAIObservedCharacter_C_GetImaginaryCharacter final
{
public:
	class ABP_AJBInGameAIImaginaryCharacter_C*    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_AJBInGameAIObservedCharacter_C_GetImaginaryCharacter;

// Function BP_AJBInGameAIObservedCharacter.BP_AJBInGameAIObservedCharacter_C.GetObservedPawn
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBInGameAIObservedCharacter_C_GetObservedPawn final
{
public:
	class APawn*                                  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetRawPawn_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_AJBInGameAIObservedCharacter_C_GetObservedPawn;

// Function BP_AJBInGameAIObservedCharacter.BP_AJBInGameAIObservedCharacter_C.IsObservable
// 0x000E (0x000E - 0x0000)
struct BP_AJBInGameAIObservedCharacter_C_IsObservable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsStealth_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsStandSeparating_bSeparation;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMovableStand_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LifeTimeExpired_ReturnValue;              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue2;                 // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAlive_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue2;                  // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_AJBInGameAIObservedCharacter_C_IsObservable;

// Function BP_AJBInGameAIObservedCharacter.BP_AJBInGameAIObservedCharacter_C.ActivateObject
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBInGameAIObservedCharacter_C_ActivateObject final
{
public:
	class ABP_AJBInGameAIImaginaryCharacter_C*    ImaginaryCharacter;                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_AJBInGameAIObservedCharacter_C_ActivateObject;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
