#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameCharacter_MDB

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_StencilDigit_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AJB_structs.hpp"
#include "BP_AJBInGameCharacter_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBInGameCharacter_MDB.BP_AJBInGameCharacter_MDB_C
// 0x00E0 (0x1940 - 0x1860)
class ABP_AJBInGameCharacter_MDB_C final : public ABP_AJBInGameCharacter_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBInGameCharacter_MDB_C;        // 0x1858(0x0008)(Transient, DuplicateTransient)
	class UBP_AJBReplay_C*                        BP_AJBReplay;                                      // 0x1860(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   MDBTimer;                                          // 0x1868(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   MDBEye_R;                                          // 0x1870(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   MDBEye_L;                                          // 0x1878(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_NewTrack_0_E22E2B64430A3738618043A5AEB979E0; // 0x1880(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_E22E2B64430A3738618043A5AEB979E0; // 0x1884(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1885[0x3];                                     // 0x1885(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x1888(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMovementMode                                 MovementModeBeforeTimeStop;                        // 0x1890(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRepEnable;                                        // 0x1891(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	bool                                          bRepABCMeshVisible;                                // 0x1892(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	bool                                          bRepMDBMeshVisible;                                // 0x1893(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                         Pad_1894[0x4];                                     // 0x1894(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   PassiveTagsShouldRecordImmidiately;                // 0x1898(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	class AAJBInGameStand*                        OwnerStandCache;                                   // 0x18A8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OwnerMatchingPlayerIndexCache;                     // 0x18B0(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	ESkillState_Transfer                          Rep_DubbingSkillState;                             // 0x18B4(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18B5[0x3];                                     // 0x18B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CurrentSpringArmWorldRotation;                     // 0x18B8(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               CurrentCameraWorldRotation;                        // 0x18C4(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                RepCameraTargetLocation;                           // 0x18D0(0x000C)(Edit, BlueprintVisible, Net, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRepValidCameraTargetLocation;                     // 0x18DC(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18DD[0x3];                                     // 0x18DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             MeshRelativeTransform;                             // 0x18E0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	int32                                         RetryCountToGetOwnerProperties;                    // 0x1910(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1914[0x4];                                     // 0x1914(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  PassiveTagsIgnored;                                // 0x1918(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_AJBInGameCharacter_MDB(int32 EntryPoint);
	void ChangeDubbingSkin();
	void ChangeMDBPartsSkin();
	void ChangeABCSkin();
	void ROS_SyncProperties();
	void ProcessDubbingState(const struct FGameplayTag& DamageType, class AActor* DamageCauser);
	void ChangeMDBMeshVisibleCore(bool bNewVisibility);
	void ChangeMDBMeshVisibleServer(bool NewVisibility);
	void ChangeMeshVisibleCore(bool bNewVisibility);
	void ChangeMeshVisibleServer(bool bNewVisibility);
	void SetupPropertyStandInteract();
	void ChangeEnableCore(bool bEnable);
	void ChangeEnableServer(bool bEnable);
	void FollowCharacterWhenUnpossessed_OnServer();
	void MC_SpawnDamageDisplay(const struct FAJBDamageDisplayParams& DisplayParams, const struct FAJBDamageDisplayProperty& DisplayProperty);
	void ForceEndShakeTimeline();
	void PlayShakeTimeline();
	void SetSerialNumber(int32 SerialNumber);
	void OnLoaded_21F53AD94A2001589A7A0992CCA6FBC7(class UObject* Loaded);
	void OnLoaded_6FEB94C2436C868ECDE635947C259434(class UObject* Loaded);
	void OnLoaded_EE6189324B1F4C2A78E3F8B2A59085EB(class UObject* Loaded);
	void Timeline_1__UpdateFunc();
	void Timeline_1__FinishedFunc();
	void OnRep_bRepEnable();
	void OnRep_bRepMDBMeshVisible();
	void OnRep_bRepABCMeshVisible();
	void ShoudRecording(const struct FGameplayTag& DamageType, class AActor* DamageCauser, bool* bShouldRecording);
	void IsActive(bool* IsActive_0);
	void IsAppear(bool* IsActiveState);
	void ShouldPropagatePassiveToABC(const struct FGameplayTag& PassiveTag, bool* ShouldPropagate);
	void ShouldRecordImmidiatelyPassive(const struct FGameplayTag& PassiveTag, bool* ShouldRecord);
	void CacheOwnerMatchingPlayerIndex(int32 OwnerMatchingPlayerIndexCache_0);
	void OnRep_OwnerMatchingPlayerIndexCache();
	void UpdateCameraOnSucceedReplay();
	void CalcIgnoreDistanceDateTime(struct FDateTime* DateTime);
	void SetMDBMeshOffset(const struct FVector& Offset);
	void ShouldForceSkipDubbingAction(const struct FGameplayTag& DamageType, bool* ShouldForceSkip);
	void IsIgnoredPassive(const struct FGameplayTag& PassiveTag, bool* IsIgnored);
	void GetPropertyType(EAJBCharacterPropertyType* PropertyType);
	void GetPropertyOwnerCharacterBP(class ABP_AJBInGameCharacter_C** CharacterBP);
	void TracableByAI(bool* bTracable);
	void DetectableByTrap(bool* bDetectable);
	void TreatAsCharacterBySpecialProjectile(bool* bTreat);
	void IsDetectableByDirectAttackGuide(bool* bIsDetectable);
	void IsTargetCO2Scan(bool* IsTarget);
	void IsTargetClourBarrier(bool* IsTarget);
	void IsTargetOverGrow(bool* IsTarget);
	void IsPlayOwnerVoiceOnGetItem(bool* bIsPlay);
	void IsPlayOwnerVoiceOnJump(bool* bIsPlay);
	void IsPlayOwnerVoiceOnPassThruEnter(bool* bIsPlay);
	void ChangeSkin();
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void OnReleasedEmote();
	void PressedButton_ActiveSpecial();
	void OnPressedEmote();
	void ChangeMovementModeOnTimeStop(bool bEnable, bool bOperatorIsEmpty);
	void AJBDamage(class AActor* DamagedActor, int32 DamageForHPAP, int32 DamageForAAP, int32 CutDamage, const struct FGameplayTag& DamageType, int32 SerialNumber, EDamagePriority DamagePriority, float AttackDistance, class AActor* DamageCauser, bool WithSeparatedStandAttack, bool HitEnemysSeparatedStand, bool bPenetrateAP, bool bNotUseCollision, bool IsEndured, const struct FAJBDamageDisplayParams& DamageDisplayParams, const struct FAJBDamageDisplayProperty& DamageDisplayProperty);
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	void AddGameplayTag(const struct FGameplayTag& Tag, class UObject* Operator, class UObject* Target, const struct FGameplayTag& CauserType, int32 SerialNumber);
	void UpdateCameraParam(float DeltaTime);
	void UserConstructionScript();
	void SetSystemEnable(bool bEnable, bool bCollision, bool bGravity, bool bSpringArm, bool bMovement);
	void ResetSystemEnable(bool bRestore);
	void ChangeSystemEnable(bool bCollision, bool bGravity, bool bSpringArm, bool bMovement, bool bRestore);
	void ChangeSystemDisable(bool bCollision, bool bGravity, bool bSpringArm, bool bMovement, bool bRestore);
	void CheckPossibleDetection(bool* bPossibleDetection);
	void CheckTargetSelf(class AActor* DamageCauser, bool bForDamageOverlap, bool bIgnoreMovableStand, bool bIncludeSelf, bool bAfterReflectShouldHitOwner, bool* bTarget);
	void InteractableOperator(class AActor* InteractActor, bool* bReturnValue);
	void GetPrimitivesToChangeStencil(E_StencilDigit StencilDigit, TArray<class UPrimitiveComponent*>* PrimitiveComponents);
	void GetGionOwner(class AActor** GionOwner);

	void FindOwnerMatchingPlayerInfo(bool* Success, class FString* PlayerName, struct FMatchingPlayerInfo* MatchingPlayerInfo) const;
	void GetOwnerMatchingPlayerIndexCache(int32* OwnerMatchingPlayerIndexCache_0) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBInGameCharacter_MDB_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBInGameCharacter_MDB_C")
	}
	static class ABP_AJBInGameCharacter_MDB_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBInGameCharacter_MDB_C>();
	}
};
DUMPER7_ASSERTS_ABP_AJBInGameCharacter_MDB_C;

SDK_NAMESPACE_END
