#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBReplay

#include "Basic.hpp"

#include "BP_AJBLongPressInteract_classes.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AkAudio_structs.hpp"
#include "AJB_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBReplay.BP_AJBReplay_C
// 0x0070 (0x02A0 - 0x0230)
class UBP_AJBReplay_C final : public UBP_AJBLongPressInteract_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBReplay_C;                     // 0x0230(0x0008)(Transient, DuplicateTransient)
	float                                         ReplayTime;                                        // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameParticleEffect_C*          ReplayStartParticle;                               // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ParticleTag_Start;                                 // 0x0248(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ParticleTag_Changed;                               // 0x0250(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameParticleEffect_C*          ReplayChangedParticle;                             // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBReplayActor_C*                   ReplayActor;                                       // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GionTag_Interacting;                               // 0x0268(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         GionDelay_Interacting;                             // 0x0270(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GionInterval_Interacting;                          // 0x0274(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           SuccessInteractionSETag;                           // 0x0278(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           SuccessInteractionVoiceTag;                        // 0x0280(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           BeginInteractionVoiceTag;                          // 0x0288(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bOwnerIsDubbing;                                   // 0x0290(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           ReplayLoopSE;                                      // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBReplay(int32 EntryPoint);
	void OnInteractSucceedServer(class ABP_AJBInGameCharacter_C* TargetCharacterBP, const struct FTransform& InteractActorTransform, const struct FDateTime& AccessedHistoryDateTime);
	void OnInteractSucceed(const struct FTransform& InteractActorTransform);
	void MC_SuccessInteract(const struct FTransform& InteractActorTransform);
	void OnCompleteReplay();
	void ROS_SuccessInteract(int32 TargetPlayerID, const struct FDateTime& AccessedHistoryDateTime, const struct FTransform& InteractActorTransform);
	void ReceiveBeginPlay();
	void End_ReplayLoopSE();
	void Pause_ReplayLoopSE();
	void OnEnd_ReplayLoopSE(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo);
	void Resume_ReplayLoopSE();
	void Play_ReplayLoopSE();
	void FindHistoryTarget(int32 PlayerID, class ABP_AJBInGameCharacter_C** TargetCharacterBP);
	void SpawnReplayActor(class ABP_AJBInGameCharacter_C* TargetCharacterBP, const struct FTransform& InteractActorTransform);
	void StopLongInteractSe();
	void PlayLongInteractSE();
	void ReceiveTick(float DeltaSeconds);
	void OnLongPressInteractBegan(class AActor* InteractActor_0);
	void OnLongPressInteractEnded(bool bSuccess, bool bForceCancel, class AActor* InteractActor_0, bool bFlag01, float ProgressedTime_0);
	void OnChangedViewTarget();
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	void BeginInteract(bool* bSuccess);
	void CheckActive(bool* bActive);
	void CheckInteractable(class ABP_AJBInGameCharacter_C* OperatorCharacter, class AActor* TargetActor, float BaseTraceLength, bool* bInteractable);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBReplay_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBReplay_C")
	}
	static class UBP_AJBReplay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBReplay_C>();
	}
};
DUMPER7_ASSERTS_UBP_AJBReplay_C;

SDK_NAMESPACE_END
