#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBAirBombSkill

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "BP_AJBSnipeSkill_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBAirBombSkill.BP_AJBAirBombSkill_C
// 0x00F0 (0x0378 - 0x0288)
class UBP_AJBAirBombSkill_C final : public UBP_AJBSnipeSkill_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBAirBombSkill_C;               // 0x0288(0x0008)(Transient, DuplicateTransient)
	float                                         ActionTime_s_;                                     // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_294[0x4];                                      // 0x0294(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           AM_StandChargeUp;                                  // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           AM_StandAction;                                    // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InvalidDistance;                                   // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentDistance;                                   // 0x02AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ProjectileSpeedFirst;                              // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ProjectileHomingIntensityFirst;                    // 0x02B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ProjectileSpeed;                                   // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           TimerHandleSyncTargetLocation;                     // 0x02C0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FVector                                TargetLocation;                                    // 0x02C8(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SyncTargetLocationInterval;                        // 0x02D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Rep_TargetLocation;                                // 0x02D8(0x000C)(Edit, BlueprintVisible, Net, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ProjectileHomingIntensity;                         // 0x02E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameParticleEffect_C*          ParticleOrbit;                                     // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ParticleOrbitScale;                                // 0x02F0(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2FC[0x4];                                      // 0x02FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 SpawnPreviewClass;                                 // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 SpawnGuideClass;                                   // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 PreviewObject;                                     // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 GuideObject;                                       // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxDistanceTraceStartToBase;                       // 0x0320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DistanceBaseToTraceEnd;                            // 0x0324(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinForwardZForMaxTraceDistanceRate;                // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxForawrdZForMinTraceDistanceRate;                // 0x032C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxTraceDistanceRate;                              // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinTraceDistanceRateDown;                          // 0x0334(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinTraceDistanceRateUp;                            // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ProjectileCollisionRadius;                         // 0x033C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ProjectileInitialVelocityTime_s_;                  // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           SwitchSETag;                                       // 0x0348(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            CV_Reflection;                                     // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           SwitchVoiceTag;                                    // 0x0358(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         ProjectileTargetForwardOffset;                     // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SyncProjectileLocationInterval;                    // 0x0364(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TimerHandleSyncProjectileLocation;                 // 0x0368(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	float                                         SyncProjectileLocationDistance;                    // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ProjectileLifeTime_s_;                             // 0x0374(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBAirBombSkill(int32 EntryPoint);
	void MC_SyncProjectileLocation(const struct FVector& TargetLocation_0);
	void SyncProjectileLocation();
	void ROS_SyncProjectileLocation(const struct FVector& TargetLocation_0);
	void EndSyncProjectileLocationTimer();
	void BeginSyncProjectileLocationTimer();
	void UpdateProjectileVisual();
	void OnSetViewTargetToNewSpectator_Local();
	void SyncTargetLocation();
	void ROS_SyncTargetLocation(const struct FVector& TargetLocation_0);
	void EndSyncTargetLocationTimer();
	void BeginSyncTargetLocationTimer();
	void Disappear();
	void Ignition();
	void OnLocalConsumed(bool bSucceed);
	void MC_EndState();
	void ROS_EndState();
	void EndStateLocal();
	void MC_BeginStateAction();
	void ROS_BeginStateAction();
	void BeginStateAction();
	void OnCompleted_7B45FB9D406D5826C78546BCA3129FB9(class FName NotifyName);
	void OnBlendOut_7B45FB9D406D5826C78546BCA3129FB9(class FName NotifyName);
	void OnInterrupted_7B45FB9D406D5826C78546BCA3129FB9(class FName NotifyName);
	void OnNotifyBegin_7B45FB9D406D5826C78546BCA3129FB9(class FName NotifyName);
	void OnNotifyEnd_7B45FB9D406D5826C78546BCA3129FB9(class FName NotifyName);
	void OnCompleted_7B45FB9D406D5826C78546BC6139A5AC(class FName NotifyName);
	void OnBlendOut_7B45FB9D406D5826C78546BC6139A5AC(class FName NotifyName);
	void OnInterrupted_7B45FB9D406D5826C78546BC6139A5AC(class FName NotifyName);
	void OnNotifyBegin_7B45FB9D406D5826C78546BC6139A5AC(class FName NotifyName);
	void OnNotifyEnd_7B45FB9D406D5826C78546BC6139A5AC(class FName NotifyName);
	void TrySpawnParticleOrbit(class AActor* AttachActor);
	void TryDestroyParticleOrbit();
	void TrySpawnPreviewObjects();
	void TryDestroyPreviewObjects();
	void UpdatePreviewObjects();
	void UpdateVelocity();
	void GetPoliticSpeed(float* Speed);
	void GetPoliticHomingIntensity(float* HomingIntencity);
	void GetPoliticDistance(float* Distance);
	void CalcProjectileVelocity(class ABP_AJBInGameProjectileAirBomb_C* ProjectileAirBomb, struct FVector* Velocity);
	void UpdateTargetLocationLocal();
	void TotalProjectileInitialDistance(float* Distance);
	void CountTimeAchievement();
	void EndState();
	void OnStateReady();
	void OnStateAction();
	void OnStateChargeUp();
	void ChangeProjectileSpeedScale(float SpeedScale);
	void ChangeAdditionalProjectileGravityPower(float Power);
	void TickStateAction();
	void TickStateChargeUp(float DeltaSeconds);
	void ReplicatedBullet();
	void StateBeginPlay(bool bShouldRestore);
	void ReceiveBeginPlay();
	void OnCancel();
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	void CheckStateCanAccompany(bool* bCanAccompany);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBAirBombSkill_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBAirBombSkill_C")
	}
	static class UBP_AJBAirBombSkill_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBAirBombSkill_C>();
	}
};
DUMPER7_ASSERTS_UBP_AJBAirBombSkill_C;

SDK_NAMESPACE_END
