#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBRondoPreview

#include "Basic.hpp"

#include "BP_AJBPreviewBase_classes.hpp"
#include "Engine_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBRondoPreview.BP_AJBRondoPreview_C
// 0x0020 (0x0388 - 0x0368)
class ABP_AJBRondoPreview_C final : public ABP_AJBPreviewBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBRondoPreview_C;               // 0x0368(0x0008)(Transient, DuplicateTransient)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal;                                             // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Radius;                                            // 0x0380(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MeshScaleZ;                                        // 0x0384(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBRondoPreview(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void UpdateRadius();
	void UpdateDecalParameter();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBRondoPreview_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBRondoPreview_C")
	}
	static class ABP_AJBRondoPreview_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBRondoPreview_C>();
	}
};
DUMPER7_ASSERTS_ABP_AJBRondoPreview_C;

SDK_NAMESPACE_END
