#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameCharacter_GRN

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_AJBInGameCharacter_classes.hpp"
#include "AJB_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBInGameCharacter_GRN.BP_AJBInGameCharacter_GRN_C
// 0x0040 (0x18A0 - 0x1860)
class ABP_AJBInGameCharacter_GRN_C final : public ABP_AJBInGameCharacter_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBInGameCharacter_GRN_C;        // 0x1858(0x0008)(Transient, DuplicateTransient)
	class UCapsuleComponent*                      RerquiemCapsule;                                   // 0x1860(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBPartsMaker_C*                    BP_AJBPartsMaker;                                  // 0x1868(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBGEXRequiemSkill_C*               BP_AJBGEXRequiemSkill;                             // 0x1870(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBOverGrowSkill_C*                 BP_AJBOverGrowSkill;                               // 0x1878(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBMudaRushGEXSkill_C*              BP_AJBMudaRushGEXSill;                             // 0x1880(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBAccompanyGEXSkill_C*             BP_AJBAccompanyGEXSkill;                           // 0x1888(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          bContinuedAccompany;                               // 0x1890(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1891[0x7];                                     // 0x1891(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        PairOverGrow;                                      // 0x1898(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBInGameCharacter_GRN(int32 EntryPoint);
	void NotifyTheWorldOnEventGraph(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	void ROS_AddGameplayTag_InvincibleGEXRequiem();
	void AddGameplayTag_InvincibleGEXRequiem();
	void InactiveContinuedAccompany();
	void ActiveContinuedAccompany();
	void OnBlocking(const struct FVector& BlockingLocation, bool Reflect, bool bIsPairAttack, bool bImpulseDamage, class AActor* DamageOwner, bool bSeparateStandAttack);
	void CheckBlockingValid(class AActor* DamageActor, bool* bBlockingValid);
	void CheckBlockingComponent(class UPrimitiveComponent* Component, bool* bBlockingComponent);
	void IgnoreGivePassive(class UPrimitiveComponent* Component, bool* bIgnore);
	void BlockPenetrate(class AActor* CauserActor, bool* bBlock);
	void ReceiveBeginPlay();
	void PressedButton_Ultimate();
	void ReleasedButton_ActiveSpecial();
	void PressedButton_ActiveSpecial();
	void PressedButton_ActiveBase();
	void ReleasedButton_Basic();
	void PressedButton_Basic();
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	void UserConstructionScript();
	void SkillInactivated(class UBP_AJBSkillBase_C* InactivatedSkill);
	void CanEmote(struct FGameplayTagContainer* FailureFactor, struct FGameplayTagContainer* FailureSkills, bool* bCanEmote);
	void CheckAnySkillActiveOnTiltOneDash(bool* bAnySkillActive);
	void CheckSidlingOnTiltOnce(bool* bSidling);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBInGameCharacter_GRN_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBInGameCharacter_GRN_C")
	}
	static class ABP_AJBInGameCharacter_GRN_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBInGameCharacter_GRN_C>();
	}
};
DUMPER7_ASSERTS_ABP_AJBInGameCharacter_GRN_C;

SDK_NAMESPACE_END
