#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBAIGionSource

#include "Basic.hpp"

#include "ST_GionInfo_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function BP_AJBAIGionSource.BP_AJBAIGionSource_C.ExecuteUbergraph_BP_AJBAIGionSource
// 0x0020 (0x0020 - 0x0000)
struct BP_AJBAIGionSource_C_ExecuteUbergraph_BP_AJBAIGionSource final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* DestroyingActor)> K2Node_CreateDelegate_OutputDelegate;             // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_DestroyingActor;                // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_AJBAIGionSource_C_ExecuteUbergraph_BP_AJBAIGionSource;

// Function BP_AJBAIGionSource.BP_AJBAIGionSource_C.OnInGameLifeTimeElapsed
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBAIGionSource_C_OnInGameLifeTimeElapsed final
{
public:
	class AActor*                                 DestroyingActor;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_AJBAIGionSource_C_OnInGameLifeTimeElapsed;

// Function BP_AJBAIGionSource.BP_AJBAIGionSource_C.GetFarDistance
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBAIGionSource_C_GetFarDistance final
{
public:
	float                                         Gion_Info_Far_Distance;                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_AJBAIGionSource_C_GetFarDistance;

// Function BP_AJBAIGionSource.BP_AJBAIGionSource_C.GetNearDistance
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBAIGionSource_C_GetNearDistance final
{
public:
	float                                         Gion_Info_Far_Distance;                            // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_AJBAIGionSource_C_GetNearDistance;

// Function BP_AJBAIGionSource.BP_AJBAIGionSource_C.CanActorHear
// 0x0030 (0x0030 - 0x0000)
struct BP_AJBAIGionSource_C_CanActorHear final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x000C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue1;         // 0x0018(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_AI_VectorDiffSq_ReturnValue;              // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_AJBAIGionSource_C_CanActorHear;

// Function BP_AJBAIGionSource.BP_AJBAIGionSource_C.GetAIEventTag
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBAIGionSource_C_GetAIEventTag final
{
public:
	struct FGameplayTag                           Gion_Info_AIEvent_Tag;                             // 0x0000(0x0008)(Parm, OutParm, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_AJBAIGionSource_C_GetAIEventTag;

// Function BP_AJBAIGionSource.BP_AJBAIGionSource_C.IsAIEvent
// 0x0018 (0x0018 - 0x0000)
struct BP_AJBAIGionSource_C_IsAIEvent final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_GetAIEventTag_Gion_Info_AIEvent_Tag;      // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_GameplayTag_ReturnValue;       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_AJBAIGionSource_C_IsAIEvent;

// Function BP_AJBAIGionSource.BP_AJBAIGionSource_C.GetGionOwnerActor
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBAIGionSource_C_GetGionOwnerActor final
{
public:
	class AActor*                                 GionOwnerActor_0;                                  // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_AJBAIGionSource_C_GetGionOwnerActor;

// Function BP_AJBAIGionSource.BP_AJBAIGionSource_C.IsValidObject
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBAIGionSource_C_IsValidObject final
{
public:
	bool                                          bValid_0;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_AJBAIGionSource_C_IsValidObject;

// Function BP_AJBAIGionSource.BP_AJBAIGionSource_C.ActivateObject
// 0x0118 (0x0118 - 0x0000)
struct BP_AJBAIGionSource_C_ActivateObject final
{
public:
	struct FST_GionInfo                           GionInfo_0;                                        // 0x0000(0x0060)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class AActor*                                 GionOwnerActor_0;                                  // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                GionLocation;                                      // 0x0068(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0078(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameCharacter*                    K2Node_DynamicCast_AsAJBIn_Game_Character;         // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsNPC_ReturnValue;                        // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_112[0x2];                                      // 0x0112(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Square_ReturnValue;                       // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_AJBAIGionSource_C_ActivateObject;

// Function BP_AJBAIGionSource.BP_AJBAIGionSource_C.IsOwnerNPC
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBAIGionSource_C_IsOwnerNPC final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_AJBAIGionSource_C_IsOwnerNPC;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
