#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBC30Melee

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "BP_AJBChargeRushSkill_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBC30Melee.BP_AJBC30Melee_C
// 0x01A8 (0x05F8 - 0x0450)
class UBP_AJBC30Melee_C final : public UBP_AJBChargeRushSkill_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBC30Melee_C;                   // 0x0450(0x0008)(Transient, DuplicateTransient)
	struct FRotator                               FixedOwnerRot;                                     // 0x0458(0x000C)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay)
	uint8                                         Pad_464[0x4];                                      // 0x0464(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFindFloorResult                       FixedFloorResult;                                  // 0x0468(0x0098)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, NoDestructor, ContainsInstancedReference, AdvancedDisplay)
	float                                         StopSpeedRate;                                     // 0x0500(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DashAttackSpeed;                                   // 0x0504(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RecoveryData_MaxFlySpeed;                          // 0x0508(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                         Pad_50C[0x4];                                      // 0x050C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameParticleEffect_C*          ChargeRushLv0Particle;                             // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class ABP_AJBInGameParticleEffect_C*          ChargeRushLv1Particle;                             // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class ABP_AJBInGameParticleEffect_C*          ChargeRushLv2Particle;                             // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class UAnimMontage*                           RushLv0Right;                                      // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           RushLv0Left;                                       // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           RushLv1;                                           // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           RushLv2;                                           // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           ChargeLv0;                                         // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           ChargeLv1;                                         // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           ChargeLv2;                                         // 0x0558(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ResistRatePhase1;                                  // 0x0560(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ResistRatePhase2;                                  // 0x0564(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ResistRatePhase3;                                  // 0x0568(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ResistTime;                                        // 0x056C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LaunchKnockbackConstant;                           // 0x0570(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AttackRange_cm__Lv0;                               // 0x057C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AttackRange_cm__Lv1;                               // 0x0580(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AttackRange_cm__Lv2;                               // 0x0584(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ResistPassiveTag;                                  // 0x0588(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         KnockbackIntensity_Lv0;                            // 0x0590(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         KnockbackIntensity_Lv1;                            // 0x0594(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         KnockbackIntensity_Lv2;                            // 0x0598(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         KnockbackIntensity_Lv0ForStand;                    // 0x059C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         KnockbackIntensity_Lv1ForStand;                    // 0x05A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         KnockbackIntensity_Lv2ForStand;                    // 0x05A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Keep_RepeatCount;                                  // 0x05A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                          Keep_Redash;                                       // 0x05A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay)
	uint8                                         Pad_5AA[0x2];                                      // 0x05AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Damage_Lv0;                                        // 0x05AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Damage_Lv1;                                        // 0x05B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Damage_Lv2;                                        // 0x05B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AttackCollisionRadius_Lv0;                         // 0x05B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AttackCollisionRadius_Lv1;                         // 0x05BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AttackCollisionRadius_Lv2;                         // 0x05C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ConsumptionMP_Lv0;                                 // 0x05C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HealValue;                                         // 0x05C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GiveFzConditionValue;                              // 0x05CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Damage_FzStyle;                                    // 0x05D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HealRate;                                          // 0x05D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldTraceTimingMeshUpdate;                      // 0x05D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D9[0x3];                                      // 0x05D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TotalDashTime;                                     // 0x05DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MeshUpdateTime;                                    // 0x05E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E4[0x4];                                      // 0x05E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 DamageDecalClassVpStyle;                           // 0x05E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 DamageDecalClassFzStyle;                           // 0x05F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBC30Melee(int32 EntryPoint);
	void ROS_Replicate_FixedStats_C29Melee(int32 ChargeLevel, const struct FRotator& OwnerRot);
	void MC_Replicate_FixedStats_C29Melee(int32 ChargeLevel, const struct FRotator& OwnerRot);
	void Replicate_FixedStats_C30Melee_Local(int32 ChargeLevel, const struct FRotator& OwnerRot);
	void Replicate_FixedStates();
	void FixChargeState_Local();
	void Stop_ChargeRushLv0Anim();
	void Play_ChargeRushLv0Anim();
	void Stop_ChargeRushLv0Effect();
	void Stop_RushEffect();
	void Play_ChargeRushLv0Effect();
	void Play_RushEffect();
	void Stop_ChargeRushLv0Particle();
	void Play_ChargeRushLv0Particle();
	void OnCompleted_7DDD297442D7CC4375E0C99BF0CC73E7(class FName NotifyName);
	void OnBlendOut_7DDD297442D7CC4375E0C99BF0CC73E7(class FName NotifyName);
	void OnInterrupted_7DDD297442D7CC4375E0C99BF0CC73E7(class FName NotifyName);
	void OnNotifyBegin_7DDD297442D7CC4375E0C99BF0CC73E7(class FName NotifyName);
	void OnNotifyEnd_7DDD297442D7CC4375E0C99BF0CC73E7(class FName NotifyName);
	void SetDamageDestinationActor(class AActor* DestinationActor);
	void BeginState_Charging_Local();
	void GetFixedOwnerRot(bool* IsFixed_0, struct FRotator* OwnerRot);
	void UpdateHitPoint();
	void IsRightRush(bool* IsRightRush_0);
	void GetKnockbackBasePower(class AActor* TargetActor_0, float* BasePower);
	void GetMontageRushLv0(class UAnimMontage** RushLv0Montage);
	void GetPreDashTime(float* PreDashTime);
	void GetGiveFzConditionValue(float* Value);
	void GetRushParticleTag(struct FGameplayTag* ParticleTag);
	void GetRushSETag(struct FGameplayTag* SETag);
	void OnEndState(bool bCancel, bool bRestore);
	void PlayBackAnimation();
	void OnHit(class AActor* HitActor, class UActorComponent* HitComponent, const struct FVector& HitLocation, const struct FVector& HitNormal, float CuttingRate, EPhysicalSurface SurfaceType, bool bDisableDamage, bool bInvincible, bool bIsPenetration, bool bAvoidSkill);
	void OnDash(uint8 RepeatCount_0, bool bRedash);
	void PlaySkillEndAnimation();
	void PlaySkillBeginAnimation();
	void HitWait(class AActor* HitActor, class UActorComponent* HitComponent, const struct FVector& HitLocation, const struct FVector& HitNormal, float CuttingRate, EPhysicalSurface SurfaceType, bool bDisableDamage, bool bInvincible, bool bIsPenetration, bool bBlockedByAAP, bool bHeadShot, bool bAvoidSkill);
	void StateTick(float DeltaSeconds);
	void Update_Dash(float DeltaSeconds);
	void SpeakRushVoice();
	void TryGetDamageActor(class ABP_AJBDamageActor_C** DamageActor_0);
	void DashToTarget(float Speed, float DeltaSeconds, bool* bReached);
	void PlayHitSE(class AActor* HitActor, const struct FVector& HitLocation, EPhysicalSurface SurfaceType, bool bBlockedByAAP, bool bHeadShot);
	void PlayRushSE(class USceneComponent* AttachComponent);
	void GetPoliticDamage(bool bHeadShot, bool OnSpawnDamageActor, int32* Damage_0);
	void DecideTarget(class AActor** TargetActor_0, class UActorComponent** TargetComponent_0, struct FVector* TargetHitLocation_0, struct FVector* TargetLocation_0);
	void GetLaunchedActorTarget(class AActor** LauncedActor);
	void GetPoliticAttackRange(float* AttackRange_cm__0);
	void SpawnDamageDecal(const struct FVector& Location);
	void GenerateHitEffect(class AActor* HitActor, const struct FVector& HitLocation, const struct FVector& HitNomal, const struct FRotator& HitRotation, const struct FGameplayTag& DamageType, bool HeadShot, EPhysicalSurface SurfaceType, bool BlockedbyAAP, bool GenerateSufaceParticle, bool UseSurfaceParticleLighter);
	void GetPoliticAttackCollisionRadius(float* AttackCollisionRadius_0);
	float GetSkillAttackRange();
	void ReceiveBeginPlay();
	void OnActive();
	void InitializeVariables();
	void GetPoliticConsumptionMP(float* ConsumptionMP_0);
	void GetDuration(float* Duration);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBC30Melee_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBC30Melee_C")
	}
	static class UBP_AJBC30Melee_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBC30Melee_C>();
	}
};
DUMPER7_ASSERTS_UBP_AJBC30Melee_C;

SDK_NAMESPACE_END
