#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBCollectMdEmphasizeActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_AJBEmphasizeActorBase_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBCollectMdEmphasizeActor.BP_AJBCollectMdEmphasizeActor_C
// 0x0030 (0x0388 - 0x0358)
class ABP_AJBCollectMdEmphasizeActor_C final : public ABP_AJBEmphasizeActorBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBCollectMdEmphasizeActor_C;    // 0x0358(0x0008)(Transient, DuplicateTransient)
	class UTextRenderComponent*                   TextRender1;                                       // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow;                                             // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   TextRender;                                        // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameParticleEffect_C*          EmphasisParticlePillar;                            // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDebugShowCollectMdInfo;                           // 0x0380(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_AJBCollectMdEmphasizeActor(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void TrySpawnParticle();
	void ChangeParticleDilationEnable(bool bEnable);
	void TryDestroyParticle();
	void ChangeVisibility(bool bNewVisibility);
	void UserConstructionScript();
	void CheckEffectActivate(bool* bActivate);
	void SetInfoText(const class FText& Title, class UTextRenderComponent* TextRender_0, class ABP_AJBInGameParticleEffect_C* Particle);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBCollectMdEmphasizeActor_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBCollectMdEmphasizeActor_C")
	}
	static class ABP_AJBCollectMdEmphasizeActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBCollectMdEmphasizeActor_C>();
	}
};
DUMPER7_ASSERTS_ABP_AJBCollectMdEmphasizeActor_C;

SDK_NAMESPACE_END
