#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBReadiness

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "BP_AJBPassiveSkillBase_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBReadiness.BP_AJBReadiness_C
// 0x0030 (0x0248 - 0x0218)
class UBP_AJBReadiness_C final : public UBP_AJBPassiveSkillBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBReadiness_C;                  // 0x0218(0x0008)(Transient, DuplicateTransient)
	float                                         HealingMPSpeedScale;                               // 0x0220(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Defence___;                                        // 0x0224(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           EndParticleTag;                                    // 0x0228(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         CloseRangeAttackRangeScale;                        // 0x0230(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           FinishedPassiveSETag;                              // 0x0238(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         DurabilityLeftHP;                                  // 0x0240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         KnockbackRate;                                     // 0x0244(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBReadiness(int32 EntryPoint);
	void ActiveReadinessUI();
	void SpawnEndEffect();
	void ChangeReadinessStatus(bool bEnable);
	void ReceiveBeginPlay();
	void OnContinuedParticleActivated();
	void OnActionInactivate(bool bTriggeredByStand);
	void OnActionActivate(bool bTriggeredByStand);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBReadiness_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBReadiness_C")
	}
	static class UBP_AJBReadiness_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBReadiness_C>();
	}
};
DUMPER7_ASSERTS_UBP_AJBReadiness_C;

SDK_NAMESPACE_END
