#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBRondoSkill

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_AJBAllPlayerAffectedSkill_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBRondoSkill.BP_AJBRondoSkill_C
// 0x0078 (0x0280 - 0x0208)
class UBP_AJBRondoSkill_C final : public UBP_AJBAllPlayerAffectedSkill_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBRondoSkill_C;                 // 0x0208(0x0008)(Transient, DuplicateTransient)
	bool                                          bReserveAction;                                    // 0x0210(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_211[0x7];                                      // 0x0211(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBPreviewBase_C*                   PreviewObject;                                     // 0x0218(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ActionLocation;                                    // 0x0220(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TraceForwardDistance;                              // 0x022C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      TraceObjectTypes;                                  // 0x0230(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class AActor*>                         TraceActorsToIgnore;                               // 0x0240(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	float                                         ToUnderDistance;                                   // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReadyTime;                                         // 0x0254(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PreFallingTime;                                    // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ActionTime;                                        // 0x025C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ForceFinishTime;                                   // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ClearingTime;                                      // 0x0264(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           AM_Ready;                                          // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           AM_Clearing;                                       // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBDamageAffecterBase_C*            Affecter;                                          // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBRondoSkill(int32 EntryPoint);
	void MC_OnActive(bool bPossibleAction);
	void DestroyPreviewObjectLocal();
	void SpawnPreviewObjectLocal();
	void OnBeginStatePreFalling();
	void OnBeginStatePreFalling_OneShot();
	void TickStatePreFalling();
	void MC_BeginStatePreFalling();
	void ROS_BeginStatePreFalling();
	void BeginStatePreFalling();
	void OnBeginStateForceFinish();
	void TickStateForceFinish();
	void OnBeginStateForceFinish_OneShot();
	void MC_BeginStateForceFinish();
	void ROS_BeginStateForceFinish();
	void BeginStateForceFinish();
	void EndProcess();
	void TickStateClearing();
	void OnBeginStateClearing_OneShot();
	void OnBeginStateClearing();
	void MC_BeginStateClearing();
	void ROS_BeginStateClearing();
	void BeginStateClearing();
	void TickStateAction();
	void OnBeginStateAction_OneShot();
	void OnBeginStateAction();
	void MC_BeginStateAction();
	void ROS_BeginStateAction();
	void BeginStateAction();
	void TickStateReady();
	void StateTick();
	void MC_BeginStateReady(const struct FVector& ActionLocation_0);
	void ROS_BeginStateReady(const struct FVector& ActionLocation_0);
	void OnStateEnd_OneShot();
	void MC_StateEnd();
	void ROS_StateEnd();
	void OnStateEnd(bool bCancel);
	void StateEnd();
	void TickStatePreview();
	void OnStatePreview();
	void OnBeginStateReady_OneShot(const struct FVector& ActionLocation_0);
	void OnBeginStateReady(const struct FVector& ActionLocation_0);
	void BeginStateReady();
	void OnCompleted_7DDD297442D7CC4375E0C99B6E8F6ADF(class FName NotifyName);
	void OnBlendOut_7DDD297442D7CC4375E0C99B6E8F6ADF(class FName NotifyName);
	void OnInterrupted_7DDD297442D7CC4375E0C99B6E8F6ADF(class FName NotifyName);
	void OnNotifyBegin_7DDD297442D7CC4375E0C99B6E8F6ADF(class FName NotifyName);
	void OnNotifyEnd_7DDD297442D7CC4375E0C99B6E8F6ADF(class FName NotifyName);
	void OnCompleted_7DDD297442D7CC4375E0C99BBD4350B1(class FName NotifyName);
	void OnBlendOut_7DDD297442D7CC4375E0C99BBD4350B1(class FName NotifyName);
	void OnInterrupted_7DDD297442D7CC4375E0C99BBD4350B1(class FName NotifyName);
	void OnNotifyBegin_7DDD297442D7CC4375E0C99BBD4350B1(class FName NotifyName);
	void OnNotifyEnd_7DDD297442D7CC4375E0C99BBD4350B1(class FName NotifyName);
	void TryDestroyPreviewObject();
	void TrySpawnPreviewObject();
	void UpdateActionInfo();
	void ChangeInvincibleStatus(bool bEnable);
	void TryStopMontage();
	void OnDisconnected();
	void OnCancel();
	void OnActive();
	void ReceiveTick(float DeltaSeconds);
	void OnInactive();
	void OnReady();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBRondoSkill_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBRondoSkill_C")
	}
	static class UBP_AJBRondoSkill_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBRondoSkill_C>();
	}
};
DUMPER7_ASSERTS_UBP_AJBRondoSkill_C;

SDK_NAMESPACE_END
