#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBAIGionSource

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ST_GionInfo_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBAIGionSource.BP_AJBAIGionSource_C
// 0x00A8 (0x03D0 - 0x0328)
class ABP_AJBAIGionSource_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(Transient, DuplicateTransient)
	class UBP_AJBInGameLifeTime_C*                BP_AJBInGameLifeTime;                              // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FST_GionInfo                           GionInfo;                                          // 0x0340(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class AActor*                                 GionOwnerActor;                                    // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bValid;                                            // 0x03A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A9[0x7];                                      // 0x03A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnLifeTimeElapsed;                                 // 0x03B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bIsOwnerNPC;                                       // 0x03C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C1[0x3];                                      // 0x03C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LifeTimeTickInterval;                              // 0x03C4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FarDistanceSq;                                     // 0x03C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBAIGionSource(int32 EntryPoint);
	void ReceiveBeginPlay();
	void OnInGameLifeTimeElapsed(class AActor* DestroyingActor);
	void UserConstructionScript();
	void GetFarDistance(float* Gion_Info_Far_Distance);
	void GetNearDistance(float* Gion_Info_Far_Distance);
	bool CanActorHear(class AActor* Actor);
	void GetAIEventTag(struct FGameplayTag* Gion_Info_AIEvent_Tag);
	bool IsAIEvent();
	void GetGionOwnerActor(class AActor** GionOwnerActor_0);
	void DeactivateObject();
	void IsValidObject(bool* bValid_0);
	void ActivateObject(const struct FST_GionInfo& GionInfo_0, class AActor* GionOwnerActor_0, const struct FVector& GionLocation);
	bool IsOwnerNPC();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBAIGionSource_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBAIGionSource_C")
	}
	static class ABP_AJBAIGionSource_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBAIGionSource_C>();
	}
};
DUMPER7_ASSERTS_ABP_AJBAIGionSource_C;

SDK_NAMESPACE_END
