#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameMovableStand_SXP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_AJBInGameMovableStand_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "AJB_structs.hpp"
#include "E_StencilDigit_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AkAudio_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBInGameMovableStand_SXP.BP_AJBInGameMovableStand_SXP_C
// 0x0100 (0x1050 - 0x0F50)
class ABP_AJBInGameMovableStand_SXP_C final : public ABP_AJBInGameMovableStand_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBInGameMovableStand_SXP_C;     // 0x0F48(0x0008)(Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 SK_Bullet;                                         // 0x0F50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        PS_LoiteringPoint;                                 // 0x0F58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         LoiteringTime;                                     // 0x0F60(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         KickingTime;                                       // 0x0F64(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WaitingTime;                                       // 0x0F68(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMovableStandSXPState                         SXPState;                                          // 0x0F6C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F6D[0x3];                                      // 0x0F6D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StateTime;                                         // 0x0F70(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpringArmLengthDeafult;                            // 0x0F74(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpringArmLengthOnKicking;                          // 0x0F78(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowLeftTime;                                     // 0x0F7C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F7D[0x3];                                      // 0x0F7D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBDamageAffecterBase_C*            Affecter;                                          // 0x0F80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           SkillTag;                                          // 0x0F88(0x0008)(Edit, BlueprintVisible, Net, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           EffectLoiteringTag;                                // 0x0F90(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           EffectHitTag;                                      // 0x0F98(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           SELoiteringTag;                                    // 0x0FA0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           SEHitTag;                                          // 0x0FA8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GionHitTag;                                        // 0x0FB0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnableHeadShot;                                   // 0x0FB8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FB9[0x3];                                      // 0x0FB9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Rep_HP;                                            // 0x0FBC(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HPMax;                                             // 0x0FC0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FC4[0x4];                                      // 0x0FC4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           AM_Lotering;                                       // 0x0FC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           AM_Kicking;                                        // 0x0FD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnStateChanged;                                    // 0x0FD8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UAkComponent*                           LoiteringSE;                                       // 0x0FE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameParticleEffect_C*          PS_Loitering;                                      // 0x0FF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMovableStandSXPState                         TempSXPState;                                      // 0x0FF8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FF9[0x3];                                      // 0x0FF9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         HitDamage;                                         // 0x0FFC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HitDamageOnHeadShot;                               // 0x1000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HeadShotTraceLength;                               // 0x1004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AccelThreshould;                                   // 0x1008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_100C[0x4];                                     // 0x100C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnMaxSpeedChanged;                                 // 0x1010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UAkComponent*                           HitSE;                                             // 0x1020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMovableSXPFlyingState                        SXPFlyingState;                                    // 0x1028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMovableSXPFlyingState                        _ForSkipOwner_SXPFlyingState;                      // 0x1029(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_102A[0x2];                                     // 0x102A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SerialNumber;                                      // 0x102C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMovableStandSXPState                         Rep_SXPState;                                      // 0x1030(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1031[0x3];                                     // 0x1031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BrakingDecalerationFlyingOnSpecialBreakDown;       // 0x1034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FirstLocation;                                     // 0x1038(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBInGameMovableStand_SXP(int32 EntryPoint);
	void OnCharacterActiveBehaviorChanged(class AAJBInGameCharacter* TargetCharacter, ECharacterActiveBehavior OldBehavior, ECharacterActiveBehavior NextBehavior, bool bSpecialBreakDown);
	void ROS_OnDamageOverlap(class AActor* HitActor, const struct FVector& Location);
	void OnDamageOverlap(class AActor* HitActor, const struct FVector& HitLocation);
	void OnSetViewTargetToNewSpectator();
	void StateBeginPlay();
	void OnBeginState_Waiting(EMovableStandSXPState PrevState);
	void OnBeginState_Kicking(EMovableStandSXPState PrevState);
	void OnBeginState_Loitering(EMovableStandSXPState PrevState);
	void OnBeginState_None(EMovableStandSXPState PrevState);
	void MovableStandSetup();
	void StopSpecialBreakDownAnimation();
	void PlaySpecialBreakDownAnimation();
	void GenerateEffects(const struct FVector& Location, class AActor* HitActor, bool bHeadShot, float CuttingRate, bool bDisableDamage, bool bBlockedByAAP);
	void ReceiveDestroyed();
	void OnDisappear();
	void OnChangeFlyingState(EMovableSXPFlyingState NewState);
	void ROS_ChangeFlyingState(EMovableSXPFlyingState NewState);
	void ChangeFlyingState(EMovableSXPFlyingState NewState);
	void ReceiveTheWorld(float Time, bool bEnable, bool bOperatorIsEmpty);
	void OnRep_AppearanceTransition();
	void ChangeStateCore(EMovableStandSXPState PrevState, EMovableStandSXPState NextState);
	void OnChangeState(EMovableStandSXPState PrevState, EMovableStandSXPState NextState);
	void ChangeState_Local(EMovableStandSXPState NextState);
	void OnMC_ChangeState(EMovableStandSXPState PrevState, EMovableStandSXPState NextState);
	void OnROS_ChangeState(EMovableStandSXPState PrevState, EMovableStandSXPState NextState);
	void MC_ChangeState(EMovableStandSXPState PrevState, EMovableStandSXPState NextState);
	void ROS_ChangeState(EMovableStandSXPState PrevState, EMovableStandSXPState NextState);
	void OnPressedR2();
	void MC_OnHitRodeoShot(const struct FVector& HitLocation, class AActor* HitActor, bool bHeadShot, float CuttingRate, bool bDisableDamage, bool bBlockedByAAP);
	void ROS_OnHitRodeoShot(const struct FVector& HitLocation, class AActor* HitActor, bool bHeadShot, float CuttingRate, bool bDisableDamage, bool bBlockedByAAP);
	void BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnHitRodeoShot(const struct FVector& HitLocation, class AActor* HitActor, bool bHeadShot, float CuttingRate, bool bDisableDamage);
	void MC_SpawnDamageDisplay(const struct FAJBDamageDisplayParams& DisplayParams, const struct FAJBDamageDisplayProperty& DisplayProperty);
	void MC_OnBlocking(class AActor* BlockedActor, const struct FVector& HitLocation, bool bReflect, bool bSeparateStandAttack);
	void ROS_OnBlocking(class AActor* BlockedActor, const struct FVector& HitLocation, bool bReflect, bool bSeparateStandAttack);
	void Blocking(class AActor* BlockedActor, class AActor* OtherActor, const struct FVector& HitLocation, const struct FVector& HitNormal, int32 CuttingProjectile___, int32 CuttingOther___, bool bInvincible, bool bReflectProjectile, const struct FRotator& ReflectRotation, bool bAvoidSkill, bool bSeparateStandAttack, const struct FGameplayTag& ReflectSkillTag, const struct FVector& KnockbackVelocity, float KnockbackIntensity);
	void ROC_Waiting();
	void OnCompleted_4766B3DE4E785B5E56887793DC497D70(class FName NotifyName);
	void OnBlendOut_4766B3DE4E785B5E56887793DC497D70(class FName NotifyName);
	void OnInterrupted_4766B3DE4E785B5E56887793DC497D70(class FName NotifyName);
	void OnNotifyBegin_4766B3DE4E785B5E56887793DC497D70(class FName NotifyName);
	void OnNotifyEnd_4766B3DE4E785B5E56887793DC497D70(class FName NotifyName);
	void Ignition_Local();
	void InitializeStatus();
	void ConsumeDamage(int32 Damage);
	void Waiting_Local();
	void DebugPrintLeftTime();
	void ChangeEnableMovement(bool bEnable);
	void ChangeEnableBullletVisibility(bool bEnable);
	void ChangeEnableEffect(bool bEnable);
	void ResetSpringArmLength();
	void SetSpringArmLength(float Length);
	void SkillSettings(const struct FGameplayTag& InSkillTag, class USkeletalMesh* InMesh, class UAnimMontage* InAM_Loitering, class UAnimMontage* InAM_Kicking, const struct FGameplayTag& InEffectLoiteringTag, const struct FGameplayTag& InEffectHitTag, const struct FGameplayTag& InSELoiteringTag, const struct FGameplayTag& InSEHitTag, const struct FGameplayTag& InGionHitTag, bool bInEnableHeadShot, int32 InMaxHP, float InMaxSpeedOnAccel, float InMaxSpeedDefault, float InMaxSpeedOnDeaccel, float InLoiteringTime, float InKickingTime, float InWaitingTime, int32 InHitDamage, int32 InHitDamageOnHeadShot, float InHeadShotTraceLength, int32 InSerialNumber, class UAnimMontage* InAM_SpecialBreakDown);
	void ClearingLoiteringState();
	void GetPoliticDamage(bool bHeadShot, int32* Damage);
	void OnRep__ForSkipOwner_SXPFlyingState();
	void ChangeSXPFlyingState(EMovableSXPFlyingState SXPFlyingState_0);
	void EndState_Local();
	void ClearingWaitingState(bool bFromLoitering);
	void TryDestroyAffecter();
	void ChangeSXPState(EMovableStandSXPState NewSXPState);
	void RestoreSkillSettings();
	void UpdateTransform();
	void CheckIgnoreBlocking(class AActor* TargetActor, bool* bIgnore);
	void CheckPassiveOnly(bool* bIsPassiveOnly);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void UpdateCameraInput();
	void AJBDamage(class AActor* DamagedActor, int32 DamageForHPAP, int32 DamageForAAP, int32 CutDamage, const struct FGameplayTag& DamageType, int32 SerialNumber_0, EDamagePriority DamagePriority, float AttackDistance, class AActor* DamageCauser, bool WithSeparatedStandAttack, bool HitEnemysSeparatedStand, bool bPenetrateAP, bool bNotUseCollision, bool IsEndured, const struct FAJBDamageDisplayParams& DamageDisplayParams, const struct FAJBDamageDisplayProperty& DamageDisplayProperty);
	void UserConstructionScript();
	void GetCollisionProfileName(class FName* ProfileName);
	void UpdateMovementForwardInput(float Value, struct FVector* WorldDirection, float* ScaleValue);
	void ChangeStandMovementMode(bool bEnable);
	void OnBeforeInteract();
	void UpdateMaterials();
	void CheckChangeableSpeed(bool* bChangeable);
	void GetPrimitivesToChangeStencil(E_StencilDigit StencilDigit, TArray<class UPrimitiveComponent*>* PrimitiveComponents);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBInGameMovableStand_SXP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBInGameMovableStand_SXP_C")
	}
	static class ABP_AJBInGameMovableStand_SXP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBInGameMovableStand_SXP_C>();
	}
};
DUMPER7_ASSERTS_ABP_AJBInGameMovableStand_SXP_C;

SDK_NAMESPACE_END
