#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBCrimsonDimensionSkill

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_AJBAllPlayerAffectedSkill_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBCrimsonDimensionSkill.BP_AJBCrimsonDimensionSkill_C
// 0x0040 (0x0248 - 0x0208)
class UBP_AJBCrimsonDimensionSkill_C final : public UBP_AJBAllPlayerAffectedSkill_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBCrimsonDimensionSkill_C;      // 0x0208(0x0008)(Transient, DuplicateTransient)
	float                                         StateTimeAction;                                   // 0x0210(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_214[0x4];                                      // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           StandMontageAction;                                // 0x0218(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                         LockSkillClassList;                                // 0x0220(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	struct FTimerHandle                           TimerHandleAffecterActivate;                       // 0x0230(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	float                                         DImensionDistance;                                 // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpeedDownScaleNotOwnerEnv;                         // 0x023C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CharacterMoveSpeedScaleByStandNotOwnerEnv;         // 0x0240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBCrimsonDimensionSkill(int32 EntryPoint);
	void EndSkillUI();
	void StartSkillUI();
	void DuringAffecterActivate();
	void OnSkillEffectiveTimeDetermined(const struct FGameplayTag& SkillTag_0, float EffectiveTimeSec, bool bUpdateEvenIfNotInGameplay, bool bOverwrite);
	void OnSkillSucceeded_Local(const struct FGameplayTag& SkillTag_0);
	void MC_OnActive(bool bPossibleAction);
	void EndState();
	void StateBeginAction();
	void StateTickAction();
	void StateTick();
	void OnCompleted_7B45FB9D406D5826C78546BC24CFD738(class FName NotifyName);
	void OnBlendOut_7B45FB9D406D5826C78546BC24CFD738(class FName NotifyName);
	void OnInterrupted_7B45FB9D406D5826C78546BC24CFD738(class FName NotifyName);
	void OnNotifyBegin_7B45FB9D406D5826C78546BC24CFD738(class FName NotifyName);
	void OnNotifyEnd_7B45FB9D406D5826C78546BC24CFD738(class FName NotifyName);
	void SpawnSkillAffecterCore(class UClass* AffecterClass, class ABP_AJBSkillAffecterBase_C** SkillAffecterBase);
	void ReceiveBeginPlay();
	void OnCancel();
	void OnActive();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBCrimsonDimensionSkill_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBCrimsonDimensionSkill_C")
	}
	static class UBP_AJBCrimsonDimensionSkill_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBCrimsonDimensionSkill_C>();
	}
};
DUMPER7_ASSERTS_UBP_AJBCrimsonDimensionSkill_C;

SDK_NAMESPACE_END
