#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameCharacter_BCT

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_AJBInGameCharacter_classes.hpp"
#include "AJB_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBInGameCharacter_BCT.BP_AJBInGameCharacter_BCT_C
// 0x0020 (0x1880 - 0x1860)
class ABP_AJBInGameCharacter_BCT_C final : public ABP_AJBInGameCharacter_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBInGameCharacter_BCT_C;        // 0x1858(0x0008)(Transient, DuplicateTransient)
	class UBP_AJBAccompanySFGSkill_C*             BP_AJBAccompanySFGSkill;                           // 0x1860(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBZipRushSkill_C*                  BP_AJBZipRushSkill;                                // 0x1868(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBStickyDiveSkill_C*               BP_AJBStickyDiveSkill;                             // 0x1870(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBZipperSkill_C*                   BP_AJBZipperSkill;                                 // 0x1878(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBInGameCharacter_BCT(int32 EntryPoint);
	void ChangeStealth(bool bEnable);
	void ReleasedButton_ActiveSpecial();
	void PressedButton_ActiveSpecial();
	void PressedButton_ActiveBase();
	void PressedButton_Ultimate();
	void ReleasedButton_Basic();
	void PressedButton_Basic();
	void OnReleasedInteract();
	void OnReleasedCrouch();
	void OnPressedCrouch();
	void OnPressedJump();
	void OnReleasedJump();
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	void UserConstructionScript();
	void EndCondition(const struct FGameplayTag& Condition);
	void BeginCondition(const struct FGameplayTag& Condition, class UObject* Causer, bool bTriggeredByStand, const struct FGameplayTag& CauserType, int32 SerialNumber, class UObject* PropagationSource);
	void GetGenerateParticleLocation(struct FVector* Location);
	void OnBeforeInteract(bool* bShouldInteract);
	void OnCharacterActive();
	void ShouldRecordHistoryReplayServer(bool* bShouldRecord);
	void IgnoreAttackHitNotifyOnAreaIn(bool* bIgnore);
	void GetTargetLocation(struct FVector* Location);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBInGameCharacter_BCT_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBInGameCharacter_BCT_C")
	}
	static class ABP_AJBInGameCharacter_BCT_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBInGameCharacter_BCT_C>();
	}
};
DUMPER7_ASSERTS_ABP_AJBInGameCharacter_BCT_C;

SDK_NAMESPACE_END
