#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameSceneCamera

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBInGameSceneCamera.BP_AJBInGameSceneCamera_C
// 0x0068 (0x0390 - 0x0328)
#pragma pack(push, 0x1)
class SDK_ALIGN(0x08) ABP_AJBInGameSceneCamera_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(Transient, DuplicateTransient)
	class UCameraComponent*                       Camera;                                            // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FVector                                StartLocation;                                     // 0x0340(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               StartRotation;                                     // 0x034C(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                EndLocation;                                       // 0x0358(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               EndRotation;                                       // 0x0364(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class AAJBInGameCharacterBase*                CurrentTargetCharacterBase;                        // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CurrentStartTargetSocketName;                      // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CurrentEndTargetSocketName;                        // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLookAtTarget;                                     // 0x0388(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_AJBInGameSceneCamera(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void UserConstructionScript();
	void GetDegreeFromIndex_OneWay(int32 PriorityIndex, float IntervalDegree, float* Degree);
	void GetDegreeFromIndex_TickTack(int32 PriorityIndex, float FirstIntervalDegree, float LaterIntervalDegree_, float* Degree);
	void SearchProperLocationAndRotation(class AAJBInGameCharacterBase* TargetCharacterBase, class FName StartTargetSocketName, class FName EndTargetSocketName, bool* bFound, struct FVector* StartLocation_0, struct FRotator* StartRotation_0, struct FVector* EndLocation_0, struct FRotator* EndRotation_0);
	void PreprocessToDeterminePath(class AAJBInGameCharacterBase* TargetCharacterBase, class FName StartTargetSocketName, class FName EndTargetSocketName, bool* bDetermined);
	void Move(float Rate);
	void GetEndLocation(struct FVector* EndLocation_0);
	void GetStartLocation(struct FVector* StartLocation_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBInGameSceneCamera_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBInGameSceneCamera_C")
	}
	static class ABP_AJBInGameSceneCamera_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBInGameSceneCamera_C>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_ABP_AJBInGameSceneCamera_C;

SDK_NAMESPACE_END
