#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameCharacter_KIR

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_AJBInGameCharacter_classes.hpp"
#include "AJB_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBInGameCharacter_KIR.BP_AJBInGameCharacter_KIR_C
// 0x0030 (0x1890 - 0x1860)
class ABP_AJBInGameCharacter_KIR_C final : public ABP_AJBInGameCharacter_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBInGameCharacter_KIR_C;        // 0x1858(0x0008)(Transient, DuplicateTransient)
	class UBP_AJBKIRSupport_C*                    BP_AJBKIRSupport;                                  // 0x1860(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBSHASkill_C*                      BP_AJBSHASkill;                                    // 0x1868(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBFirstBombSkill_C*                BP_AJBFirstBombSkill;                              // 0x1870(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBKillerRushSkill_C*               BP_AJBKillerRushSkill;                             // 0x1878(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBAccompanyKLQSkill_C*             BP_AJBAccompanyKLQSkill;                           // 0x1880(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_SHA_C*           SHA;                                               // 0x1888(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBInGameCharacter_KIR(int32 EntryPoint);
	void MC_RegisterSHA();
	void UnregisterSHA_Server();
	void RegisterSHA_Server(class ABP_AJBInGameCharacter_C* InSHA);
	void OnSpecialNPCSpawned(class ABP_AJBInGameCharacter_C* Character, const struct FGameplayTag& SpecialTag);
	void TryAddPassive_Server(const struct FGameplayTag& PassiveTag, const struct FGameplayTag& CauserType);
	void TryRemovePassive_Server(const struct FGameplayTag& PassiveTag);
	void ChangeSHASkillLock(bool LockEnable);
	void CheckDuringInjectionSHA(bool* bDuringInjectionSHA);
	void OnRep_SHA();
	void GetDummyShotLocation(struct FVector* Location);
	void ShouldShowNGPoint(bool* bResult);
	void GetShutTraceRadius(float* Radius);
	void GetShotLocation(bool bConsiderCharacterCapsuleRadius, const struct FGameplayTag& SkillTag, TArray<struct FVector>* Locations);
	void CheckLocallyControlled(bool* bLocallyControlled);
	void CheckTransfer(bool* bTransfer);
	void CheckExistPropertyStand(bool* bExist);
	void GetPropertyStand(class ABP_AJBInGameCharacter_C** PropertyStandBP);
	void CharacterSetup();
	void ReleasedButton_Ultimate();
	void PressedButton_Ultimate();
	void ReleasedButton_ActiveSpecial();
	void PressedButton_ActiveSpecial();
	void PressedButton_ActiveBase();
	void ReleasedButton_Basic();
	void PressedButton_Basic();
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	void UserConstructionScript();
	void OnBeforeInteract(bool* bShouldInteract);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBInGameCharacter_KIR_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBInGameCharacter_KIR_C")
	}
	static class ABP_AJBInGameCharacter_KIR_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBInGameCharacter_KIR_C>();
	}
};
DUMPER7_ASSERTS_ABP_AJBInGameCharacter_KIR_C;

SDK_NAMESPACE_END
