#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameCharacter_DDW

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_AJBInGameCharacter_classes.hpp"
#include "AJB_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBInGameCharacter_DDW.BP_AJBInGameCharacter_DDW_C
// 0x0040 (0x18A0 - 0x1860)
class ABP_AJBInGameCharacter_DDW_C final : public ABP_AJBInGameCharacter_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBInGameCharacter_DDW_C;        // 0x1858(0x0008)(Transient, DuplicateTransient)
	class UBP_AJBWallClimb_C*                     BP_AJBWallClimb;                                   // 0x1860(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameParticleEffect_C*          ParticlePreview;                                   // 0x1868(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxStepHeightDefault;                              // 0x1870(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxStepHeightIndoor;                               // 0x1874(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WalkableFloorAngleDefault;                         // 0x1878(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WalkableFloorAngleIndoor;                          // 0x187C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MeshLocationOffset;                                // 0x1880(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShowPreviewParticleOnPairEnv;                     // 0x1884(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1885[0x3];                                     // 0x1885(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameParticleEffect_C*          ParticlePreviewNG;                                 // 0x1888(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EMovementMode                                 MovementModeBeforeTimeStop;                        // 0x1890(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRepShouldShowPreviewParticle;                     // 0x1891(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bRepEnable;                                        // 0x1892(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	bool                                          bMeshVisible;                                      // 0x1893(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	int32                                         TranslucentSortPriorityPreview;                    // 0x1894(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBInGameCharacter_DDW(int32 EntryPoint);
	void SetupInteract();
	void TryDestroyPreviewParticle();
	void TrySpawnPreviewParticle();
	void ChangeVisual(bool bPossiblePlacement);
	void ChangeMesh(class UStaticMesh* NewStaticMesh);
	void SetSerialNumber(int32 SerialNumber);
	void ChangeEnableServer(bool bEnable);
	void ChangeEnableCore(bool bEnable);
	void SetupPropertyStandInteract();
	void FollowCharacterWhenUnpossessed_OnServer();
	void ChangeEnable(bool bEnable);
	void ChangeMeshVisibleServer(bool bNewVisibility);
	void ChangeMeshVisibleCore(bool bNewVisibility);
	void ROS_AdjustmentLocation(const struct FVector& Location, const struct FRotator& Rotation);
	void SetVisibility(bool NewVisibility);
	void GetCurrentNormal(struct FVector* Normal);
	void GetCurrentRotate(struct FRotator* Rotation);
	void GetCurrentMeshOffset(struct FVector* Offset);
	void ShouldSpawnPreviewParticle(bool* bShouldSpawn);
	void UpdateParameters();
	void CheckWallClimbStateAction(bool* bStateAction);
	void CreateDMIFlow();
	void ChangeParticlesTransform(const struct FTransform& NewTransform);
	void UpdateParticlesVisibility();
	void UpdateParticlesSpawn();
	void OnRep_bRepEnable();
	void OnRep_bMeshVisible();
	void GetPropertyOwnerCharacterBP(class ABP_AJBInGameCharacter_C** CharacterBP);
	void GetPropertyType(EAJBCharacterPropertyType* PropertyType);
	void TracableByAI(bool* bTracable);
	void DetectableByTrap(bool* bDetectable);
	void TreatAsCharacterBySpecialProjectile(bool* bTreat);
	void IsDetectableByDirectAttackGuide(bool* bIsDetectable);
	void IsTargetCO2Scan(bool* IsTarget);
	void IsTargetClourBarrier(bool* IsTarget);
	void IsTargetOverGrow(bool* IsTarget);
	void IsPlayOwnerVoiceOnGetItem(bool* bIsPlay);
	void IsPlayOwnerVoiceOnJump(bool* bIsPlay);
	void IsPlayOwnerVoiceOnPassThruEnter(bool* bIsPlay);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void OnReleasedEmote();
	void OnPressedR2();
	void OnPressedEmote();
	void OnReleasedJump();
	void OnPressedJump();
	void OnReleasedCrouch();
	void OnPressedCrouch();
	void ChangeMovementModeOnTimeStop(bool bEnable, bool bOperatorIsEmpty);
	void OnSpectated_Local();
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	void UserConstructionScript();
	void SetSystemEnable(bool bEnable, bool bCollision, bool bGravity, bool bSpringArm, bool bMovement);
	void ChangeSystemDisable(bool bCollision, bool bGravity, bool bSpringArm, bool bMovement, bool bRestore);
	void ChangeSystemEnable(bool bCollision, bool bGravity, bool bSpringArm, bool bMovement, bool bRestore);
	void ResetSystemEnable(bool bRestore);
	void CheckAnyCharacterMovementSkillActive(bool* bWithCharacterMovement);
	void CheckPossibleDash(bool* bPossible);
	void CheckDisableDamage(class AActor* DamageCauser, bool bIgnoreSelf, bool* bDisableDamage_0);
	void CheckDisablePassive(class AActor* PassiveCauser, const struct FGameplayTag& PassiveTag, bool bIgnoreSelf, bool* bDisablePassive_0);
	void CheckDisableAreaDamage(bool* bDisableAreadamage_0);
	void CheckTargetSelf(class AActor* DamageCauser, bool bForDamageOverlap, bool bIgnoreMovableStand, bool bIncludeSelf, bool bAfterReflectShouldHitOwner, bool* bTarget);
	void InteractableOperator(class AActor* InteractActor, bool* bReturnValue);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBInGameCharacter_DDW_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBInGameCharacter_DDW_C")
	}
	static class ABP_AJBInGameCharacter_DDW_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBInGameCharacter_DDW_C>();
	}
};
DUMPER7_ASSERTS_ABP_AJBInGameCharacter_DDW_C;

SDK_NAMESPACE_END
