#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBHistoryManageComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "BP_AJBComponentBase_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBHistoryManageComponent.BP_AJBHistoryManageComponent_C
// 0x00B8 (0x01A8 - 0x00F0)
class UBP_AJBHistoryManageComponent_C : public UBP_AJBComponentBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00F0(0x0008)(Transient, DuplicateTransient)
	class UClass*                                 HistoryActorClass;                                 // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Time_s_;                                           // 0x0100(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Frequency_s_;                                      // 0x0104(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Distance_cm_;                                      // 0x0108(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CheckInterval_s_;                                  // 0x010C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAJBHistoryInfo>                PrevHistoryInfoList;                               // 0x0110(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FAJBHistoryInfo>                CurrentHistoryInfoList;                            // 0x0120(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class ABP_AJBHistoryActorBase_C*>      HistoryActorList;                                  // 0x0130(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          bDebugShowDistance;                                // 0x0140(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bInfinityDistance;                                 // 0x0141(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_142[0x6];                                      // 0x0142(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_AJBInGameCharacter_C*>       IgnoreDistanceTargetList;                          // 0x0148(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<float>                                 IgnoreDistanceLifeTimeList;                        // 0x0158(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	float                                         IgnoreDistanceTime;                                // 0x0168(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           ValidTag;                                          // 0x0170(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 IgnoreDistancePlayerIDList;                        // 0x0178(0x0010)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance)
	int32                                         IgnoreDistanceLimit;                               // 0x0188(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LastAddedTime;                                     // 0x018C(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LastAccessedHistoryTime;                           // 0x0190(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRequireStandIgnoreDistance;                       // 0x0194(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_195[0x3];                                      // 0x0195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LandingTraceBuffer;                                // 0x0198(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LandingTraceLength;                                // 0x019C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DelayTimeOnDestroy;                                // 0x01A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDebugShowHistoryInfo;                             // 0x01A4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bDuringTimeStop;                                   // 0x01A5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_AJBHistoryManageComponent(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void AddIgnoreDistanceTargetServer(class ABP_AJBInGameCharacter_C* TargetCharacterBP, const struct FDateTime& AccessedHistoryDateTime);
	void Check();
	void ReceiveBeginPlay();
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	void OnRelatedCharacterBecomeLastSurvivor();
	void GetHistoryAfterOnlyExists(TArray<struct FAJBHistoryInfo>& Before, TArray<struct FAJBHistoryInfo>& After, TArray<struct FAJBHistoryInfo>* Result);
	void UpdateHistoryInfo();
	void UpdateHistoryActors();
	void GetPoliticDistance(float* Distance);
	void CollectHistoryInfoList(TArray<struct FAJBHistoryInfo>* HistoryInfoList);
	void MakeIgnoreDistancePlayerIDList(TArray<int32>* List);
	void UpdateHistoryPerPlayerID();
	void UpdateHistoryWithPlayerID(int32 PlayerID);
	void RemoveTarget(class ABP_AJBInGameCharacter_C* TargetCharacterBP);
	void RemoveTargetByIndex(int32 Index_0);
	void AddTarget(class ABP_AJBInGameCharacter_C* TargetCharacterBP);
	void UpdateLeftTime(float DeltaSeconds, TArray<int32>* RemoveIndexes);
	void MakeIgnorePlayerIDList(TArray<int32>* IgnorePlayerIDList);
	void CheckIgnoreDistanceLimit(bool* bLimit);
	void RemoveMostOldestTarget();
	void ShouldAllRemoveTarget(bool* bShouldRemove);
	void RemoveAllTarget();
	void ShouldSpawn(const struct FVector& Location, bool* bShouldSpawn, struct FVector* NewLocation);
	void TryDestroyHistoryActorListAll();
	void TryDestroyHistoryActorListByIndex(int32 Index_0);
	void GetPoliticOwnerLocation(struct FVector* Location);
	void ResetHistoryInfoList();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBHistoryManageComponent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBHistoryManageComponent_C")
	}
	static class UBP_AJBHistoryManageComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBHistoryManageComponent_C>();
	}
};
DUMPER7_ASSERTS_UBP_AJBHistoryManageComponent_C;

SDK_NAMESPACE_END
