#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBTutorialTriggerSender

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function BP_AJBTutorialTriggerSender.BP_AJBTutorialTriggerSender_C.ExecuteUbergraph_BP_AJBTutorialTriggerSender
// 0x0030 (0x0030 - 0x0000)
struct BP_AJBTutorialTriggerSender_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsServer_ReturnValue;                     // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayModeEquals_bResult;                   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_AJBTutorialTriggerSender_C_ExecuteUbergraph_BP_AJBTutorialTriggerSender;

// Function BP_AJBTutorialTriggerSender.BP_AJBTutorialTriggerSender_C.SendTutorialTrigger
// 0x0018 (0x0018 - 0x0000)
struct BP_AJBTutorialTriggerSender_C_SendTutorialTrigger final
{
public:
	struct FGameplayTag                           TriggerTag;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBTutorialTriggerAggregator_C*     CallFunc_GetTutorialTriggerAggregator_TutorialTriggerAggregator; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_AJBTutorialTriggerSender_C_SendTutorialTrigger;

// Function BP_AJBTutorialTriggerSender.BP_AJBTutorialTriggerSender_C.GetTutorialTriggerAggregator
// 0x0030 (0x0030 - 0x0000)
struct BP_AJBTutorialTriggerSender_C_GetTutorialTriggerAggregator final
{
public:
	class UBP_AJBTutorialTriggerAggregator_C*     TutorialTriggerAggregator_0;                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameHUD_C*                     K2Node_DynamicCast_AsBP_AJBIn_Game_HUD;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_AJBTutorialTriggerSender_C_GetTutorialTriggerAggregator;

// Function BP_AJBTutorialTriggerSender.BP_AJBTutorialTriggerSender_C.SendTutorialTriggerWithInt
// 0x0020 (0x0020 - 0x0000)
struct BP_AJBTutorialTriggerSender_C_SendTutorialTriggerWithInt final
{
public:
	struct FGameplayTag                           TriggerTag;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	int32                                         IntParam;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBTutorialTriggerAggregator_C*     CallFunc_GetTutorialTriggerAggregator_TutorialTriggerAggregator; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_AJBTutorialTriggerSender_C_SendTutorialTriggerWithInt;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
