#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBModeSkillBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_AJBBuffSkill_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBModeSkillBase.BP_AJBModeSkillBase_C
// 0x0018 (0x0260 - 0x0248)
class UBP_AJBModeSkillBase_C : public UBP_AJBBuffSkill_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBModeSkillBase_C;              // 0x0248(0x0008)(Transient, DuplicateTransient)
	class UBP_AJBModeBase_C*                      ModePassiveCache;                                  // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                          bIgnoreAddPassiveOnBeginStateAction;               // 0x0258(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_259[0x3];                                      // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ActionWaitTime;                                    // 0x025C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBModeSkillBase(int32 EntryPoint);
	void IsModeChanging(bool* IsModeChanging_0);
	void GetOrMakeModePassiveCache(class UBP_AJBModeBase_C** ModePassiveCache_0);
	void AddPassive();
	void TickState_Action();
	void BeginState_Action();
	void OnRelatedCharacterBecomeLastSurvivor();
	void MPUpdateSettingOnActivate();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBModeSkillBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBModeSkillBase_C")
	}
	static class UBP_AJBModeSkillBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBModeSkillBase_C>();
	}
};
DUMPER7_ASSERTS_UBP_AJBModeSkillBase_C;

SDK_NAMESPACE_END
