#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBOverrun

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AJB_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"
#include "BP_AJBSprintSkill_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBOverrun.BP_AJBOverrun_C
// 0x0080 (0x0370 - 0x02F0)
class UBP_AJBOverrun_C final : public UBP_AJBSprintSkill_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBOverrun_C;                    // 0x02F0(0x0008)(Transient, DuplicateTransient)
	float                                         CameraPitchSpeedScale;                             // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CameraYawSpeedScale;                               // 0x02FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Defence___;                                        // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           ResistPassiveTag;                                  // 0x0308(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LaunchKnockbackConstant;                           // 0x0310(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         KnockbackIntensity_Normal;                         // 0x031C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         KnockbackIntensity_Hamon;                          // 0x0320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         KnockbackIntensity_NormalForStand;                 // 0x0324(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         KnockbackIntensity_HamonForStand;                  // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ResistRatePhase1;                                  // 0x032C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ResistRatePhase2;                                  // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ResistRatePhase3;                                  // 0x0334(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CenteringKnockbackDeg;                             // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CenteringKnockbackForwardLength;                   // 0x033C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RecoveryMPValue;                                   // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_344[0x4];                                      // 0x0344(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           OverrunSE;                                         // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           OverrunHitSE;                                      // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DamageRateToVampire___;                            // 0x0358(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35C[0x4];                                      // 0x035C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           SprintPSMontage;                                   // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HitResistTime;                                     // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         KnockbackRate;                                     // 0x036C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBOverrun(int32 EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ChangeDefaultMontage();
	void OnReceiveDamageLocalCore(const struct FGameplayTag& DamageType);
	void OnReceiveDamageLocal(int32 Damage_0, const struct FGameplayTag& DamageType, class AActor* DamageCauser, bool bRemainHP, bool bDamageIsCutByStatus, bool bDamageIsCutByAAP, bool IsEndured);
	void UnbindOnReceiveDamage();
	void BindonReceiveDamage();
	void ApplySprintDamage_Local(class AActor* HitActor, class UActorComponent* HitComponent, const struct FVector& HitLocation, const struct FVector& HitNormal, int32 SerialNumber_0, float CuttingRate, bool DisableDamage, bool bAvoidSkill);
	void ApplySprintDamage_Server(class AActor* HitActor, class UActorComponent* HitComponent, const struct FVector& Hit_Location, const struct FVector& HitNormal, int32 SerialNumber_0, float CuttingRate, bool DisableDamage, bool bAvoidSkill);
	void SetOverrunBuff(bool IsEnabled);
	void OnCompleted_7DDD297442D7CC4375E0C99B172888F8(class FName NotifyName);
	void OnBlendOut_7DDD297442D7CC4375E0C99B172888F8(class FName NotifyName);
	void OnInterrupted_7DDD297442D7CC4375E0C99B172888F8(class FName NotifyName);
	void OnNotifyBegin_7DDD297442D7CC4375E0C99B172888F8(class FName NotifyName);
	void SetSkillMovementMode(bool IsEnabled);
	void OnEndState();
	void OnBeginState_Action();
	void OnNotifyEnd_7DDD297442D7CC4375E0C99B172888F8(class FName NotifyName);
	void GetKnockbackBasePower(class AActor* TargetActor, float* BasePower);
	void PlayOverrunSE();
	void StopOverrunSE();
	void PlayOverrunHitSE(class AAJBInGameCharacterBase* Actor);
	void GetPoliticSprintMontage(class UAnimMontage** SprintMontage_0);
	void GetAprintMontageAll(TArray<class UAnimMontage*>* SprintMontageList);
	void IsPossibleHamonBreathingOnCameraOnlyEnabled(bool* bPossible);
	void GetVampireDamageRate(float* VampireDamageRate);
	void ShouldApplyHamonRateDirectly(bool* ShouldApplyDirectly);
	void IsHamonRateEnabledSkill(bool* IsEnabled);
	void OnActive();
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	void GetDuration(float* Duration);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBOverrun_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBOverrun_C")
	}
	static class UBP_AJBOverrun_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBOverrun_C>();
	}
};
DUMPER7_ASSERTS_UBP_AJBOverrun_C;

SDK_NAMESPACE_END
