#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameCharacter_ANS

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_AJBInGameCharacter_classes.hpp"
#include "AJB_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBInGameCharacter_ANS.BP_AJBInGameCharacter_ANS_C
// 0x0040 (0x18A0 - 0x1860)
class ABP_AJBInGameCharacter_ANS_C final : public ABP_AJBInGameCharacter_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBInGameCharacter_ANS_C;        // 0x1858(0x0008)(Transient, DuplicateTransient)
	class UBP_AJBAccompanyDDWSkill_C*             BP_AJBAccompanyDDWSkill;                           // 0x1860(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBWallClimb_C*                     BP_AJBWallClimb;                                   // 0x1868(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBAssaultDiveSkill_C*              BP_AJBAssaultDiveSkill;                            // 0x1870(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBDiverShootSkill_C*               BP_AJBDiverShootSkill;                             // 0x1878(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBDiverRushSkill_C*                BP_AJBDiverRushSkill;                              // 0x1880(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        WallClimbOffset;                                   // 0x1888(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_DDW_C*           DDWCharacterBP;                                    // 0x1890(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bJumpButtonIsDown;                                 // 0x1898(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EMovementMode                                 MovementModeBeforeTimeStop;                        // 0x1899(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBInGameCharacter_ANS(int32 EntryPoint);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ROS_ForceFlying();
	void ChangeStealth(bool bEnable);
	void CheckExistPropertyStand(bool* bExist);
	void GetPropertyStand(class ABP_AJBInGameCharacter_C** PropertyStandBP);
	void CheckTransfer(bool* bTransfer);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void PressedButton_ActiveSpecial();
	void PressedButton_Ultimate();
	void PressedButton_ActiveBase();
	void ReleasedButton_Basic();
	void PressedButton_Basic();
	void OnPressedInteract();
	void OnReleasedJump();
	void OnPressedJump();
	void ChangeMovementModeOnTimeStop(bool bEnable, bool bOperatorIsEmpty);
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	void OnGainSupportSkillServer();
	void UserConstructionScript();
	void SetSystemEnable(bool bEnable, bool bCollision, bool bGravity, bool bSpringArm, bool bMovement);
	void PredictionAttackHit(bool* bHit);
	void SetupSharedController();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBInGameCharacter_ANS_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBInGameCharacter_ANS_C")
	}
	static class ABP_AJBInGameCharacter_ANS_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBInGameCharacter_ANS_C>();
	}
};
DUMPER7_ASSERTS_ABP_AJBInGameCharacter_ANS_C;

SDK_NAMESPACE_END
