#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBPistolsStrikeAffecter

#include "Basic.hpp"

#include "AJB_structs.hpp"
#include "BP_AJBDamageAffecterBase_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBPistolsStrikeAffecter.BP_AJBPistolsStrikeAffecter_C
// 0x0040 (0x05C0 - 0x0580)
class ABP_AJBPistolsStrikeAffecter_C final : public ABP_AJBDamageAffecterBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBPistolsStrikeAffecter_C;      // 0x0580(0x0008)(Transient, DuplicateTransient)
	TArray<struct FGameplayTag>                   ImpactGionTags;                                    // 0x0588(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FGameplayTag>                   CurrentRemainImpactGionTags;                       // 0x0598(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         LastSelectedGionIndex;                             // 0x05A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentGionCount;                                  // 0x05AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GionInterval;                                      // 0x05B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRandomStream                          RandomStreamForSelectGion;                         // 0x05B4(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	int32                                         GionCount;                                         // 0x05BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBPistolsStrikeAffecter(int32 EntryPoint);
	void ReceiveDestroyed();
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	void OnTheWorldChanged(bool bEnableTheWorld_0);
	void ReceiveBeginPlay();
	void UserConstructionScript();
	void ShouldEnableInitialTheWorld_Server(bool* Should);
	void CalcAttackDistance(class AActor* DamagedActor, float* AttackDistance);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBPistolsStrikeAffecter_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBPistolsStrikeAffecter_C")
	}
	static class ABP_AJBPistolsStrikeAffecter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBPistolsStrikeAffecter_C>();
	}
};
DUMPER7_ASSERTS_ABP_AJBPistolsStrikeAffecter_C;

SDK_NAMESPACE_END
