#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameLastSurvivorSceneDirector

#include "Basic.hpp"

#include "E_LastSurvivorSceneViewType_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_AJBInGameSceneDirectorComponent_classes.hpp"
#include "E_LastSurvivorCut_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBInGameLastSurvivorSceneDirector.BP_AJBInGameLastSurvivorSceneDirector_C
// 0x00D8 (0x0268 - 0x0190)
class UBP_AJBInGameLastSurvivorSceneDirector_C final : public UBP_AJBInGameSceneDirectorComponent_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBInGameLastSurvivorSceneDirector_C; // 0x0190(0x0008)(Transient, DuplicateTransient)
	class ABP_AJBInGameCharacter_C*               LastSurvivorMainCharacter;                         // 0x0198(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               LastSurvivorPairCharacter;                         // 0x01A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LastSurvivorMainMatchingPlayerIndex;               // 0x01A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               LastDefeatedCharacter;                             // 0x01B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LastDefeatedMatchingPlayerIndex;                   // 0x01B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldPayAttentionTo2ndOnCut1;                    // 0x01BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1BD[0x3];                                      // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Duration_Cut1;                                     // 0x01C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Duration_Cut2;                                     // 0x01C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Duration_Cut3;                                     // 0x01C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FadeOutDurationToCut1End;                          // 0x01CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FadeInDurationFromCut2Begin;                       // 0x01D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LastSurvivorRetireDisplayTimeFromCut2Begin;        // 0x01D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WinEffectStartingTime_FromCut3Begin;               // 0x01D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LastSurvivorVoiceStartingTime_FromWinEffectBegin;  // 0x01DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            TimeDilationCurve_Cut2;                            // 0x01E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            MoveRateCurve_Cut2;                                // 0x01E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            MoveRateCurve_Cut3;                                // 0x01F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_LastSurvivorSceneViewType                   LastSurvivorSceneViewType;                         // 0x01F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDisplayDebugMessage;                              // 0x01F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1FA[0x6];                                      // 0x01FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnStartLastSurvivorSceneDispatcher;                // 0x0200(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   OnEndLastSurvivorSceneCut1;                        // 0x0210(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bSceneIsInterrupted;                               // 0x0220(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           TimerHandle_StartWinEffect;                        // 0x0228(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          bFading;                                           // 0x0230(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnBeginLastSurvivorSceneCut3All;                   // 0x0238(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   OnEndLastSurvivorSceneCut3All;                     // 0x0248(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   OnBeginLastSurvivorSceneCut4All;                   // 0x0258(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_BP_AJBInGameLastSurvivorSceneDirector(int32 EntryPoint);
	void CutEnd(uint8 CurrentCut_0, uint8 NextCut);
	void CutBegin(uint8 CurrentCut_0, uint8 BeforeCut_0);
	void CutTick(uint8 Cut);
	void StartLastSurvivorScene_Core(class ABP_AJBInGameCharacter_C* LastSurvivorMainCharacter_0, int32 LastSurvivorMainMatchingPlayerIndex_0, class ABP_AJBInGameCharacter_C* LastSurvivorPairCharacter_0, class ABP_AJBInGameCharacter_C* LastDefeatedCharacter_0, int32 LastDefeatedMatchingPlayerIndex_0, bool bShouldPayAttentionTo2ndOnCut1_0);
	void Cut3_End();
	void CutInterruption_Begin();
	void Cut1_End();
	void CutNone_Begin();
	void StartWinEffect();
	void Cut2_End();
	void Cut4_Begin();
	void Cut3_Tick();
	void Cut3_Begin();
	void Cut2_Begin();
	void Cut1_Begin();
	void Cut2_Tick();
	void Cut1_Tick();
	void Finished_D3D3C8FC4AA31CAF00C78E9460154D97();
	void Finished_00AFEA184C222123AE581E82AD0FE1D2();
	void Finished_80A1A441404C982B7011F4824F3D955D();
	void IsLastSurvivorCharacter(class AActor* Actor, bool* Result);
	void IsLastDefeatedCharacter(class AActor* Actor, bool* Result);
	void SetSceneTimeDilation(float TimeDilation);
	void InterruptScene();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBInGameLastSurvivorSceneDirector_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBInGameLastSurvivorSceneDirector_C")
	}
	static class UBP_AJBInGameLastSurvivorSceneDirector_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBInGameLastSurvivorSceneDirector_C>();
	}
};
DUMPER7_ASSERTS_UBP_AJBInGameLastSurvivorSceneDirector_C;

SDK_NAMESPACE_END
