#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBTeleportationSkill

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AJB_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_AJBSkillBase_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBTeleportationSkill.BP_AJBTeleportationSkill_C
// 0x0150 (0x0338 - 0x01E8)
class UBP_AJBTeleportationSkill_C : public UBP_AJBSkillBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBTeleportationSkill_C;         // 0x01E8(0x0008)(Transient, DuplicateTransient)
	float                                         WaitingTime;                                       // 0x01F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ClearingTime;                                      // 0x01F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MovementDistance;                                  // 0x01F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1FC[0x4];                                      // 0x01FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           BeforeTeleportationParticleTag;                    // 0x0200(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           AfterTeleportationParticleTag;                     // 0x0208(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TempBeforeLocation;                                // 0x0210(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           StandWaitingMontage;                               // 0x0220(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PostProcessIndex;                                  // 0x0228(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBGlimpseOfForceEffect_C*          EffectActor;                                       // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 PreviewObjectClass;                                // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 EffectClass;                                       // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActionGionTag;                                     // 0x0248(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           StandClearingMontage;                              // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CharacterWaitingMontage;                           // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CharacterClearingMontage;                          // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TraceStartHeightBuffer_cm_;                        // 0x0268(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TraceEndHeightBuffer_cm_;                          // 0x026C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CachedLocation;                                    // 0x0270(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CachedDirection;                                   // 0x027C(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CachedLength;                                      // 0x0288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CachedAngle;                                       // 0x028C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CachedDefaultDirection;                            // 0x0290(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SlopeTraceForwardBuffer_cm_;                       // 0x029C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           TimerHandle_Debug;                                 // 0x02A0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FVector                                CachedSlopeDirection;                              // 0x02A8(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCachedFirstFlatland;                              // 0x02B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bReserveWaiting;                                   // 0x02B5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B6[0x2];                                      // 0x02B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 PreviewObject;                                     // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocalDecidedLocation;                              // 0x02C0(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CameraTurnSpeed;                                   // 0x02CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CameraLookupSpeed;                                 // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TraceLowerLimit_cm_;                               // 0x02D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PreviewObjectTraceBuffer_cm_;                      // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           TempSidingRemovedFactorTag;                        // 0x02E0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         TempSidingRemovedFactorValue;                      // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           PreviewParticleTag;                                // 0x02F0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameParticleEffect_C*          PreviewParticle;                                   // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PreviewParticleTraceBuffer_cm_;                    // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_304[0x4];                                      // 0x0304(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           SETag;                                             // 0x0308(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnableGroundingTrace;                             // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_311[0x3];                                      // 0x0311(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         GroundingTraceUnderBuffer_cm_;                     // 0x0314(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   StartingSection_StandClearingMontage;              // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           InputCameraOnlyFactorTag_TeleportationSkill;       // 0x0320(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bCancelSelf_LocalOnly;                             // 0x0328(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIgnoreCharacter;                                  // 0x0329(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_32A[0x2];                                      // 0x032A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MovementDistanceScale;                             // 0x032C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AdditionalMovementDistance;                        // 0x0330(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBTeleportationSkill(int32 EntryPoint);
	void DestroyPreviewObject_Local();
	void SpawnPreviewObject_Local();
	void Debug_DrawTargetLocation_Impl();
	void Debug_DrawTargetLocation(bool bEnable);
	void UpdateStandMeshTransform();
	void MC_BeginState_Ready();
	void ROS_BeginState_Ready();
	void OnBeginState_Ready_OneShot();
	void BeginState_Ready();
	void OnBeginState_Action_OneShot(const struct FVector& BeforeLocation, const struct FVector& AfterLocation);
	void OnBeginState_Waiting_OneShot();
	void MC_StateEnd_Server(bool bCancel);
	void StateEnd_Server(bool bCancel);
	void TickState_Ready();
	void OnBeginState_Ready();
	void MC_BeginState_Waiting();
	void ROS_BeginState_Waiting();
	void BeginState_Waiting();
	void MC_StateEnd(bool bCancel);
	void ROS_StateEnd(bool bCancel);
	void OnBeginState_Clearing();
	void OnStateEnd(bool bCancel);
	void StateEnd(bool bCancel);
	void TickState_Clearing();
	void TickState_Waiting();
	void OnBeginState_Action();
	void BeginState_Action();
	void MC_Teleportation(const struct FVector& BeforeLocation, const struct FVector& AfterLocation);
	void ROS_Teleportation(const struct FVector& BeforeLocation, const struct FVector& AfterLocation);
	void OnBeginState_Waiting();
	void StateTick(float DeltaSeconds);
	void ChangeMovementDistanceScale(float Value);
	void ChangeCharacterMoveSpeedByStand(float Value);
	void ChangeStandLaunchVelocityScale(float Value);
	void ChangeStandMovementDistanceScale(float Value);
	void OnCompleted_7B45FB9D406D5826C78546BCC2D70BE3(class FName NotifyName);
	void OnBlendOut_7B45FB9D406D5826C78546BCC2D70BE3(class FName NotifyName);
	void OnInterrupted_7B45FB9D406D5826C78546BCC2D70BE3(class FName NotifyName);
	void OnNotifyBegin_7B45FB9D406D5826C78546BCC2D70BE3(class FName NotifyName);
	void OnNotifyEnd_7B45FB9D406D5826C78546BCC2D70BE3(class FName NotifyName);
	void OnCompleted_7B45FB9D406D5826C78546BCC331AC50(class FName NotifyName);
	void OnBlendOut_7B45FB9D406D5826C78546BCC331AC50(class FName NotifyName);
	void OnInterrupted_7B45FB9D406D5826C78546BCC331AC50(class FName NotifyName);
	void OnNotifyBegin_7B45FB9D406D5826C78546BCC331AC50(class FName NotifyName);
	void OnNotifyEnd_7B45FB9D406D5826C78546BCC331AC50(class FName NotifyName);
	void OnCompleted_7DDD297442D7CC4375E0C99BA8805AA7(class FName NotifyName);
	void OnBlendOut_7DDD297442D7CC4375E0C99BA8805AA7(class FName NotifyName);
	void OnInterrupted_7DDD297442D7CC4375E0C99BA8805AA7(class FName NotifyName);
	void OnNotifyBegin_7DDD297442D7CC4375E0C99BA8805AA7(class FName NotifyName);
	void OnNotifyEnd_7DDD297442D7CC4375E0C99BA8805AA7(class FName NotifyName);
	void OnCompleted_7DDD297442D7CC4375E0C99B1AB82E8A(class FName NotifyName);
	void OnBlendOut_7DDD297442D7CC4375E0C99B1AB82E8A(class FName NotifyName);
	void OnInterrupted_7DDD297442D7CC4375E0C99B1AB82E8A(class FName NotifyName);
	void OnNotifyBegin_7DDD297442D7CC4375E0C99B1AB82E8A(class FName NotifyName);
	void OnNotifyEnd_7DDD297442D7CC4375E0C99B1AB82E8A(class FName NotifyName);
	void CalcLocation(const struct FVector& StartLocation, const struct FVector& Direction, struct FVector* Location);
	void Teleportation(const struct FVector& NewLocation);
	void FirePostProcess();
	void TraceFlatland(const struct FVector& StartLocation, const struct FVector& Direction, float Length, float Angle, bool* bContinue, struct FVector* NewLocation, struct FVector* NewDirection, float* NewLength, float* NewAngle);
	void TraceSlope(const struct FVector& StartLocation, const struct FVector& Direction, float Length, struct FVector* NewLocation, struct FVector* NewDirection, float* NewLength);
	void UpdateTempInfo(const struct FVector& StartLocation, const struct FVector& Direction, float Length, float Angle);
	void GetObjectTypes(TArray<EObjectTypeQuery>* ObjectTypes);
	void TraceLanding(const struct FVector& StartLocation, struct FVector* NewLocation);
	void TraceHover(const struct FVector& Start, bool* bContinue);
	void ReserveWaiting();
	struct FTransform CalcLocalDecidedTransform();
	void ProcessingPreview(const struct FVector& Location, float PreviewTraceBuffer, struct FVector* NewLocation);
	void CalcLocation_Server(const struct FVector& BeforeLocation, const struct FVector& AfterLocation, struct FVector* NewLocation);
	void TraceGrounding(const struct FVector& StartLocation, const struct FVector& DefaultDirection, bool bShouldSpace, struct FVector* NewLocation);
	void SetPreviewVisibility(bool NewVisibility);
	void GetPoliticMovementDistance(float* MovementDistance_0);
	void UpdatePreviewObjectsTransform();
	void TraceSpacing(const struct FVector& Start, const struct FVector& DefaultDirection, bool* bCanSpace);
	void CheckPossibleTeleport_Server(bool* bPossible);
	void DebugDrawFlatland(const struct FVector& NewLocation, const struct FVector& ImpactNormal, const struct FVector& CurrentDirection, const struct FVector& NewDirection, float ConsumeAngle);
	void CancelSkillSelf();
	void CheckCharacterCondition(class ABP_AJBInGameCharacter_C* CharacterBP, bool* bIgnore);
	void OnDisconnected();
	void StateBeginPlay(bool bShouldRestore);
	void OnCancel();
	void OnActive();
	void OnReady();
	void ReceiveTick(float DeltaSeconds);
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	void PowerUpServer(float Value);
	void PowerDown_Server(float Value);

	bool IsInPreview() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBTeleportationSkill_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBTeleportationSkill_C")
	}
	static class UBP_AJBTeleportationSkill_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBTeleportationSkill_C>();
	}
};
DUMPER7_ASSERTS_UBP_AJBTeleportationSkill_C;

SDK_NAMESPACE_END
