#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBRoadRollerSkill

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_AJBTheWorldWLDSkill_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBRoadRollerSkill.BP_AJBRoadRollerSkill_C
// 0x01B0 (0x03D0 - 0x0220)
class UBP_AJBRoadRollerSkill_C final : public UBP_AJBTheWorldWLDSkill_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBRoadRollerSkill_C;            // 0x0220(0x0008)(Transient, DuplicateTransient)
	float                                         StateTime_Jumping;                                 // 0x0228(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         JumpingState_JumpTime;                             // 0x022C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StateTime_PreFalling;                              // 0x0230(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StateTime_Falling;                                 // 0x0234(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FallingState_GroundTime;                           // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StateTime_FullAttack;                              // 0x023C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StateTime_Finish;                                  // 0x0240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StateTime_ForceFinish;                             // 0x0244(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FinishState_ImpactTime;                            // 0x0248(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FinishState_ExitTime;                              // 0x024C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StateTime_Clearing;                                // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           FallingAnimation;                                  // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDebugShowRoadRollerState;                         // 0x0260(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBRoadRollerPreview_C*             RoadRollerPreview;                                 // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBRoadRoller_C*                    RoadRoller;                                        // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameParticleEffect_C*          LandingGuideParticle;                              // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAlreadyPassedImpulseGroundTiming;                 // 0x0280(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_281[0x3];                                      // 0x0281(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ClearingStateCollisionChangedTime;                 // 0x0284(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxStepHeightOnPreview;                            // 0x0288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxStepHeightOnPreviewStage04;                     // 0x028C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxStepHeightOnPreviewStage05;                     // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LookupSpeedOnPreview;                              // 0x0294(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TurnSpeedOnPreview;                                // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MoveSpeedOnPreview;                                // 0x029C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DefaultPitchOnPreview;                             // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EndPitchOnPreview;                                 // 0x02A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RoadRollerRotation;                                // 0x02A8(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bAlreadyCompDisableRRMode;                         // 0x02B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bAlreadyPassedImpactTiming;                        // 0x02B5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bAlreadyPassedJumpTiming;                          // 0x02B6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B7[0x1];                                      // 0x02B7(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      ObjectTypesCeilingLocation;                        // 0x02B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<EObjectTypeQuery>                      ObjectTypesFloorLocation;                          // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<EObjectTypeQuery>                      ObjectTypesPositioning;                            // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<EObjectTypeQuery>                      ObjectTypesPositioningStage04;                     // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	float                                         CeilingLocationTraceHeight;                        // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FloorLocationTraceHeight;                          // 0x02FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SocketName_RoadRollerForceFinishParticle;          // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SocketName_CharacterForceFinishParticle;           // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAlreadyPassedChangedCollisionTiming;              // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bAlreadyPassedAdjustForReserveUncrouchTimimg;      // 0x0311(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_312[0x6];                                      // 0x0312(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBDamageImpulseBase_C*             DamageImpulseFinish;                               // 0x0318(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CapsuleRadiusCache;                                // 0x0320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CapsuleHalfHeightCache;                            // 0x0324(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CapsuleRadiusOnPreview;                            // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CapsuleRadiusOnPreviewStage05;                     // 0x032C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CapsuleHalfHeightOnPreview;                        // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CapsuleHalfHeightOnPreviewStage05;                 // 0x0334(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GravityScaleOnPreview;                             // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CapsuleHalfHeightDiffCache;                        // 0x033C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WalkableFloorAngleOnDirection;                     // 0x0340(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WalkableFloorAngleCache;                           // 0x0344(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Rep_ReserveLocation;                               // 0x0348(0x000C)(Edit, BlueprintVisible, Net, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               ReserveControlRotation_Local;                      // 0x0354(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bDebugDrawCupsuleSizeChanged;                      // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_361[0x3];                                      // 0x0361(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AdjustForReserveUncrouchTime;                      // 0x0364(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AfterSkyMoveLocationBuffer;                        // 0x0368(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AfterGroundMoveLocationBuffer;                     // 0x036C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CheckGroundMoveTimerHandle;                        // 0x0370(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	float                                         CheckGroundMoveTimeSpan;                           // 0x0378(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_37C[0x4];                                      // 0x037C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      ObjectTypesPositioningAfterChangeCollision;        // 0x0380(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          bDebugShowCameraChange;                            // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           JumpAnimation;                                     // 0x0398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           FullAttackAnimation;                               // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           FinishAnimation;                                   // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           ClearingAnimation;                                 // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WalkableFloorAngleOnDirectionStage05;              // 0x03B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BC[0x4];                                      // 0x03BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      ObjectTypesPositioningAfterChangeCollisionStage04; // 0x03C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_BP_AJBRoadRollerSkill(int32 EntryPoint);
	void OnJumpTiming();
	void OnBeginCut(uint8 CurrentCut, uint8 BeforeCut);
	void TryBeginStateForceFinish();
	void MC_NotifyTheWorldEnable();
	void TryCheckGroundMoveCore();
	void TryCheckGroundMove();
	void ROC_GroundMoveProcess(const struct FVector& GroundMoveLocation);
	void ROS_GroundMoveProcess(const struct FVector& GroundMoveLocation);
	void StateTick_ForceFinish();
	void MC_BeginState_ForceFinish();
	void ROS_BeginState_ForceFinish();
	void OnBeginState_ForceFinish();
	void BeginState_ForceFinish_Local();
	void StateBegin_Action();
	void MC_EndState();
	void ROS_EndState();
	void EndState_Local();
	void StateTick_PreFalling();
	void MC_BeginState_PreFalling();
	void ROS_BeginState_PreFalling();
	void OnBeginState_PreFalling();
	void BeginState_PreFalling_Local();
	void EndState();
	void StateTick();
	void StateTick_Clearing();
	void MC_BeginState_Clearing();
	void ROS_BeginState_Clearing();
	void StateTick_Finish();
	void MC_BeginState_Finish();
	void ROS_BeginState_Finish();
	void StateTick_FullAttack();
	void MC_BeginState_FullAttack();
	void ROS_BeginState_FullAttack();
	void StateTick_Falling();
	void StateTick_Preview();
	void MC_BeginState_Falling();
	void ROS_BeginState_Falling();
	void MC_BeginState_Preview();
	void ROS_BeginState_Preview();
	void OnBeginState_Clearing();
	void OnBeginState_Finish();
	void OnBeginState_FullAttack();
	void OnBeginState_Falling();
	void OnBeginState_Preview();
	void BeginState_Clearing_Local();
	void BeginState_Finish_Local();
	void BeginState_FullAttack_Local();
	void BeginState_Falling_Local();
	void BeginState_Preview_Local();
	void StateTick_Jumping();
	void MC_BeginState_jumping();
	void ROS_BeginState_Jumping();
	void OnBeginState_Jumping();
	void BeginState_Jumping_Local();
	void StateTick_Action();
	void OnCompleted_7DDD297442D7CC4375E0C99B70B0BFF8(class FName NotifyName);
	void OnBlendOut_7DDD297442D7CC4375E0C99B70B0BFF8(class FName NotifyName);
	void OnInterrupted_7DDD297442D7CC4375E0C99B70B0BFF8(class FName NotifyName);
	void OnNotifyBegin_7DDD297442D7CC4375E0C99B70B0BFF8(class FName NotifyName);
	void OnNotifyEnd_7DDD297442D7CC4375E0C99B70B0BFF8(class FName NotifyName);
	void OnCompleted_7DDD297442D7CC4375E0C99B6B9095E6(class FName NotifyName);
	void OnBlendOut_7DDD297442D7CC4375E0C99B6B9095E6(class FName NotifyName);
	void OnInterrupted_7DDD297442D7CC4375E0C99B6B9095E6(class FName NotifyName);
	void OnNotifyBegin_7DDD297442D7CC4375E0C99B6B9095E6(class FName NotifyName);
	void OnNotifyEnd_7DDD297442D7CC4375E0C99B6B9095E6(class FName NotifyName);
	void OnCompleted_7DDD297442D7CC4375E0C99B19645DE2(class FName NotifyName);
	void OnBlendOut_7DDD297442D7CC4375E0C99B19645DE2(class FName NotifyName);
	void OnInterrupted_7DDD297442D7CC4375E0C99B19645DE2(class FName NotifyName);
	void OnNotifyBegin_7DDD297442D7CC4375E0C99B19645DE2(class FName NotifyName);
	void OnNotifyEnd_7DDD297442D7CC4375E0C99B19645DE2(class FName NotifyName);
	void OnCompleted_7DDD297442D7CC4375E0C99B132D823B(class FName NotifyName);
	void OnBlendOut_7DDD297442D7CC4375E0C99B132D823B(class FName NotifyName);
	void OnInterrupted_7DDD297442D7CC4375E0C99B132D823B(class FName NotifyName);
	void OnNotifyBegin_7DDD297442D7CC4375E0C99B132D823B(class FName NotifyName);
	void OnNotifyEnd_7DDD297442D7CC4375E0C99B132D823B(class FName NotifyName);
	void OnCompleted_7DDD297442D7CC4375E0C99B7B529098(class FName NotifyName);
	void OnBlendOut_7DDD297442D7CC4375E0C99B7B529098(class FName NotifyName);
	void OnInterrupted_7DDD297442D7CC4375E0C99B7B529098(class FName NotifyName);
	void OnNotifyBegin_7DDD297442D7CC4375E0C99B7B529098(class FName NotifyName);
	void OnNotifyEnd_7DDD297442D7CC4375E0C99B7B529098(class FName NotifyName);
	void ChangePreviewMode(bool bEnable);
	void ChangeDirectionMode(bool bEnable);
	void TrySpawnPreviewObject();
	void TryDestroyPreviewObject();
	void UpdatePreviewObjectTransform(bool bSpecifyLocation, const struct FVector& SpecifiedLocation);
	void TrySpawnRoadRoller();
	void TryDestroyRoadRoller();
	void SpawnDamageImpulse_Server(class UClass* ImpulseClass, class ABP_AJBDamageImpulseBase_C** SpawnedImpulse);
	void GenerateLandingGuideParticle();
	void ChangeCharacterRRMode(bool bEnable);
	void ChangeCamera(const struct FGameplayTag& NewCamera, const struct FGameplayTag& OldCamera);
	void GenerateForceFinishParticles();
	void TryChangeHearingThingsEnable(bool bEnable);
	void ChangeInvincibleStatus(bool bEnable);
	void ChangeRoadRollerCapsuleSize(bool bEnable);
	void PositioningSafeLocation_RoadRoller(TArray<EObjectTypeQuery>& ObjectTypes, float SmallAmount);
	void ShouldSkyMove(bool* bShouldSkyMove);
	void DebugDrawCurrentCapsuleSize(const struct FRotator& Rotation, const struct FLinearColor& LineColor, float Duration, float Tickness);
	void AdjustForReserveUncrouch();
	void CheckGroundMove(bool* bShouldGroundMove, struct FVector* Location);
	void UpdateLandingParticleTransform(const struct FVector& NewLocation);
	void ChangeCameraOnlyMode(bool bEnable);
	void ChangeEnableShouldUpdateBombing(class ABP_AJBInGameCharacter_C* IngameCharacterBP, bool bEnable, bool bIgnoreActiveCheck);
	void SpawnDamageImpulseOrbitServer();
	void MoveToCeiling(bool bForceMove);
	void StopDirectionsMontage();
	void GetStateTimePreview(float* PreviewTime);
	void ChangeFloorAngle(bool bEnable);
	void TryChangeTorrentialRainVisualEnable(bool bEnable);
	void GetPoliticMaxStepHeightOnPreview(float* MaxStepHeight);
	void GetPoliticObjectTypesPositioning(TArray<EObjectTypeQuery>* ObjectTypes);
	void GetPoliticObjectTypesPositioningAfterChangeCollision(TArray<EObjectTypeQuery>* ObjectTypes);
	void IsCollisionEnableState(bool* bReturn);
	void GetWalkableFloorAngleDirection(float* WalkableFloorAngleOnDirection_0);
	void GetCapsuleRadiusOnPreview(float DefaultValue, float* CapsuleRadius);
	void GetCapsuleHalfHeightOnPreview(float DefaultValue, float* CapsuleHalfHeight);
	void StateBeginPlay(bool bShouldRestore);
	void OnDisconnected();
	void OnCancel();
	void ReceiveTick(float DeltaSeconds);
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	void InitializeVariables();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBRoadRollerSkill_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBRoadRollerSkill_C")
	}
	static class UBP_AJBRoadRollerSkill_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBRoadRollerSkill_C>();
	}
};
DUMPER7_ASSERTS_UBP_AJBRoadRollerSkill_C;

SDK_NAMESPACE_END
