#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBIronsandCamouflageSkill

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "BP_AJBSkillBase_classes.hpp"
#include "AJB_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBIronsandCamouflageSkill.BP_AJBIronsandCamouflageSkill_C
// 0x0030 (0x0218 - 0x01E8)
class UBP_AJBIronsandCamouflageSkill_C final : public UBP_AJBSkillBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBIronsandCamouflageSkill_C;    // 0x01E8(0x0008)(Transient, DuplicateTransient)
	float                                         StateTimeReady;                                    // 0x01F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAlreadyCompletedTickStateReady;                   // 0x01F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F5[0x3];                                      // 0x01F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           BeginGionTag;                                      // 0x01F8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnCanceledCamouflageByReceiveDamageLocal;          // 0x0200(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class ABP_AJBInGameParticleEffect_C*          ParticleStart;                                     // 0x0210(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBIronsandCamouflageSkill(int32 EntryPoint);
	void MC_ReceiveDamage(bool bShouldRemovePassive);
	void ROS_ReceiveDamage();
	void OnReceiveDamageLocalCore(const struct FGameplayTag& DamageType);
	void OnReceiveDamageLocal(int32 Damage_0, const struct FGameplayTag& DamageType, class AActor* DamageCauser, bool bRemainHP, bool bDamageIsCutByStatus, bool bDamageIsCutByAAP, bool IsEndured);
	void UnbindOnReceiveDamage();
	void BindonReceiveDamage();
	void ChangeGuideUIVisibility(bool bNewVisibility);
	void MC_BeginStateAction();
	void ROS_BeginStateAction();
	void BeginStateActionLocal();
	void OnBeginStateAction();
	void StateTick();
	void TickStateReady();
	void OnBeginStateReady();
	void OnActive();
	void OnInactive();
	void ReceiveTick(float DeltaSeconds);
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	void InitializeVariables();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBIronsandCamouflageSkill_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBIronsandCamouflageSkill_C")
	}
	static class UBP_AJBIronsandCamouflageSkill_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBIronsandCamouflageSkill_C>();
	}
};
DUMPER7_ASSERTS_UBP_AJBIronsandCamouflageSkill_C;

SDK_NAMESPACE_END
