#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameCharacter_KWK

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_AJBInGameCharacter_classes.hpp"
#include "AJB_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBInGameCharacter_KWK.BP_AJBInGameCharacter_KWK_C
// 0x0030 (0x1890 - 0x1860)
class ABP_AJBInGameCharacter_KWK_C final : public ABP_AJBInGameCharacter_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBInGameCharacter_KWK_C;        // 0x1858(0x0008)(Transient, DuplicateTransient)
	class UBP_AJBBitesTheDustSkill_C*             BP_AJBBitesTheDustSkill;                           // 0x1860(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBAirBombSkill_C*                  BP_AJBAirBombSkill;                                // 0x1868(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBKillerRushSkill_C*               BP_AJBKillerRushSkill;                             // 0x1870(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBAccompanyKQSSkill_C*             BP_AJBAccompanyKQSSkill;                           // 0x1878(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          bContinuedAccompany;                               // 0x1880(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_AJBInGameCharacter_KWK(int32 EntryPoint);
	void InactiveContinuedAccompany();
	void ActiveContinuedAccompany();
	void UpdateShotPoasibilityKWK(float Delta);
	void GetDummyShotLocation(struct FVector* Location);
	void ShouldShowNGPoint(bool* bResult);
	void GetShutTraceRadius(float* Radius);
	void GetShotLocation(bool bConsiderCharacterCapsuleRadius, const struct FGameplayTag& SkillTag, TArray<struct FVector>* Locations);
	void CheckLocallyControlled(bool* bLocallyControlled);
	void PressedButton_ActiveSpecial();
	void PressedButton_ActiveBase();
	void ReleasedButton_Basic();
	void PressedButton_Basic();
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	void UserConstructionScript();
	void SkillInactivated(class UBP_AJBSkillBase_C* InactivatedSkill);
	void UpdateShotPossibility(float Delta);
	void OnBeforeInteract(bool* bShouldInteract);
	void PreConsumeHP(int32 LeftDamageForHP, const struct FGameplayTag& DamageType, bool bPenetrateAP, int32* OverrideLeftDamageForHP);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBInGameCharacter_KWK_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBInGameCharacter_KWK_C")
	}
	static class ABP_AJBInGameCharacter_KWK_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBInGameCharacter_KWK_C>();
	}
};
DUMPER7_ASSERTS_ABP_AJBInGameCharacter_KWK_C;

SDK_NAMESPACE_END
