#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameCharacter_C28

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_AJBInGameCharacter_classes.hpp"
#include "AJB_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBInGameCharacter_C28.BP_AJBInGameCharacter_C28_C
// 0x0030 (0x1890 - 0x1860)
class ABP_AJBInGameCharacter_C28_C final : public ABP_AJBInGameCharacter_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBInGameCharacter_C28_C;        // 0x1858(0x0008)(Transient, DuplicateTransient)
	class UBP_AJBCollectMd_C*                     BP_AJBCollectMd;                                   // 0x1860(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBRobMdSkill_C*                    BP_AJBRobMdSkill;                                  // 0x1868(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBRobSdSkill_C*                    BP_AJBRobSdSkill;                                  // 0x1870(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBRushS28Skill_C*                  BP_AJBRushS28Skill;                                // 0x1878(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBSeparateS28Skill_C*              BP_AJBSeparateS28Skill;                            // 0x1880(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBInGameCharacter_C28(int32 EntryPoint);
	void EndSpecialBreakDown();
	void StartSpecialBreakDown();
	void ReceiveTick(float DeltaSeconds);
	void ReleasedButton_Ultimate();
	void PressedButton_ActiveSpecial();
	void PressedButton_Ultimate();
	void PressedButton_ActiveBase();
	void ReleasedButton_Basic();
	void PressedButton_Basic();
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	void UserConstructionScript();
	void SetupActionSkillInfo();
	void OnBeforeInteract(bool* bShouldInteract);
	void SetMoveSpeedOnCriticalness();
	void CheckErrorConditionOperator(class AActor* InteractActor, bool* bErrorCondition, uint8* ErrorType);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBInGameCharacter_C28_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBInGameCharacter_C28_C")
	}
	static class ABP_AJBInGameCharacter_C28_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBInGameCharacter_C28_C>();
	}
};
DUMPER7_ASSERTS_ABP_AJBInGameCharacter_C28_C;

SDK_NAMESPACE_END
