#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBPairOverGrow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_AJBComponentBase_classes.hpp"
#include "AJB_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBPairOverGrow.BP_AJBPairOverGrow_C
// 0x0070 (0x0160 - 0x00F0)
class UBP_AJBPairOverGrow_C final : public UBP_AJBComponentBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00F0(0x0008)(Transient, DuplicateTransient)
	float                                         PairTraceRadius;                                   // 0x00F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PairTraceInterval;                                 // 0x00FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxDistanceTraceStartToBase;                       // 0x0100(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DistanceBaseToTraceEnd;                            // 0x0104(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinForwardZForMaxTraceDistanceRate;                // 0x0108(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxForawrdZForMinTraceDistanceRate;                // 0x010C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MaxTraceDistanceRate;                              // 0x0110(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinTraceDistanceRateUp;                            // 0x0114(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinTraceDistanceRateDown;                          // 0x0118(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11C[0x4];                                      // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameParticleEffect_C*          PairTargetParticle;                                // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDuringTheWorld;                                   // 0x0128(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PairCheckDistanceLimit;                            // 0x012C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_C*               PairTarget;                                        // 0x0130(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class ABP_AJBInGameCharacter_C> PrevTarget;                                       // 0x0138(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBPairOverGrow(int32 EntryPoint);
	void OnChangedNotOwnerEnv(class ABP_AJBInGameCharacter_C* PairTarget_0);
	void ROS_OnChanged(class ABP_AJBInGameCharacter_C* PairTarget_0);
	void OnChangedOwnerEnv(bool bShouldSpawnParticle);
	void UpdatePairCheck();
	void ReceiveBeginPlay();
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	void UpdatePairCheckCore(bool* bTargetIsPair, class ABP_AJBInGameCharacter_C** NewTarget);
	void ChangeTarget(class ABP_AJBInGameCharacter_C* CharacterBP);
	void TryDestroyPairTargetParticle();
	void ChangeGuideUIEnable(bool bEnable);
	void OnRep_PairTarget();
	void SpawnPairTargetParticle(class ACharacter* PairTarget_0, const struct FGameplayTag& ParticleTag);

	void IsPairNearby(bool* IsNearby) const;
	void CanPairOverGrow(class AActor* TargetPair, bool* CanPairOverGrow_0) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBPairOverGrow_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBPairOverGrow_C")
	}
	static class UBP_AJBPairOverGrow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBPairOverGrow_C>();
	}
};
DUMPER7_ASSERTS_UBP_AJBPairOverGrow_C;

SDK_NAMESPACE_END
