#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameSceneDirectorComponent

#include "Basic.hpp"

#include "E_LastSurvivorCut_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function BP_AJBInGameSceneDirectorComponent.BP_AJBInGameSceneDirectorComponent_C.ExecuteUbergraph_BP_AJBInGameSceneDirectorComponent
// 0x0014 (0x0014 - 0x0000)
struct BP_AJBInGameSceneDirectorComponent_C_ExecuteUbergraph_BP_AJBInGameSceneDirectorComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_CustomEvent_CurrentCut1;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_CustomEvent_BeforeCut;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_CustomEvent_CurrentCut;                     // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_CustomEvent_NextCut;                        // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_LastSurvivorCut                             K2Node_CustomEvent_NextCut1;                       // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_CustomEvent_Cut;                            // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_AJBInGameSceneDirectorComponent_C_ExecuteUbergraph_BP_AJBInGameSceneDirectorComponent;

// Function BP_AJBInGameSceneDirectorComponent.BP_AJBInGameSceneDirectorComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBInGameSceneDirectorComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_AJBInGameSceneDirectorComponent_C_ReceiveTick;

// Function BP_AJBInGameSceneDirectorComponent.BP_AJBInGameSceneDirectorComponent_C.CutEnd
// 0x0002 (0x0002 - 0x0000)
struct BP_AJBInGameSceneDirectorComponent_C_CutEnd final
{
public:
	uint8                                         CurrentCut_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         NextCut;                                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_AJBInGameSceneDirectorComponent_C_CutEnd;

// Function BP_AJBInGameSceneDirectorComponent.BP_AJBInGameSceneDirectorComponent_C.CutBegin
// 0x0002 (0x0002 - 0x0000)
struct BP_AJBInGameSceneDirectorComponent_C_CutBegin final
{
public:
	uint8                                         CurrentCut_0;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         BeforeCut_0;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_AJBInGameSceneDirectorComponent_C_CutBegin;

// Function BP_AJBInGameSceneDirectorComponent.BP_AJBInGameSceneDirectorComponent_C.ChangeCut
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBInGameSceneDirectorComponent_C_ChangeCut final
{
public:
	E_LastSurvivorCut                             NextCut;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_AJBInGameSceneDirectorComponent_C_ChangeCut;

// Function BP_AJBInGameSceneDirectorComponent.BP_AJBInGameSceneDirectorComponent_C.CutTick
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBInGameSceneDirectorComponent_C_CutTick final
{
public:
	uint8                                         Cut;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_AJBInGameSceneDirectorComponent_C_CutTick;

// Function BP_AJBInGameSceneDirectorComponent.BP_AJBInGameSceneDirectorComponent_C.UpdateRealDeltaTime
// 0x0020 (0x0020 - 0x0000)
struct BP_AJBInGameSceneDirectorComponent_C_UpdateRealDeltaTime final
{
public:
	struct FDateTime                              Temp_Now;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FDateTime                              CallFunc_Now_ReturnValue;                          // 0x0008(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_Subtract_DateTimeDateTime_ReturnValue;    // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSeconds_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_AJBInGameSceneDirectorComponent_C_UpdateRealDeltaTime;

// Function BP_AJBInGameSceneDirectorComponent.BP_AJBInGameSceneDirectorComponent_C.SwitchSceneCamera
// 0x0048 (0x0048 - 0x0000)
struct BP_AJBInGameSceneDirectorComponent_C_SwitchSceneCamera final
{
public:
	struct FGameplayTag                           SceneCameraTag;                                    // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	const class UClass*                           SceneCameraClass;                                  // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCreateCameraWhenIsNotFound;                       // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bSwitched;                                         // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameSceneCamera_C*             SceneCamera;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameSceneCamera_C*             CallFunc_CreateSceneCamera_Camera;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameSceneCamera_C*             CallFunc_Map_Find_Value;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_AJBInGameSceneDirectorComponent_C_SwitchSceneCamera;

// Function BP_AJBInGameSceneDirectorComponent.BP_AJBInGameSceneDirectorComponent_C.CreateSceneCamera
// 0x0060 (0x0060 - 0x0000)
struct BP_AJBInGameSceneDirectorComponent_C_CreateSceneCamera final
{
public:
	struct FGameplayTag                           SceneCameraTag;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 SceneCameraClass;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameSceneCamera_C*             Camera;                                            // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0020(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameSceneCamera_C*             CallFunc_FinishSpawningActor_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_AJBInGameSceneDirectorComponent_C_CreateSceneCamera;

// Function BP_AJBInGameSceneDirectorComponent.BP_AJBInGameSceneDirectorComponent_C.MoveCamera
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBInGameSceneDirectorComponent_C_MoveCamera final
{
public:
	float                                         Rate;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_AJBInGameSceneDirectorComponent_C_MoveCamera;

// Function BP_AJBInGameSceneDirectorComponent.BP_AJBInGameSceneDirectorComponent_C.EnableTargetFollowing
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBInGameSceneDirectorComponent_C_EnableTargetFollowing final
{
public:
	bool                                          bLookAtTarget;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_AJBInGameSceneDirectorComponent_C_EnableTargetFollowing;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
