#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameMessageManagerProxy

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function BP_AJBInGameMessageManagerProxy.BP_AJBInGameMessageManagerProxy_C.ExecuteUbergraph_BP_AJBInGameMessageManagerProxy
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBInGameMessageManagerProxy_C_ExecuteUbergraph_BP_AJBInGameMessageManagerProxy final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_MessageType;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Value1;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Value2;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_AJBInGameMessageManagerProxy_C_ExecuteUbergraph_BP_AJBInGameMessageManagerProxy;

// Function BP_AJBInGameMessageManagerProxy.BP_AJBInGameMessageManagerProxy_C.RequestMessage
// 0x000C (0x000C - 0x0000)
struct BP_AJBInGameMessageManagerProxy_C_RequestMessage final
{
public:
	int32                                         MessageType;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Value1;                                            // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Value2;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_AJBInGameMessageManagerProxy_C_RequestMessage;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
