#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBCrossfireHurricaneAffecter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AJB_structs.hpp"
#include "BP_AJBDamageAffecterBase_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBCrossfireHurricaneAffecter.BP_AJBCrossfireHurricaneAffecter_C
// 0x0050 (0x05D0 - 0x0580)
class ABP_AJBCrossfireHurricaneAffecter_C : public ABP_AJBDamageAffecterBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBCrossfireHurricaneAffecter_C; // 0x0580(0x0008)(Transient, DuplicateTransient)
	float                                         GionInterval;                                      // 0x0588(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PassiveSkillTime;                                  // 0x058C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_DamageDecal_LastingBase_C*>  FloorDecal;                                        // 0x0590(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	class FName                                   CharParamElementName;                              // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GionTag;                                           // 0x05A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           GionTimerHandler;                                  // 0x05B0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	float                                         RadiusRateForRandomGion;                           // 0x05B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5BC[0x4];                                      // 0x05BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 DamageDecalClass;                                  // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRegisterAsBurningActor;                           // 0x05C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsAssignedCharacterParams;                        // 0x05C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5CA[0x2];                                      // 0x05CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DecalRadiusMargin;                                 // 0x05CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBCrossfireHurricaneAffecter(int32 EntryPoint);
	void MC_CancelAffecter();
	void GetCauserOwnerCharacterBP(class ABP_AJBInGameCharacter_C** CharacterBP);
	void OnAddToMultipleLocationsCore(const struct FVector& Location, float Scale_0, float Radius_0, int32 SerialNumber_0, bool bRestore, float CurrentTime_0, bool StartWithRandamDelayGionAndSE);
	void GetPassiveSkillTag(struct FGameplayTag* PassiveSkillTag_0);
	void GetDuration(float* Duration);
	void CancelAffecter();
	void OnTheWorldChanged(bool bEnableTheWorld_0);
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBCrossfireHurricaneAffecter_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBCrossfireHurricaneAffecter_C")
	}
	static class ABP_AJBCrossfireHurricaneAffecter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBCrossfireHurricaneAffecter_C>();
	}
};
DUMPER7_ASSERTS_ABP_AJBCrossfireHurricaneAffecter_C;

SDK_NAMESPACE_END
