#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBCloudBarrier

#include "Basic.hpp"

#include "BP_AJBHealingBase_classes.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AJB_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBCloudBarrier.BP_AJBCloudBarrier_C
// 0x0058 (0x02D8 - 0x0280)
class UBP_AJBCloudBarrier_C final : public UBP_AJBHealingBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBCloudBarrier_C;               // 0x0280(0x0008)(Transient, DuplicateTransient)
	struct FTimerHandle                           TimerHandleAccompany;                              // 0x0288(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	float                                         CloudPointIntervalOnAccompany;                     // 0x0290(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CloudPointValueOnAccompany;                        // 0x0294(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CloudPointValueOnInteract;                         // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameParticleEffect_C*          AccompanyParticle;                                 // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SpawnParticleSocketName;                           // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           AccompanySETag;                                    // 0x02B0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           AccompanySE;                                       // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSelfAddedBefore;                                  // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bSelfAddedCurrent;                                 // 0x02C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bCPMax;                                            // 0x02C2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C3[0x5];                                      // 0x02C3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           AccompanyParticleTag;                              // 0x02C8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           AccompanyParticleTagDarkPlace;                     // 0x02D0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBCloudBarrier(int32 EntryPoint);
	void BindPairPassiveAddedLocal();
	void OnPassiveAddedLocal(const struct FGameplayTag& AddCondition, const struct FGameplayTag& SecondTag);
	void UpdateErrorTypeUI(uint8 ErrorType);
	void OnCharacterDead(const struct FGameplayTag& DamageType, class AActor* DeadActor, class AActor* DamageCauser);
	void TryVanishMyCP();
	void OnPassiveAddedServer(const struct FGameplayTag& AddCondition, const struct FGameplayTag& SecondTag);
	void ChangeEnableSelfAdded(bool bEnable);
	void ReceiveTick(float DeltaSeconds);
	void AddCloudPointContinued();
	void ReceiveBeginPlay();
	void OnLongPressInteractEnded(bool bSuccess, bool bForceCancel, class AActor* InteractActor_0, bool bFlag01, float ProgressedTime_0);
	void CheckInteractableTarget(class AActor* TargetActor, bool* bPossibleInteract);
	void TryDestroyAccompanyParticle();
	void TrySpawnAccompanyParticle();
	void CheckCondition(bool* bPossibleSelfAdded);
	void GetAccompanyParticleTag(struct FGameplayTag* AccompanyParticleTag_0);
	void TryVanishCP(class AActor* TargetActor);
	void CheckPossibleAddCPServer(class AActor* HitActor, bool* bPossible);
	void DecideSpawnParticleInfo(struct FVector* Location, struct FRotator* Rotation, class USceneComponent** SceneComponent, class FName* SocketName);
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	void GetText(bool* bSuccess, class FText* Text);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBCloudBarrier_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBCloudBarrier_C")
	}
	static class UBP_AJBCloudBarrier_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBCloudBarrier_C>();
	}
};
DUMPER7_ASSERTS_UBP_AJBCloudBarrier_C;

SDK_NAMESPACE_END
