#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBHeavensLockSkill

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "BP_AJBCloseRangeSkill_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBHeavensLockSkill.BP_AJBHeavensLockSkill_C
// 0x0038 (0x0450 - 0x0418)
class UBP_AJBHeavensLockSkill_C final : public UBP_AJBCloseRangeSkill_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBHeavensLockSkill_C;           // 0x0418(0x0008)(Transient, DuplicateTransient)
	class UAnimMontage*                           SPMontage;                                         // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AttackBeginMontageStartingSection;                 // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   BackMontageStartingSection;                        // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           HitParticleTag;                                    // 0x0438(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           HitSETag;                                          // 0x0440(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           SkillStartSETag;                                   // 0x0448(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBHeavensLockSkill(int32 EntryPoint);
	void MC_Cancel();
	void ROS_Cancel();
	void CancelStandMontage();
	void OnBlendOut_7B45FB9D406D5826C78546BC03A82A9E(class FName NotifyName);
	void OnBlendOut_7B45FB9D406D5826C78546BC85040F13(class FName NotifyName);
	void OnCompleted_7B45FB9D406D5826C78546BC03A82A9E(class FName NotifyName);
	void OnCompleted_7B45FB9D406D5826C78546BC85040F13(class FName NotifyName);
	void OnInterrupted_7B45FB9D406D5826C78546BC03A82A9E(class FName NotifyName);
	void OnInterrupted_7B45FB9D406D5826C78546BC85040F13(class FName NotifyName);
	void OnNotifyBegin_7B45FB9D406D5826C78546BC03A82A9E(class FName NotifyName);
	void OnNotifyBegin_7B45FB9D406D5826C78546BC85040F13(class FName NotifyName);
	void OnNotifyEnd_7B45FB9D406D5826C78546BC03A82A9E(class FName NotifyName);
	void OnNotifyEnd_7B45FB9D406D5826C78546BC85040F13(class FName NotifyName);
	void PlayBackAnimation();
	void PlaySkillBeginAnimation();
	void HitWait(class AActor* HitActor, class UActorComponent* HitComponent, const struct FVector& HitLocation, const struct FVector& HitNormal, float CuttingRate, EPhysicalSurface SurfaceType, bool bDisableDamage, bool bInvincible, bool bIsPenetration, bool bBlockedByAAP, bool bHeadShot, bool bAvoidSkill);
	void PlayHitSE(class AActor* HitActor, const struct FVector& HitLocation, EPhysicalSurface SurfaceType, bool bBlockedByAAP, bool bHeadShot);
	void OnCancel();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBHeavensLockSkill_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBHeavensLockSkill_C")
	}
	static class UBP_AJBHeavensLockSkill_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBHeavensLockSkill_C>();
	}
};
DUMPER7_ASSERTS_UBP_AJBHeavensLockSkill_C;

SDK_NAMESPACE_END
