#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBRoadRollerPreview

#include "Basic.hpp"

#include "BP_AJBPreviewBase_classes.hpp"
#include "Engine_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBRoadRollerPreview.BP_AJBRoadRollerPreview_C
// 0x0028 (0x0390 - 0x0368)
class ABP_AJBRoadRollerPreview_C final : public ABP_AJBPreviewBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBRoadRollerPreview_C;          // 0x0368(0x0008)(Transient, DuplicateTransient)
	class UStaticMeshComponent*                   PreviewSphereInner;                                // 0x0370(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   PreviewSphereOuter;                                // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        ImpulseDecal;                                      // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DMI_Impulse;                                       // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBRoadRollerPreview(int32 EntryPoint);
	void ChangeRoadRollerVisibility(bool bEnable);
	void ReceiveBeginPlay();
	void SetDecalParameter();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBRoadRollerPreview_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBRoadRollerPreview_C")
	}
	static class ABP_AJBRoadRollerPreview_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBRoadRollerPreview_C>();
	}
};
DUMPER7_ASSERTS_ABP_AJBRoadRollerPreview_C;

SDK_NAMESPACE_END
