#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBBubbleLauncherSkill

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "BP_AJBProjectileSkill_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBBubbleLauncherSkill.BP_AJBBubbleLauncherSkill_C
// 0x0030 (0x02D8 - 0x02A8)
class UBP_AJBBubbleLauncherSkill_C final : public UBP_AJBProjectileSkill_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBBubbleLauncherSkill_C;        // 0x02A8(0x0008)(Transient, DuplicateTransient)
	TArray<class ABP_AJBInGameParticleEffect_C*>  LoopParticleEffects;                               // 0x02B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, AdvancedDisplay)
	float                                         DamageRateToVampire___;                            // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHamonRateEnabled;                                // 0x02C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C5[0x3];                                      // 0x02C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           ShotNormalSETag;                                   // 0x02C8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ShotHamonSETag;                                    // 0x02D0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBBubbleLauncherSkill(int32 EntryPoint);
	void GetOwnerHamonStatus(bool* bIsHamonMode);
	void GetShotSETag(struct FGameplayTag* ShotSETag_0);
	void SpawnGion(const struct FVector& Location, const struct FGameplayTag& GionTag);
	void ChangeLaunchParticleDilation(bool bEnable);
	void TryDestroyLoopParticle();
	void SpawnLaunchParticle();
	void OnBeginState_Shot();
	void SpawnProjectile(class ABP_AJBInGameCharacter_C* OwnerCharacter, const struct FVector& Location, const struct FRotator& Rotation, bool IsAttackBySeparatedStand, class ABP_AJBInGameProjectile_C** SpawnedProjectile);
	void ShouldApplyHamonRateDirectly(bool* ShouldApplyDirectly);
	void IsHamonRateEnabledSkill(bool* IsEnabled);
	void GetVampireDamageRate(float* VampireDamageRate);
	void IsPossibleHamonBreathingOnCameraOnlyEnabled(bool* bPossible);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBBubbleLauncherSkill_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBBubbleLauncherSkill_C")
	}
	static class UBP_AJBBubbleLauncherSkill_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBBubbleLauncherSkill_C>();
	}
};
DUMPER7_ASSERTS_UBP_AJBBubbleLauncherSkill_C;

SDK_NAMESPACE_END
