#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBHamonMode

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "BP_AJBPassiveSkillBase_classes.hpp"
#include "AJB_structs.hpp"
#include "AkAudio_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBHamonMode.BP_AJBHamonMode_C
// 0x0030 (0x0248 - 0x0218)
class UBP_AJBHamonMode_C : public UBP_AJBPassiveSkillBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBHamonMode_C;                  // 0x0218(0x0008)(Transient, DuplicateTransient)
	float                                         MoveSpeedRate;                                     // 0x0220(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Attack___;                                         // 0x0224(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Defence___;                                        // 0x0228(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           HamonLoopSE;                                       // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           EndParticleTag;                                    // 0x0238(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bAttachEndParticleForMesh;                         // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_AJBHamonMode(int32 EntryPoint);
	void OnPassiveRemoved(const struct FGameplayTag& RemoveCondition, const struct FGameplayTag& SecondTag, class ABP_AJBInGameCharacter_C* CharacterBP);
	void OnPassiveAdded(const struct FGameplayTag& AddCondition, const struct FGameplayTag& SecondTag);
	void Internal_Setup_Hamon_LoopSE();
	void SpawnEndParticle();
	void Play_Hamon_EndSE();
	void End_Hamon_LoopSE();
	void Pause_Hamon_LoopSE();
	void UnlockResumeGate_Breathing_LoopSE();
	void OnEnd_Hamon_LoopSE(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo);
	void Resume_Hamon_LoopSE();
	void Play_Hamon_LoopSE();
	void PlayInactiveSE();
	void StopSE(class UObject* Causer);
	void PlaySE(class UObject* Causer);
	void ReceiveBeginPlay();
	void OnContinuedParticleActivated();
	void OnActionInactivate(bool bTriggeredByStand);
	void OnActionActivate(bool bTriggeredByStand);
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBHamonMode_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBHamonMode_C")
	}
	static class UBP_AJBHamonMode_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBHamonMode_C>();
	}
};
DUMPER7_ASSERTS_UBP_AJBHamonMode_C;

SDK_NAMESPACE_END
