#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBClairvoyance

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_AJBPassiveSkillBase_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBClairvoyance.BP_AJBClairvoyance_C
// 0x0040 (0x0258 - 0x0218)
class UBP_AJBClairvoyance_C final : public UBP_AJBPassiveSkillBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBClairvoyance_C;               // 0x0218(0x0008)(Transient, DuplicateTransient)
	class UMaterialInterface*                     MT_UnderWaterClairvoyance;                         // 0x0220(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterial*                              MT_Clairvoyance;                                   // 0x0228(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaterialIndex_Character;                           // 0x0230(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaterialIndex_MovableStand;                        // 0x0234(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Time;                                              // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Distance;                                          // 0x023C(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DMI_Clairvoyance;                                  // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            CV_Opacity;                                        // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           UpdateParametersTimerHandle;                       // 0x0250(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_BP_AJBClairvoyance(int32 EntryPoint);
	void ChangeEnablePPMaterials(bool bEnable);
	void OnParametersUpdated();
	void OnTimelineFinished();
	void SetParameter_Server(float Time_0, float Distance_0);
	void ReverseTimelines();
	void PlayTimelines();
	void ReverseOpacityTimeline();
	void PlayOpacityTimeline();
	void UpdateParameters();
	void ChangeEnablePPMaterial(class AAJBInGameCharacterBase* CharacterBase, bool bEnable, int32& MaterialIndexRef);
	void OnRep_Distance();
	void TryCreateDMI();
	void PlayInactiveSE();
	void PlaySE(class UObject* Causer);
	void OnActionInactivate(bool bTriggeredByStand);
	void OnActionActivate(bool bTriggeredByStand);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBClairvoyance_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBClairvoyance_C")
	}
	static class UBP_AJBClairvoyance_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBClairvoyance_C>();
	}
};
DUMPER7_ASSERTS_UBP_AJBClairvoyance_C;

SDK_NAMESPACE_END
