#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBContinuationHealing

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "BP_AJBPassiveSkillBase_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBContinuationHealing.BP_AJBContinuationHealing_C
// 0x0040 (0x0258 - 0x0218)
class UBP_AJBContinuationHealing_C : public UBP_AJBPassiveSkillBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBContinuationHealing_C;        // 0x0218(0x0008)(Transient, DuplicateTransient)
	float                                         HealInterval_s_;                                   // 0x0220(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HealingValue;                                      // 0x0224(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HealingMaxPercentage___;                           // 0x0228(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           EffectLoopParticleTag;                             // 0x0230(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           EffectSETag;                                       // 0x0238(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInitialized;                                     // 0x0240(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameParticleEffect_C*          CurrentParticle;                                   // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RemainingTime;                                     // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBContinuationHealing(int32 EntryPoint);
	void SetParticleVisibility(bool bNewVisibility);
	void OnEffected__Server_();
	void MC_EndParticle();
	void MC_BeginParticle();
	void MC_OnApplyEffect();
	void TimerTick(float DeltaSeconds);
	void GetHealingLimitation(class ABP_AJBInGameCharacter_C* Target, int32* MaxHP);
	void SetRemainingTime(float NewValue);
	void SubRemainingTime(float Value);
	void OnActionInactivate(bool bTriggeredByStand);
	void OnActionActivate(bool bTriggeredByStand);
	void ReceiveTick(float DeltaSeconds);
	void ChangeParticleVisibility(bool bNewVisibility);
	void TryChangeParticleVisibility(bool bNewVisibility);

	void GetIntervalTime(float* IntervalTime) const;
	void GetRemainingTime(float* RemainingTime_0) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBContinuationHealing_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBContinuationHealing_C")
	}
	static class UBP_AJBContinuationHealing_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBContinuationHealing_C>();
	}
};
DUMPER7_ASSERTS_UBP_AJBContinuationHealing_C;

SDK_NAMESPACE_END
