#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBMemoryLeakBuff

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "BP_AJBPassiveSkillBase_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBMemoryLeakBuff.BP_AJBMemoryLeakBuff_C
// 0x0070 (0x0288 - 0x0218)
class UBP_AJBMemoryLeakBuff_C final : public UBP_AJBPassiveSkillBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBMemoryLeakBuff_C;             // 0x0218(0x0008)(Transient, DuplicateTransient)
	int32                                         PhaseNum;                                          // 0x0220(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MoveSpeedIncrement___;                             // 0x0224(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AttackIncrement___;                                // 0x0228(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MPMaxIncrement1st___;                              // 0x022C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                 CurrentPhaseList;                                  // 0x0230(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FGameplayTag>                   StatusBuffTag;                                     // 0x0240(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          bDebugPrintPhase;                                  // 0x0250(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bDebugPrintValueOnApply;                           // 0x0251(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_252[0x6];                                      // 0x0252(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           BuffSETag;                                         // 0x0258(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GrowupTag_Attackup;                                // 0x0260(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GrowupTag_MaxMP;                                   // 0x0268(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         MPMaxIncrement2nd___;                              // 0x0270(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MPMaxIncrement3rd___;                              // 0x0274(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MPMaxIncrement4th___;                              // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MPMaxIncrement5th___;                              // 0x027C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MPMaxIncrement6th___;                              // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBMemoryLeakBuff(int32 EntryPoint);
	void MC_ApplyBuff(const struct FGameplayTag& ApplyBuffTag, int32 NextPhase);
	void RequestBuff();
	void LotteryBuff(struct FGameplayTag* LotteryTag, int32* NextPhase);
	void CheckBuffLimit(bool* bLimit);
	void DebugTick();
	void ApplyBuff(const struct FGameplayTag& ApplyBuffTag, int32 NextPhase);
	void GetTagIndex(const struct FGameplayTag& Tag, int32* Index_0);
	void CalcMoveSpeed(int32 Phase, float* Value);
	void CalcAttack(int32 Phase, float* Value);
	void CalcMPMax(int32 Phase, float* Value);
	void GetMPMaxIncrement(int32 Phase, float* Value);
	void ActiveContinuedParticle(bool bActiveForOwner, bool bActiveForMovableStand);
	void ReceiveBeginPlay();
	void OnActionActivate(bool bTriggeredByStand);
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBMemoryLeakBuff_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBMemoryLeakBuff_C")
	}
	static class UBP_AJBMemoryLeakBuff_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBMemoryLeakBuff_C>();
	}
};
DUMPER7_ASSERTS_UBP_AJBMemoryLeakBuff_C;

SDK_NAMESPACE_END
