#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBTinglingSkill

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_structs.hpp"
#include "BP_AJBCloseRangeSkill_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBTinglingSkill.BP_AJBTinglingSkill_C
// 0x00C8 (0x04E0 - 0x0418)
class UBP_AJBTinglingSkill_C final : public UBP_AJBCloseRangeSkill_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBTinglingSkill_C;              // 0x0418(0x0008)(Transient, DuplicateTransient)
	struct FRotator                               LocalCameraRotate;                                 // 0x0420(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42C[0x4];                                      // 0x042C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBTubeBase_C*                      TubeActor;                                         // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameParticleEffect_C*          TinglingParticles;                                 // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSkillButtonPressed;                              // 0x0440(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_441[0x3];                                      // 0x0441(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Damage_FzStyle;                                    // 0x0444(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Damage_VpStyle;                                    // 0x0448(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HealValue;                                         // 0x044C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GiveFzConditionValue;                              // 0x0450(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_454[0x4];                                      // 0x0454(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           FzStyleGivePassive;                                // 0x0458(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ShotGion;                                          // 0x0460(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         RollSpeed;                                         // 0x0468(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TempRollValue;                                     // 0x046C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RedashWaitTime;                                    // 0x0470(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DashToBackTime;                                    // 0x0474(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MinDashToBackTime;                                 // 0x0478(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TempReDashWaitTIme;                                // 0x047C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameParticleEffect_C*          ActiveParticle;                                    // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReadyTime;                                         // 0x0488(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               FixedOwnerRot;                                     // 0x048C(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         HealRate;                                          // 0x0498(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalDashTime;                                     // 0x049C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldTraceTimingMeshUpdate;                      // 0x04A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4A1[0x3];                                      // 0x04A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MeshUpdateTime;                                    // 0x04A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReadyTimeCount;                                    // 0x04A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RedashTimeCount;                                   // 0x04AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_AJBTubeBase_C*>              CacheTubeActors;                                   // 0x04B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                         SpawnTinglingTubeCount;                            // 0x04C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C4[0x4];                                      // 0x04C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 DamageDecalClassVpStyle;                           // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 DamageDecalClassFzStyle;                           // 0x04D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCacheVoiceSpoken;                                 // 0x04D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D9[0x3];                                      // 0x04D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ForceCancellTime;                                  // 0x04DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBTinglingSkill(int32 EntryPoint);
	void PressSpecialButton();
	void ChargingStateAction_Local();
	void NoneStateAction_Local();
	void MC_Replicate_Fixed_Rot(const struct FRotator& OwnerRot);
	void ROS_Replicate_Fixed_Rot(const struct FRotator& OwnerRot);
	void Replicate_Fixed_Rot();
	void ReleaseSpecialButton();
	void SetDamageDestinationActor(class AActor* DestinationActor);
	void TickTinglingTube(float DeltaSecond);
	void GetShotPointLocation(struct FVector* ShotPointLocation);
	void GetDistancePercent(float* Percent);
	void GetTinglingDamage(int32* Damage_0);
	void SetPassiveSkillTag();
	void InitTinglingTube();
	void DestroyTInglingTubeActor(class ABP_AJBTubeBase_C* TubeActor_0);
	void FixedRotTinglingTube();
	void GetGiveFzConditionValue(float* Value);
	void IsVpStyle(bool* IsVpStyle_0);
	void GetLaunchRot(struct FRotator* Rot);
	void ChangeShouldTraceTimingMeshUpdate(float DeltaTime);
	void GetTube(class ABP_AJBTubeBase_C** TubeActor_0);
	void SpawnTinglingTube();
	void GetLastLaunchpartLocationDistancePercent(float* Percent);
	void CheckGivePassiveForVoice(class UObject* HitActor, bool* GivePassive);
	void CheckHealForVoice(const struct FGameplayTag& SkillTag_0, class AActor* TargetActor_0, int32 Damage_0, float CuttingRate, float HealRate_0, bool* CanHealVoice, bool* RemainHP);
	void CheckSpeakVoice(bool* Queued);
	void OnEndState(bool bCancel, bool bRestore);
	void PlayBackAnimation();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void OnDash(uint8 RepeatCount_0, bool bRedash);
	void Update_AccompanyWait(float DeltaSeconds);
	void HitWait(class AActor* HitActor, class UActorComponent* HitComponent, const struct FVector& HitLocation, const struct FVector& HitNormal, float CuttingRate, EPhysicalSurface SurfaceType, bool bDisableDamage, bool bInvincible, bool bIsPenetration, bool bBlockedByAAP, bool bHeadShot, bool bAvoidSkill);
	void AccompanyWait();
	void TryGetDamageActor(class ABP_AJBDamageActor_C** DamageActor_0);
	void PlayHitSE(class AActor* HitActor, const struct FVector& HitLocation, EPhysicalSurface SurfaceType, bool bBlockedByAAP, bool bHeadShot);
	void GetDashParticleTag(struct FGameplayTag* DashParticleTag_0);
	void GetPoliticDamage(bool bHeadShot, bool OnSpawnDamageActor, int32* Damage_0);
	void GetLaunchedActorTarget(class AActor** LauncedActor);
	void SpawnDamageDecal(const struct FVector& Location);
	void GenerateHitEffect(class AActor* HitActor, const struct FVector& HitLocation, const struct FVector& HitNomal, const struct FRotator& HitRotation, const struct FGameplayTag& DamageType, bool HeadShot, EPhysicalSurface SurfaceType, bool BlockedbyAAP, bool GenerateSufaceParticle, bool UseSurfaceParticleLighter);
	void StateBeginPlay(bool bShouldRestore);
	void ReceiveBeginPlay();
	void OnCancel();
	void OnActive();
	void OnInactive();
	void ReceiveTick(float DeltaSeconds);
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	void InitializeVariables();
	void GetPassiveSkillTag(struct FGameplayTag* PassiveSkillTag_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBTinglingSkill_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBTinglingSkill_C")
	}
	static class UBP_AJBTinglingSkill_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBTinglingSkill_C>();
	}
};
DUMPER7_ASSERTS_UBP_AJBTinglingSkill_C;

SDK_NAMESPACE_END
