#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameLifeTimeComponentBase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function BP_AJBInGameLifeTimeComponentBase.BP_AJBInGameLifeTimeComponentBase_C.ExecuteUbergraph_BP_AJBInGameLifeTimeComponentBase
// 0x0050 (0x0050 - 0x0000)
struct BP_AJBInGameLifeTimeComponentBase_C_ExecuteUbergraph_BP_AJBInGameLifeTimeComponentBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBlockedToExpiredEvent_IsBlocked;        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        K2Node_CustomEvent_Component1;                     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bReset;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetElapsedTimeInGame_ElapsedTime;         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasLifeTimeExpired_HasExpired;            // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UActorComponent*                        K2Node_CustomEvent_Component;                      // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActive_ReturnValue;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UActorComponent* Component, bool bReset)> K2Node_CreateDelegate_OutputDelegate; // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UActorComponent* Component)> K2Node_CreateDelegate_OutputDelegate1;         // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
};
DUMPER7_ASSERTS_BP_AJBInGameLifeTimeComponentBase_C_ExecuteUbergraph_BP_AJBInGameLifeTimeComponentBase;

// Function BP_AJBInGameLifeTimeComponentBase.BP_AJBInGameLifeTimeComponentBase_C.OnDeactivated
// 0x0008 (0x0008 - 0x0000)
struct BP_AJBInGameLifeTimeComponentBase_C_OnDeactivated final
{
public:
	class UActorComponent*                        Component;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_AJBInGameLifeTimeComponentBase_C_OnDeactivated;

// Function BP_AJBInGameLifeTimeComponentBase.BP_AJBInGameLifeTimeComponentBase_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBInGameLifeTimeComponentBase_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_AJBInGameLifeTimeComponentBase_C_ReceiveTick;

// Function BP_AJBInGameLifeTimeComponentBase.BP_AJBInGameLifeTimeComponentBase_C.OnActivated
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBInGameLifeTimeComponentBase_C_OnActivated final
{
public:
	class UActorComponent*                        Component;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReset;                                            // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_AJBInGameLifeTimeComponentBase_C_OnActivated;

// Function BP_AJBInGameLifeTimeComponentBase.BP_AJBInGameLifeTimeComponentBase_C.GetElapsedTimeInGame
// 0x0020 (0x0020 - 0x0000)
struct BP_AJBInGameLifeTimeComponentBase_C_GetElapsedTimeInGame final
{
public:
	float                                         ElapsedTime;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBInGameGameState_bIsValid;           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBInGameGameState*                    CallFunc_GetAJBInGameGameState_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimespan                              CallFunc_GetElapsedInGameTimespan_ReturnValue;     // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalSeconds_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_AJBInGameLifeTimeComponentBase_C_GetElapsedTimeInGame;

// Function BP_AJBInGameLifeTimeComponentBase.BP_AJBInGameLifeTimeComponentBase_C.SetLifeTime
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBInGameLifeTimeComponentBase_C_SetLifeTime final
{
public:
	float                                         LifeTime_0;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_AJBInGameLifeTimeComponentBase_C_SetLifeTime;

// Function BP_AJBInGameLifeTimeComponentBase.BP_AJBInGameLifeTimeComponentBase_C.UpdateRemainingTime
// 0x0014 (0x0014 - 0x0000)
struct BP_AJBInGameLifeTimeComponentBase_C_UpdateRemainingTime final
{
public:
	bool                                          CallFunc_IsTimerPaused_IsPaused;                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetElapsedTimeInGame_ElapsedTime;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue1;         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_AJBInGameLifeTimeComponentBase_C_UpdateRemainingTime;

// Function BP_AJBInGameLifeTimeComponentBase.BP_AJBInGameLifeTimeComponentBase_C.GetRemainingLifeTime
// 0x0004 (0x0004 - 0x0000)
struct BP_AJBInGameLifeTimeComponentBase_C_GetRemainingLifeTime final
{
public:
	float                                         RemainingLifeTime_0;                               // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_AJBInGameLifeTimeComponentBase_C_GetRemainingLifeTime;

// Function BP_AJBInGameLifeTimeComponentBase.BP_AJBInGameLifeTimeComponentBase_C.HasLifeTimeExpired
// 0x0002 (0x0002 - 0x0000)
struct BP_AJBInGameLifeTimeComponentBase_C_HasLifeTimeExpired final
{
public:
	bool                                          HasExpired;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_AJBInGameLifeTimeComponentBase_C_HasLifeTimeExpired;

// Function BP_AJBInGameLifeTimeComponentBase.BP_AJBInGameLifeTimeComponentBase_C.IsBlockedToExpiredEvent
// 0x0002 (0x0002 - 0x0000)
struct BP_AJBInGameLifeTimeComponentBase_C_IsBlockedToExpiredEvent final
{
public:
	bool                                          IsBlocked;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTimerPaused_IsPaused;                   // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_AJBInGameLifeTimeComponentBase_C_IsBlockedToExpiredEvent;

// Function BP_AJBInGameLifeTimeComponentBase.BP_AJBInGameLifeTimeComponentBase_C.IsTimerPaused
// 0x0002 (0x0002 - 0x0000)
struct BP_AJBInGameLifeTimeComponentBase_C_IsTimerPaused final
{
public:
	bool                                          IsPaused;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckActiveBitesTheDust_ReturnValue;      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_AJBInGameLifeTimeComponentBase_C_IsTimerPaused;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
