#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBRunAway

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "BP_AJBSupportSkillBase_classes.hpp"
#include "AJB_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBRunAway.BP_AJBRunAway_C
// 0x0028 (0x0180 - 0x0158)
class UBP_AJBRunAway_C final : public UBP_AJBSupportSkillBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBRunAway_C;                    // 0x0158(0x0008)(Transient, DuplicateTransient)
	int32                                         LeftDamagePercent;                                 // 0x0160(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_164[0x4];                                      // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           RunAwaySETag;                                      // 0x0168(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           RunAwayPassiveTag;                                 // 0x0170(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           RunAwayVoiceTag;                                   // 0x0178(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBRunAway(int32 EntryPoint);
	void ROC_RunAwayActivated();
	void OnRunAwayActivated(const struct FGameplayTag& DamageType);
	void OnPlayDamageVoice_Local(bool bCausedByDamageArea);
	void OnPassiveRemoved(const struct FGameplayTag& RemoveCondition, const struct FGameplayTag& SecondTag, class ABP_AJBInGameCharacter_C* CharacterBP);
	void OnReceiveDamage_Server(int32 Damage, const struct FGameplayTag& DamageType, class AActor* DamageCauser, bool bRemainHP, bool bDamageIsCut, bool bNotUseCollision, bool bSelfDamage);
	void OnActionActivate(bool bTriggeredByStand);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBRunAway_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBRunAway_C")
	}
	static class UBP_AJBRunAway_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBRunAway_C>();
	}
};
DUMPER7_ASSERTS_UBP_AJBRunAway_C;

SDK_NAMESPACE_END
