#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "GameplayTags_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBInGameItem.BP_AJBInGameItem_C
// 0x0050 (0x0378 - 0x0328)
class ABP_AJBInGameItem_C : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(Transient, DuplicateTransient)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          IsConsume;                                         // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           ItemTag;                                           // 0x0348(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           GettingParticleTag;                                // 0x0350(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ConsumeEffectTag;                                  // 0x0358(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ConsumeSETag;                                      // 0x0360(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnComsume;                                         // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_BP_AJBInGameItem(int32 EntryPoint);
	void RestoreLocal();
	void ConsumeLocal();
	void OnConsumedServer(class ABP_AJBInGameCharacter_C* TargetCharacter, bool bSpaceShaving);
	void MC_RequestConsumeEffect(class ABP_AJBInGameCharacter_C* Character, bool bSpaceShaving);
	void TryConsume(class ABP_AJBInGameCharacter_C* HitCharacter, int32 PlayerIndex, bool bSpaceShaving);
	void OnROS_Consume(class ABP_AJBInGameCharacter_C* HitCharacter, bool bSpaceShaving);
	void BndEvt__Sphere_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void UserConstructionScript();
	void GetPoliticTarget(class ABP_AJBInGameCharacter_C* HitCharacter, class ABP_AJBInGameCharacter_C** TargetCharacter);
	void CheckGetOnSpaceShaving(class AActor* SkillOwner, bool* bGet);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBInGameItem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBInGameItem_C")
	}
	static class ABP_AJBInGameItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBInGameItem_C>();
	}
};
DUMPER7_ASSERTS_ABP_AJBInGameItem_C;

SDK_NAMESPACE_END
