#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBTheWorldHandler

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AJB_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBTheWorldHandler.BP_AJBTheWorldHandler_C
// 0x0028 (0x0118 - 0x00F0)
class UBP_AJBTheWorldHandler_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00F0(0x0008)(Transient, DuplicateTransient)
	class UWB_Skill_TheWorld_C*                   TargetWidget;                                      // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TheWorldActive;                                    // 0x0100(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x3];                                      // 0x0101(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CachedTheWorldRemainingTime;                       // 0x0104(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBInGameCharacter*                    TargetCharacter;                                   // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LocalTheWorldElapsedTime;                          // 0x0110(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Delta;                                             // 0x0114(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBTheWorldHandler(int32 EntryPoint);
	void UpdateTheWorldUIColor();
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void SetupWidget(class UWB_Skill_TheWorld_C* Widget);
	void OnNotifyTheWorld(EGeneralTiming Timing);
	void ChangeTheWorldUIColor(bool bEnemyColor);
	void SetupTargetCharacter(class AAJBInGameCharacter* TargetCharacter_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBTheWorldHandler_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBTheWorldHandler_C")
	}
	static class UBP_AJBTheWorldHandler_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBTheWorldHandler_C>();
	}
};
DUMPER7_ASSERTS_UBP_AJBTheWorldHandler_C;

SDK_NAMESPACE_END
