#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBZipper_Thru

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_AJBZipper_InteractableBase_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBZipper_Thru.BP_AJBZipper_Thru_C
// 0x0068 (0x0430 - 0x03C8)
class ABP_AJBZipper_Thru_C final : public ABP_AJBZipper_InteractableBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBZipper_Thru_C;                // 0x03C8(0x0008)(Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_ZipperPlane_2;                                  // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_ZipperPlane_1;                                  // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal1;                                            // 0x03E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        EmitterSpawnPoint_Origin;                          // 0x03E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        EmitterSpawnPoint_Counterpart;                     // 0x03F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          InteractTriggerCounterpart;                        // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMeshCounterpart;                             // 0x0400(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          bRep_Interacted;                                   // 0x0408(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bDisplayDebugInfo;                                 // 0x0409(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_40A[0x2];                                      // 0x040A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Rep_SecondLocation;                                // 0x040C(0x000C)(Edit, BlueprintVisible, Net, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector                                Rep_LocationOfInjectionCounterpart;                // 0x0418(0x000C)(Edit, BlueprintVisible, Net, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector                                Rep_LocationOfInjectionOrigin;                     // 0x0424(0x000C)(Edit, BlueprintVisible, Net, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBZipper_Thru(int32 EntryPoint);
	void OnInteractionBlocked(class AActor* InteractingActor);
	void ReceiveBeginPlay();
	void OnROSInteract(class AActor* InteractingActor, bool ServerIsInteractingPlayer);
	void MC_CloseAndDestroy();
	void ServerNotifyOnExit(bool bOriginToCounterpart);
	void ServerNotifyOnEnter(bool bOriginToCounterpart);
	void MC_ShowExitEffect(bool bOriginToCounterpart);
	void MC_ShowEnterEffect(bool bOriginToCounterpart);
	void FitInteractTriggers();
	bool Interactable(class ABP_AJBInGameCharacter_C* Character, float TraceLength);
	void TryGetInteractableText(class ABP_AJBInGameCharacter_C* OperatorCharacter, bool* bSuccess, class FText* InteractMessage);
	bool IfEnteringOriginToCounterpart(class AActor* Actor);
	void AdjustLocationOfInjection(bool bAdjustOrigin, int32 TrialNum, float InInteractionBuffer, bool* bFound, struct FVector* Location);
	void UserConstructionScript();
	void OnLocalInteract(class AActor* InteractingActor, bool* bSuccess);
	bool IfNeedsExclusiveInteractStrictly();
	void GetInteractBoundForCulling(class AActor* InteractingActor, struct FVector* Center, float* Radius);
	bool IfBlockInteract(class AActor* InteractingActor);
	void ShouldPrioritizedThanPrepaidSkillCancel(bool* bShouldPriorirized);
	struct FVector NormalOfEntrance(bool bOriginToCounterpart);
	struct FVector LocationExitTo(bool bOriginToCounterpart);
	struct FVector LocationExitFrom(bool bOriginToCounterpart);
	struct FVector LocationEnterTo(bool bOriginToCounterpart);
	struct FVector LocationEnterFrom(class ABP_AJBInGameCharacter_C* Character, bool bOriginToCounterpart);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBZipper_Thru_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBZipper_Thru_C")
	}
	static class ABP_AJBZipper_Thru_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBZipper_Thru_C>();
	}
};
DUMPER7_ASSERTS_ABP_AJBZipper_Thru_C;

SDK_NAMESPACE_END
