#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBCrossfireHurricaneImpulse

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_AJBDamageImpulseBase_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBCrossfireHurricaneImpulse.BP_AJBCrossfireHurricaneImpulse_C
// 0x0028 (0x04D8 - 0x04B0)
class ABP_AJBCrossfireHurricaneImpulse_C : public ABP_AJBDamageImpulseBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBCrossfireHurricaneImpulse_C;  // 0x04B0(0x0008)(Transient, DuplicateTransient)
	float                                         BurningTime;                                       // 0x04B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BC[0x4];                                      // 0x04BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CharaParamElementName;                             // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 AffecterClass;                                     // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseMultipleLocations;                              // 0x04D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D1[0x3];                                      // 0x04D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AfterSpawnCheckTraceBuffer;                        // 0x04D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBCrossfireHurricaneImpulse(int32 EntryPoint);
	class UAJBInGameSkillComponent* GetSkillClass(class AActor* Owner_0);
	void ShouldAddCFHAffecter(TArray<struct FHitResult>& HitResults, bool* bShouldAdd);
	void ReceiveBeginPlay();
	void OnBeginState_Active();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBCrossfireHurricaneImpulse_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBCrossfireHurricaneImpulse_C")
	}
	static class ABP_AJBCrossfireHurricaneImpulse_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBCrossfireHurricaneImpulse_C>();
	}
};
DUMPER7_ASSERTS_ABP_AJBCrossfireHurricaneImpulse_C;

SDK_NAMESPACE_END
