#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameCharacter_ABC

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_AJBInGameCharacter_classes.hpp"
#include "AJB_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBInGameCharacter_ABC.BP_AJBInGameCharacter_ABC_C
// 0x0040 (0x18A0 - 0x1860)
class ABP_AJBInGameCharacter_ABC_C final : public ABP_AJBInGameCharacter_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBInGameCharacter_ABC_C;        // 0x1858(0x0008)(Transient, DuplicateTransient)
	class UBP_AJBRecording_C*                     BP_AJBRecording;                                   // 0x1860(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBTrackerManager_C*                BP_AJBTrackerManager;                              // 0x1868(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBReplay_C*                        BP_AJBReplay;                                      // 0x1870(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBGangReadinessSkill_C*            BP_AJBGangReadinessSkill;                          // 0x1878(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBDubbingSkill_C*                  BP_AJBDubbingSkill;                                // 0x1880(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBMoodyRushSkill_C*                BP_AJBMoodyRushSkill;                              // 0x1888(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBAccompanyMDBSkill_C*             BP_AJBAccompanyMDBSkill;                           // 0x1890(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameCharacter_MDB_C*           MDBCharacterBP;                                    // 0x1898(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBInGameCharacter_ABC(int32 EntryPoint);
	void NotifyTheWorldOnEventGraph(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ShouldValidDamageType(const struct FGameplayTag& DamageType, bool bPenetrateAP, bool* bValid);
	void GetPropertyStand(class ABP_AJBInGameCharacter_C** PropertyStandBP);
	void CheckExistPropertyStand(bool* bExist);
	void CheckTransfer(bool* bTransfer);
	void OnRep_MatchingPlayerIndex();
	void TryToShareMatchingPlayerIndexWithStand(int32 MatchingPlayerIndex_0);
	void SetupSharedController();
	void ReceiveBeginPlay();
	void ReleasedButton_ActiveSpecial();
	void PressedButton_ActiveSpecial();
	void PressedButton_Ultimate();
	void PressedButton_ActiveBase();
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	void ReleasedButton_Basic();
	void PressedButton_Basic();
	void UserConstructionScript();
	void CalcDamageRate(class AActor* DamagedActor, const struct FGameplayTag& DamageType, float* DamageRate);
	void PredictionAttackHit(bool* bHit);
	void PreConsumeHP(int32 LeftDamageForHP, const struct FGameplayTag& DamageType, bool bPenetrateAP, int32* OverrideLeftDamageForHP);
	void OnBeforeInteract(bool* bShouldInteract);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBInGameCharacter_ABC_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBInGameCharacter_ABC_C")
	}
	static class ABP_AJBInGameCharacter_ABC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBInGameCharacter_ABC_C>();
	}
};
DUMPER7_ASSERTS_ABP_AJBInGameCharacter_ABC_C;

SDK_NAMESPACE_END
