#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBAIDummyPlayerInputComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBAIDummyPlayerInputComponent.BP_AJBAIDummyPlayerInputComponent_C
// 0x0028 (0x0118 - 0x00F0)
class UBP_AJBAIDummyPlayerInputComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00F0(0x0008)(Transient, DuplicateTransient)
	int32                                         PlayerIndex;                                       // 0x00F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_FC[0x4];                                       // 0x00FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      PlayerController;                                  // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  DummyPawn;                                         // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          AIController;                                      // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBAIDummyPlayerInputComponent(int32 EntryPoint);
	void ReceiveBeginPlay();
	class APawn* GetPlayerPawn();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBAIDummyPlayerInputComponent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBAIDummyPlayerInputComponent_C")
	}
	static class UBP_AJBAIDummyPlayerInputComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBAIDummyPlayerInputComponent_C>();
	}
};
DUMPER7_ASSERTS_UBP_AJBAIDummyPlayerInputComponent_C;

SDK_NAMESPACE_END
