#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBERaySkill

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AJB_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_AJBSkillBase_classes.hpp"
#include "AkAudio_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBERaySkill.BP_AJBERaySkill_C
// 0x0130 (0x0318 - 0x01E8)
class UBP_AJBERaySkill_C final : public UBP_AJBSkillBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBERaySkill_C;                  // 0x01E8(0x0008)(Transient, DuplicateTransient)
	float                                         CantCancellTime;                                   // 0x01F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBERayAffecter_C*                  ERayImpactAffecter;                                // 0x01F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InputActionButton;                                 // 0x0200(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 ERayAffecterClass;                                 // 0x0208(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           ERayActionAnimLoop;                                // 0x0210(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StopMontageBlendTIme;                              // 0x0218(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AttackRange;                                       // 0x021C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         GaugeValue;                                        // 0x0220(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IncreaseGaugeValue;                                // 0x0224(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DefaultGaugeValue;                                 // 0x0228(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         s__BP_AJBERaySkill_C;                              // 0x022C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ERayActiveGionTag;                                 // 0x0230(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           ERayActiveGion;                                    // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ATextRenderActor*                       TestGaugeValueText;                                // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         s__;                                               // 0x0248(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CameraSpeedScale;                                  // 0x024C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MoveSpeedScaleOnAction;                            // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ERayGaugeList_C*                    WB_ERayGaugeList;                                  // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ERayStartSETag;                                    // 0x0260(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ERayLoopSETag;                                     // 0x0268(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           ERayLoopSE;                                        // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      TraceObjectType;                                   // 0x0278(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class ABP_AJBInGameParticleEffect_C*>  ERayImpactParticles;                               // 0x0288(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                         MaxImpactParticleCount;                            // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CreatedImpactParticleCount;                        // 0x029C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         UseImpactParticle;                                 // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A4[0x4];                                      // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           EndParticleTag;                                    // 0x02A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               TempLastLaserRot;                                  // 0x02B0(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         ReadyTime;                                         // 0x02BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalDashTime;                                     // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldTraceTimingMeshUpdate;                      // 0x02C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C5[0x3];                                      // 0x02C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MeshUpdateTime;                                    // 0x02C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2CC[0x4];                                      // 0x02CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           VoiceTag;                                          // 0x02D0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         GravityPower;                                      // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CantCancellTimeUseGaugeValue;                      // 0x02DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CacheCantCancellTimeUsedGaugeValue;                // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CacheCurrentGaugeValue;                            // 0x02E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         GaugeCount;                                        // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         _forSkipOwner_GaugeValue;                          // 0x02EC(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	int32                                         _forSkipOwner_GaougeCount;                         // 0x02F0(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	float                                         GaugeReplicateFrequency;                           // 0x02F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WatcherGaugeValue;                                 // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CacheWatcherGaugeValue;                            // 0x02FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PowerUpGaugeValue;                                 // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RestPowerUpGaugeValue;                             // 0x0304(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         UnLockGaugeValue;                                  // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentMaxGaugeValue;                              // 0x030C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CacheCurrentUnLockGaugeValue;                      // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CacheCurrentPowerUpGaugeValue;                     // 0x0314(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBERaySkill(int32 EntryPoint);
	void ReplicateGauge();
	void ROS_ReplicateGauge(float GaugeValue_0, int32 GaugeCount_0);
	void OnInitialize();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void RequestPowerDown(float Value);
	void PressUltButton();
	void ReleaseUltButton();
	void ROS_BeginState_Ready();
	void MC_BeginState_Ready();
	void ROS_UpdateERay(const struct FRotator& Rotation, const struct FVector& Location, const bool IsHit, const TArray<struct FVector>& HitLocations);
	void MC_UpdateERay(const struct FRotator& Rotation, const struct FVector& Location, bool IsHit, const TArray<struct FVector>& HitLocations);
	void ROS_BeginState_Clearing(bool IsCancel);
	void MC_BeginState_Crearing(bool IsCancel);
	void ROS_BeginState_CantCancell(const struct FRotator& ParticleRot, const struct FVector& Location);
	void MC_BeginState_CantCancell(const struct FRotator& ParticleRot, const struct FVector& Location);
	void ROS_BeginState_Action();
	void MC_BeginState_Action();
	void TickState_Ready();
	void RequestPowerUp(float Value);
	void BeginState_Ready_Local();
	void BeginStateReady();
	void Update_ERay_Local(const struct FRotator& Rotation, const struct FVector& Location, bool IsHit, const TArray<struct FVector>& HitLocations);
	void Update_ERay(const struct FRotator& Rotation, const struct FVector& Location, bool IsHit, const TArray<struct FVector>& HitLocations);
	void EndERayAffecter();
	void BeginState_Clearing_Local(bool IsCancel);
	void BeginState_Crearing_Oneshot_Local(bool IsCancel);
	void BeginStateCrearing(bool IsCancel);
	void ROS_Update_ERayAffecter(const struct FRotator& Rotation, const struct FVector& Location);
	void ROS_Spawn_ERayAffecter(const struct FVector& Location, const struct FRotator& Rotation);
	void BeginState_CantCancell_Local(const struct FRotator& ParticleRot, const struct FVector& Location);
	void BeginState_CantCancell_Oneshot_Local(const struct FRotator& ParitcleRot, const struct FVector& EndLocation);
	void BeginStateCantCancell();
	void BeginState_Action_Local();
	void BeginState_Action_Oneshot_Local();
	void TickStateAction(float DeltaSeconds);
	void BeginStateAction();
	void TickState_CantCancell(float DeltaSeconds);
	void StateTick(const float DeltaSeconds);
	void Restore_ERay_LoopSE();
	void Restore_ERay_Effect();
	void Play_ERayActionVoice();
	void Run_ReadyERay_Effect();
	void Play_EndERay_Particle();
	void Stop_ERay_ImpactParticle();
	void Update_ERay_LaserEffect(const struct FRotator& Rotate);
	void Play_ERay_Impact_Particle(bool IsHit, const TArray<struct FVector>& Locations);
	void Update_ERay_Impact(bool IsHit, const TArray<struct FVector>& Locations);
	void Stop_ERayLoopSE();
	void Play_ERayLoopSE();
	void Play_ERayActionGIon();
	void Stop_Loop_Motion();
	void Stop_ERay_Effect();
	void Play_Loop_Motion();
	void Run_ERay_Effect();
	void OnCompleted_7DDD297442D7CC4375E0C99BADE546BC(class FName NotifyName);
	void OnBlendOut_7DDD297442D7CC4375E0C99BADE546BC(class FName NotifyName);
	void OnInterrupted_7DDD297442D7CC4375E0C99BADE546BC(class FName NotifyName);
	void OnNotifyBegin_7DDD297442D7CC4375E0C99BADE546BC(class FName NotifyName);
	void OnNotifyEnd_7DDD297442D7CC4375E0C99BADE546BC(class FName NotifyName);
	void GetLaunchLocationComponent(TArray<class USceneComponent*>* LaunchLocationComponents);
	void FindChildParticleComponent(class USceneComponent* Target, bool* Success, class UParticleSystemComponent** ParticleSystem);
	void GetAffecterRotationAndLocation(struct FRotator* Rotation, struct FVector* Location);
	void CantCancellTimeUseGause(float DeltaSeconds, float Param_s__0);
	void RemoveAllCondition();
	void TraceERayInfo(const struct FRotator& Rot, bool* IsHit, TArray<struct FVector>* ImpactLocations);
	void GetBoxExtentVectorValue(class FName ElementName, class FName ValueName, bool* Success, struct FVector* Value);
	void IsHitActor(class AActor* HitActor, class UPrimitiveComponent* HitComponent, bool* IsHit);
	void ProcessBlockingEvent(const struct FVector& ImpactPoint, class AActor* HitActor);
	void GetCurrentGaugeCeilIntNum(int32* Value);
	void CalcGravityPowerEndLocation(class ABP_AJBInGameCharacter_C* Character, const struct FVector& EndLocation, struct FVector* CalcEndLocation);
	void ActionTimeUseGauge(float DeltaSeconds, float Param_s__0);
	void GetGaugeCount(int32* GaugeCount_0);
	void OnRep__forSkipOwner_GaugeValue();
	void OnRep__forSkipOwner_GaougeCount();
	void CalcGaugeCacheUse(float UseGaugeValue);
	void IncreaseCurrentGaugeMax();
	void ReceiveBeginPlay();
	void StateBeginPlay(bool bShouldRestore);
	void InitializeComponentBP();
	void OnCancel();
	void OnActive();
	void OnInactive();
	void ReceiveTick(float DeltaSeconds);
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	bool CanUseSkill(struct FGameplayTagContainer* TagContainer);
	void InitializeVariables();
	void UnLock();
	void Lock();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBERaySkill_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBERaySkill_C")
	}
	static class UBP_AJBERaySkill_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBERaySkill_C>();
	}
};
DUMPER7_ASSERTS_UBP_AJBERaySkill_C;

SDK_NAMESPACE_END
