#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameRessurectionComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBInGameRessurectionComponent.BP_AJBInGameRessurectionComponent_C
// 0x0048 (0x0138 - 0x00F0)
class UBP_AJBInGameRessurectionComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00F0(0x0008)(Transient, DuplicateTransient)
	TArray<class ABP_AJBInGameStartPoint_C*>      StartPointCandidates;                              // 0x00F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	struct FVector                                StartLocationOffset;                               // 0x0108(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InvincibleTimeSecAfterResurrection;                // 0x0114(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           RessurectionVoiceTag;                              // 0x0118(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnable;                                           // 0x0120(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           DarbysVoice;                                       // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLastSurvivorSceneHasStarted;                      // 0x0130(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_AJBInGameRessurectionComponent(int32 EntryPoint);
	void ROS_MovingIntoSafeArea(bool bDiedOfKillZ);
	void ROS_OnDie(bool bDiedOfKillZ);
	void ROC_Resurrection();
	void ROC_Comeback(bool bDiedOfKillZ);
	void OnEndLastSurvivorSceneCut1();
	void OnDie(bool bWillRessurect, bool bIsLastDefeated, bool bDiedOfKillZ);
	void PlayDarbysVoice(bool bDiedOfKillZ);
	void OnOpenTheGame();
	void ReceiveBeginPlay();
	void GetWorldLocationAndRotationForRestart(bool bDiedOfKillZ, struct FVector* Location, struct FRotator* Rotation, bool* bShouldTeleportToStartPoint, bool* bShouldLookAtTargetPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBInGameRessurectionComponent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBInGameRessurectionComponent_C")
	}
	static class UBP_AJBInGameRessurectionComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBInGameRessurectionComponent_C>();
	}
};
DUMPER7_ASSERTS_UBP_AJBInGameRessurectionComponent_C;

SDK_NAMESPACE_END
