#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AchievementTriggerSender_Character

#include "Basic.hpp"

#include "BP_AchievementTriggerSender_classes.hpp"
#include "Engine_structs.hpp"
#include "AJB_structs.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AchievementTriggerSender_Character.BP_AchievementTriggerSender_Character_C
// 0x03A8 (0x04A8 - 0x0100)
class UBP_AchievementTriggerSender_Character_C final : public UBP_AchievementTriggerSender_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AchievementTriggerSender_Character_C; // 0x0100(0x0008)(Transient, DuplicateTransient)
	struct FVector                                WorldLocation_LastDistanceCalculation;             // 0x0108(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MoveDistanceMeter_Float;                           // 0x0114(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<int32, int32>                            SerialMap_SkillCount_Effective_L1;                 // 0x0118(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TMap<int32, int32>                            SerialMap_SkillCount_Effective_L2;                 // 0x0168(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TMap<int32, int32>                            SerialMap_SkillCount_Effective_R1;                 // 0x01B8(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TMap<int32, int32>                            SerialMap_SkillCount_Effective_R2;                 // 0x0208(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TMap<int32, int32>                            SerialMap_SkillCount_Effective_Support;            // 0x0258(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TMap<int32, int32>                            SerialMap_KillCount_L1;                            // 0x02A8(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TMap<int32, int32>                            SerialMap_KillCount_L2;                            // 0x02F8(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TMap<int32, int32>                            SerialMap_KillCount_R1;                            // 0x0348(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TMap<int32, int32>                            SerialMap_KillCount_R2;                            // 0x0398(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TMap<int32, int32>                            SerialMap_KillCount_Support;                       // 0x03E8(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TMap<int32, int32>                            SerialMap_KillCount_SkillInEffect_L1;              // 0x0438(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class FString                                 OwnerCharacterShortName;                           // 0x0488(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 InvalidShortName;                                  // 0x0498(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AchievementTriggerSender_Character(int32 EntryPoint);
	void UpdateMoveDistance();
	void OnPassiveAddedForAchievement(const struct FGameplayTag& CauserType, int32 SerialNumber);
	void CountEffectiveSkill(const struct FGameplayTag& SkillTag, int32 SerialNumber);
	void OnHitMultiple(EAJBSkillType SkillType, int32 HittedCharacterCount, int32 BlockedCharacterCount, int32 InvalidatedCharacterCount);
	void OnPairDie();
	void OnLastKill(const struct FGameplayTag& SkillTag);
	void OnDie(bool bWillRessurect, bool bIsLastDefeated, bool bDiedOfKillZ);
	void OnSkillEffectiveValueDetermined(const struct FGameplayTag& SkillTag, int32 EffectiveValue, bool bUpdateEvenIfNotInGameplay);
	void OnCutDamage(int32 CutDamage);
	void OnHidingTimeDetermined(float TimeSec);
	void OnSkillGiveHeadShot(const struct FGameplayTag& SkillTag);
	void OnSkillSucceeded(const struct FGameplayTag& SkillTag);
	void OnSkillEffectiveTimeDetermined(const struct FGameplayTag& SkillTag, float EffectiveTimeSec, bool bUpdateEvenIfNotInGameplay, bool bOverwrite);
	void OnSkillConsumed(const struct FGameplayTag& SkillTag);
	void OnRescueSuccess();
	void OnWindowBroken(bool bBrokenByAttack);
	void OnJump();
	void OnCrouch();
	void OnReceiveDamage(int32 Damage, const struct FGameplayTag& DamageType, class AActor* DamageCauser, bool bRemainHP, bool bDamageIsCutByStatus, bool bDamageIsCutByAAP, bool IsEndured);
	void OnGetItem(const struct FGameplayTag& ItemTag);
	void OnKill(const struct FGameplayTag& SkillTag, int32 SerialNumber, float AttackDistance, uint8 KilledCharacterId, bool bWithSeparatedStandAttack, bool bHitEnemysSeparatedStand, bool bFirstBlood, int32 UltimateSkillSerialNumberIfInEffect, float ElapsedTime, int32 DeadPlayerId, bool bIsLastDefeated, bool bPlayerKill, bool bSpecialKill, bool bSelfKill, bool bSpecialKill2);
	void BindOwnerActorEvents();
	void OnGiveDamage(int32 Damage, const struct FGameplayTag& DamageType, class AActor* DamageReceiver, bool bRemainHP, bool bDamageIsCut, int32 SerialNumber, bool DamageReceiverIsPlayer, bool bWithSeparatedStandAttack, bool bEnemysSeparateStand, bool bSelfDamage, bool IsEndured);
	void OnOpenTheGame();
	void GetOwnerCharacterShortName(bool* Result, class FString* ShortName);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AchievementTriggerSender_Character_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AchievementTriggerSender_Character_C")
	}
	static class UBP_AchievementTriggerSender_Character_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AchievementTriggerSender_Character_C>();
	}
};
DUMPER7_ASSERTS_UBP_AchievementTriggerSender_Character_C;

SDK_NAMESPACE_END
