#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBBitesTheDustSkill

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_AJBAllPlayerAffectedSkill_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBBitesTheDustSkill.BP_AJBBitesTheDustSkill_C
// 0x0030 (0x0238 - 0x0208)
class UBP_AJBBitesTheDustSkill_C final : public UBP_AJBAllPlayerAffectedSkill_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBBitesTheDustSkill_C;          // 0x0208(0x0008)(Transient, DuplicateTransient)
	float                                         StateTimePreBomb;                                  // 0x0210(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StateTimeBomb;                                     // 0x0214(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StateTimePreFade;                                  // 0x0218(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StateTimeFadeOut;                                  // 0x021C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StateTimeFade;                                     // 0x0220(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StateTimeFadeIn;                                   // 0x0224(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DefaultIncreaseHP;                                 // 0x0228(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DefaultIncreaseAP;                                 // 0x022C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         IncreaseAP;                                        // 0x0230(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         IncreaseHP;                                        // 0x0234(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBBitesTheDustSkill(int32 EntryPoint);
	void ShouldRemainHP(bool* bShouldRemain);
	void GetSkillAffecterServer(class UClass* AffecterClass, class ABP_AJBSkillAffecterBase_C** SkillAffecter_0);
	void ActiveBitesTheDust();
	void SetSkillAffecterSettings();
	void ReceiveBeginPlay();
	void OnRelatedCharacterBecomeLastSurvivor();
	void PowerUpServer(float Value);
	void PowerDown_Server(float Value);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBBitesTheDustSkill_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBBitesTheDustSkill_C")
	}
	static class UBP_AJBBitesTheDustSkill_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBBitesTheDustSkill_C>();
	}
};
DUMPER7_ASSERTS_UBP_AJBBitesTheDustSkill_C;

SDK_NAMESPACE_END
