#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBPinkDarkFlinch

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AJB_structs.hpp"
#include "BP_AJBFlinchBase_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBPinkDarkFlinch.BP_AJBPinkDarkFlinch_C
// 0x0078 (0x02A8 - 0x0230)
class UBP_AJBPinkDarkFlinch_C final : public UBP_AJBFlinchBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBPinkDarkFlinch_C;             // 0x0230(0x0008)(Transient, DuplicateTransient)
	TArray<class ABP_AJBInGameCharacter_C*>       CauserCharacterBP;                                 // 0x0238(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	TMap<class ABP_AJBInGameCharacter_C*, class ABP_AJBInGameParticleEffect_C*> ParticleEffectFlinch; // 0x0248(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	struct FGameplayTag                           SuperiorityTag;                                    // 0x0298(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         FlinchCustomStencilValue;                          // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBPinkDarkFlinch(int32 EntryPoint);
	void SetFlinchCustomStencilValue();
	void SetDefaultCustomStencilValue();
	void TryRemoveParticle(class ABP_AJBInGameCharacter_C* CharacterBP);
	void PlaySE(class UObject* Causer);
	void MC_ActivePassive_(class UObject* Causer, const struct FGameplayTag& CauserType, int32 SerialNumber);
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	void OnActionInactivate(bool bTriggeredByStand);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBPinkDarkFlinch_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBPinkDarkFlinch_C")
	}
	static class UBP_AJBPinkDarkFlinch_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBPinkDarkFlinch_C>();
	}
};
DUMPER7_ASSERTS_UBP_AJBPinkDarkFlinch_C;

SDK_NAMESPACE_END
