#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBRondoSkillAffecter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "BP_AJBSkillAffecterBase_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBRondoSkillAffecter.BP_AJBRondoSkillAffecter_C
// 0x0088 (0x0410 - 0x0388)
class ABP_AJBRondoSkillAffecter_C final : public ABP_AJBSkillAffecterBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBRondoSkillAffecter_C;         // 0x0388(0x0008)(Transient, DuplicateTransient)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal;                                             // 0x0398(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_LightIntensity_722630644E251034174DF6999CE821B3; // 0x03A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_722630644E251034174DF6999CE821B3; // 0x03A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A5[0x3];                                      // 0x03A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x03A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_IsRDSkill_3CEC1A4F4B2FADB8CF87039D913C0676; // 0x03B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_LightPitch_3CEC1A4F4B2FADB8CF87039D913C0676; // 0x03B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Decal_OpacityScale_3CEC1A4F4B2FADB8CF87039D913C0676; // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_TimeOffset_3CEC1A4F4B2FADB8CF87039D913C0676; // 0x03BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Light_Rotation_3CEC1A4F4B2FADB8CF87039D913C0676; // 0x03C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_3CEC1A4F4B2FADB8CF87039D913C0676; // 0x03C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C5[0x3];                                      // 0x03C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x03C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DMI_Decal;                                         // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DMI_PP;                                            // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InitialTimeOffset;                                 // 0x03E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               InitialRotation;                                   // 0x03E4(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         InitialLightIntensity;                             // 0x03F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3F4[0x4];                                      // 0x03F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClass*>                         LockSkillClassListNotOwner;                        // 0x03F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UMaterialInterface*                     PP_Rondo;                                          // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBRondoSkillAffecter(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void BeginRondoTimeline();
	void MC_Clearing(const TArray<class ABP_AJBInGameCharacter_C*>& NotOwnerCharacters);
	void MC_Active(const TArray<class ABP_AJBInGameCharacter_C*>& NotOwnerCharacters);
	void Timeline_1__UpdateFunc();
	void Timeline_1__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void ChangeRondoModeNotOwnerCharacters(bool Enable, TArray<class ABP_AJBInGameCharacter_C*>& NotOwnerCharacters);
	void OnBeginStateClearing();
	void OnBeginStateReady();
	void OnBeginStateActive();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBRondoSkillAffecter_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBRondoSkillAffecter_C")
	}
	static class ABP_AJBRondoSkillAffecter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBRondoSkillAffecter_C>();
	}
};
DUMPER7_ASSERTS_ABP_AJBRondoSkillAffecter_C;

SDK_NAMESPACE_END
