#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBTransferSkill

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "BP_AJBSkillBase_classes.hpp"
#include "AkAudio_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBTransferSkill.BP_AJBTransferSkill_C
// 0x0188 (0x0370 - 0x01E8)
#pragma pack(push, 0x1)
class SDK_ALIGN(0x10) UBP_AJBTransferSkill_C : public UBP_AJBSkillBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBTransferSkill_C;              // 0x01E8(0x0008)(Transient, DuplicateTransient)
	struct FVector                                WorldLocation_LastDistanceCalculation;             // 0x01F0(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MoveDistanceMeter_Float;                           // 0x01FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           ActivatedSE;                                       // 0x0200(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReservedCancel_Local;                             // 0x0208(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_209[0x3];                                      // 0x0209(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReadyTime;                                         // 0x020C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TransferTime;                                      // 0x0210(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Rep_PrevRotation;                                  // 0x0214(0x000C)(Edit, BlueprintVisible, Net, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bActivatePossess;                                  // 0x0220(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           ReadyStartSETag;                                   // 0x0228(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           TransferStartSETag;                                // 0x0230(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           TransferStartVoiceTag;                             // 0x0238(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActionStartVoiceTag;                               // 0x0240(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActionStartSETag;                                  // 0x0248(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           ActionSE;                                          // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bWaitingReady;                                     // 0x0258(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_259[0x3];                                      // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ActionTime;                                        // 0x025C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Action2Time;                                       // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ClearingTime;                                      // 0x0264(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SafeLocationOffset;                                // 0x0268(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_274[0x4];                                      // 0x0274(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      SafeLocationObjectTypes;                           // 0x0278(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         SafeLocationArroundtraceNum;                       // 0x0288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SafeLocationArroundTraceIncScale;                  // 0x028C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           AM_StandTransfer;                                  // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PossessActiveInterval;                             // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ShowGuideState;                                    // 0x029C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ParticleTag_StandTransfer;                         // 0x02A0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ParticleTag_PropertyStandTransfer;                 // 0x02A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ParticleTag_PropertyStandAction;                   // 0x02B0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ParticleTag_TargetAction;                          // 0x02B8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ParticleTagStandEnd;                               // 0x02C0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ActionStartGionTag;                                // 0x02C8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CancelVoiceTag;                                    // 0x02D0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bReserveTransfer;                                  // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bReservedTransfer;                                 // 0x02D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bPossibleTransfer;                                 // 0x02DA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2DB[0x5];                                      // 0x02DB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 SpawnPreviewClass;                                 // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 PreviewObject;                                     // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<EObjectTypeQuery>                      TraceObjectTypes;                                  // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	float                                         TraceHeightBufferUpper;                            // 0x0300(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TraceHeightBufferLower;                            // 0x0304(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_308[0x8];                                      // 0x0308(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             TransferTransform;                                 // 0x0310(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                                PreviewOffset;                                     // 0x0340(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bReadyTiming;                                      // 0x034C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bShouldMeasuringMoveDistance;                      // 0x034D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34E[0x2];                                      // 0x034E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         GroundingTraceDistance;                            // 0x0350(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldRequestStandEndParticle;                    // 0x0354(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_355[0x3];                                      // 0x0355(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               ActionTargetCache;                                 // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESkillState_Transfer                          PreSkillState;                                     // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBTransferSkill(int32 EntryPoint);
	void DestroyPreviewObject_Local(bool bHidePreviewGuide);
	void SpawnPreviewObject_Local();
	void OnClientMovableStandRestarted();
	void OnCharacterClientRestarted();
	void FinishMeasuringMoveDistance();
	void StartMeasuringMoveDistance();
	void OnTick_MeasureMoveDistance();
	void StopMovingSE();
	void ActionCommon();
	void OnBeginState_Action2();
	void TickState_Action2(float DeltaSeconds);
	void OnBeginState_Action2_OneShot();
	void MC_BeginState_Action2();
	void ROS_BeginState_Action2();
	void BeginState_Action2();
	void TickState_Preview(float DeltaSeconds);
	void OnBeginState_Preview();
	void MC_BeginState_ActionServer(class ABP_AJBInGameCharacter_C* TargetCharacter);
	void BeginState_ActionServer(class ABP_AJBInGameCharacter_C* TargetCharacter);
	void OnBeginState_Ready_OneShot();
	void TickState_Action(float DeltaSeconds);
	void OnBeginState_Action(class ABP_AJBInGameCharacter_C* TargetCharacter);
	void OnBeginState_Action_OneShot(class ABP_AJBInGameCharacter_C* TargetCharacter);
	void MC_BeginState_Action(class ABP_AJBInGameCharacter_C* TargetCharacter);
	void ROS_BeginState_Action(class ABP_AJBInGameCharacter_C* TargetCharacter);
	void BeginState_Action(class ABP_AJBInGameCharacter_C* TargetCharacter);
	void ROC_Possess();
	void StateRenaturation_Ready();
	void OnBeginState_Clearing_OneShot();
	void OnBeginState_Transfer_OneShot(const struct FVector& Location, const struct FRotator& Rotation);
	void MC_StateEnd(bool bCancel);
	void ROS_StateEnd(bool bCancel);
	void MC_BeginState_Clearing();
	void ROS_BeginState_Clearing();
	void BeginState_Clearing();
	void MC_BeginState_Transfer(const struct FVector& Location, const struct FRotator& Rotation);
	void ROS_BeginState_Transfer(const struct FVector& Location, const struct FRotator& Rotation);
	void BeginState_Transfer();
	void MC_BeginState_Ready();
	void ROS_BeginState_Ready();
	void BeginState_Ready();
	void TickState_Clearing(float DeltaSeconds);
	void TickState_Transfer(float DeltaSeconds);
	void TickState_Ready(float DeltaSeconds);
	void OnBeginState_Clearing();
	void OnBeginState_Transfer(bool bRenaturation);
	void OnBeginState_Ready();
	void OnStateEnd(bool bCancel, bool bRestore);
	void StateEnd(bool bCancel);
	void StateTick(float DeltaSeconds);
	void OnCompleted_7B45FB9D406D5826C78546BC5BB5E4FC(class FName NotifyName);
	void OnBlendOut_7B45FB9D406D5826C78546BC5BB5E4FC(class FName NotifyName);
	void OnInterrupted_7B45FB9D406D5826C78546BC5BB5E4FC(class FName NotifyName);
	void OnNotifyBegin_7B45FB9D406D5826C78546BC5BB5E4FC(class FName NotifyName);
	void OnNotifyEnd_7B45FB9D406D5826C78546BC5BB5E4FC(class FName NotifyName);
	void CheckImpossibleMovementMode(bool* bImpossibleMovementMode);
	void TryChangeShowGuide(int32 GuideState);
	void AdjustTransform(const struct FVector& Location, const struct FRotator& Rotation);
	void SpawnParticlePropertyStandAction();
	void ReserveTransfer();
	void UpdateTraceInfo();
	void ApplyTraceInfo();
	void ChangePreviewUI(bool bPossibleTransfer_0);
	void SpawnPreviewObjectCore(class AActor** SpawnObject);
	void TryDestroyPreviewObject();
	void TraceTransferTransform(bool* bPossibleTransfer_0, struct FTransform* Transform);
	void ReceiveBeginPlay();
	void OnDisconnected();
	void StateBeginPlay(bool bShouldRestore);
	void OnCancel();
	void OnActive();
	void OnReady();
	void ReceiveTick(float DeltaSeconds);
	void OnRelatedCharacterBecomeLastSurvivor();
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	void InitializeVariables();
	void AggregateEffectiveCountWithEffectiveState(uint8 NewState, uint8 PreState);

	bool IsInPreview() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBTransferSkill_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBTransferSkill_C")
	}
	static class UBP_AJBTransferSkill_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBTransferSkill_C>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UBP_AJBTransferSkill_C;

SDK_NAMESPACE_END
