#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameLastSurvivorSceneCameraCut3

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "BP_AJBInGameSceneCamera_classes.hpp"
#include "Engine_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBInGameLastSurvivorSceneCameraCut3.BP_AJBInGameLastSurvivorSceneCameraCut3_C
// 0x0028 (0x03B8 - 0x0390)
class ABP_AJBInGameLastSurvivorSceneCameraCut3_C final : public ABP_AJBInGameSceneCamera_C
{
public:
	uint8                                         Pad_389[0x3];                                      // 0x0389(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SearchTrialNum_Yaw;                                // 0x038C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IntervalDegreeForSearch_Yaw_First;                 // 0x0390(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IntervalDegreeForSearch_Yaw_Later;                 // 0x0394(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DistanceBetweenTargetAndCamera;                    // 0x0398(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CameraStartZOffset;                                // 0x039C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                MeshWorldLocationAtPreprocess;                     // 0x03A0(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CameraEndZOffset;                                  // 0x03AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TraceRadius;                                       // 0x03B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void GetObjectTypesToTrace(TArray<EObjectTypeQuery>* Objects);
	void SearchProperLocationAndRotation(class AAJBInGameCharacterBase* TargetCharacterBase, class FName StartTargetSocketName, class FName EndTargetSocketName, bool* bFound, struct FVector* StartLocation_0, struct FRotator* StartRotation_0, struct FVector* EndLocation_0, struct FRotator* EndRotation_0);
	void GetStartLocation(struct FVector* StartLocation_0);
	void GetEndLocation(struct FVector* EndLocation_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBInGameLastSurvivorSceneCameraCut3_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBInGameLastSurvivorSceneCameraCut3_C")
	}
	static class ABP_AJBInGameLastSurvivorSceneCameraCut3_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBInGameLastSurvivorSceneCameraCut3_C>();
	}
};
DUMPER7_ASSERTS_ABP_AJBInGameLastSurvivorSceneCameraCut3_C;

SDK_NAMESPACE_END
