#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameItemSpawner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBInGameItemSpawner.BP_AJBInGameItemSpawner_C
// 0x0028 (0x0350 - 0x0328)
class ABP_AJBInGameItemSpawner_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ABP_AJBInGameItem_C*                    SpawnedItem;                                       // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 FixedItemToSpawn;                                  // 0x0340(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpawnZOffset;                                      // 0x0348(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDebugShowInfoOnEditor;                            // 0x034C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDebugShowInfoOnGame;                              // 0x034D(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDebugShowVeryLargeArrow;                          // 0x034E(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_AJBInGameItemSpawner(int32 EntryPoint);
	void DebugShowText();
	void DebugShowArrow();
	void SpawnFixedItem();
	void ClearItem();
	void SpawnItem(class UClass* ItemClass);
	void UserConstructionScript();
	bool HasFixedItemToSpawn();
	bool IsItemValid();
	class UArrowComponent* GetOrCreateArrowComponent();
	class UTextRenderComponent* GetOrCreateTextRenderComponent();
	class ABP_AJBInGameItem_C* GetSpawnedItem();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBInGameItemSpawner_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBInGameItemSpawner_C")
	}
	static class ABP_AJBInGameItemSpawner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBInGameItemSpawner_C>();
	}
};
DUMPER7_ASSERTS_ABP_AJBInGameItemSpawner_C;

SDK_NAMESPACE_END
