#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBGangReadinessSkill

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "BP_AJBBuffSkill_classes.hpp"
#include "AJB_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBGangReadinessSkill.BP_AJBGangReadinessSkill_C
// 0x0018 (0x0260 - 0x0248)
class UBP_AJBGangReadinessSkill_C final : public UBP_AJBBuffSkill_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBGangReadinessSkill_C;         // 0x0248(0x0008)(Transient, DuplicateTransient)
	struct FGameplayTag                           StartGionTag;                                      // 0x0250(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bCompletedAddPassive;                              // 0x0258(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_259[0x3];                                      // 0x0259(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         KillCountWhileBuff;                                // 0x025C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBGangReadinessSkill(int32 EntryPoint);
	void OnFinishedBuff();
	void OnKillWhileBuff(uint8 KillCount, int32 DeadPlayerId, bool bIsLastDefeated);
	void OnBlendOut_7DDD297442D7CC4375E0C99B4E2562DE(class FName NotifyName);
	void OnCompleted_7DDD297442D7CC4375E0C99B4E2562DE(class FName NotifyName);
	void OnInterrupted_7DDD297442D7CC4375E0C99B4E2562DE(class FName NotifyName);
	void OnNotifyBegin_7DDD297442D7CC4375E0C99B4E2562DE(class FName NotifyName);
	void OnNotifyEnd_7DDD297442D7CC4375E0C99B4E2562DE(class FName NotifyName);
	void OnBeginPassive();
	void OnStateEnd(bool bCancel);
	void BeginState_Action();
	void SpawnStartParticle();
	void PlayMontage();
	void TickState_Action();
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	void InitializeVariables();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBGangReadinessSkill_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBGangReadinessSkill_C")
	}
	static class UBP_AJBGangReadinessSkill_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBGangReadinessSkill_C>();
	}
};
DUMPER7_ASSERTS_UBP_AJBGangReadinessSkill_C;

SDK_NAMESPACE_END
