#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBSupportSkillBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_AJBActionBase_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "AJB_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBSupportSkillBase.BP_AJBSupportSkillBase_C
// 0x0048 (0x0158 - 0x0110)
class UBP_AJBSupportSkillBase_C : public UBP_AJBActionBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBSupportSkillBase_C;           // 0x0110(0x0008)(Transient, DuplicateTransient)
	bool                                          bRequireStand;                                     // 0x0118(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  GameplayTagContainer;                              // 0x0120(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bApplyParameterAutomatically;                      // 0x0140(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_141[0x7];                                      // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           SkillTag;                                          // 0x0148(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EAJBSkillType                                 SkillType;                                         // 0x0150(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBSupportSkillBase(int32 EntryPoint);
	void OnCancel();
	void Cancel();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void RemoveGameplayTag(const struct FGameplayTag& Tag);
	void AddGameplayTag(const struct FGameplayTag& Tag, class UObject* Operator, class UObject* Target, const struct FGameplayTag& CauserType, int32 SerialNumber);
	void AddGameplayTagWithFloat(const struct FGameplayTag& Tag, float FloatValue);
	void ChangeSealEnable(bool bEnable);
	void CheckSeal(bool* bSeal);
	void CheckSupportSkill(bool* bSupportSkill);
	void GetGameplayTags(struct FGameplayTagContainer* TagContainerCopy);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBSupportSkillBase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBSupportSkillBase_C")
	}
	static class UBP_AJBSupportSkillBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBSupportSkillBase_C>();
	}
};
DUMPER7_ASSERTS_UBP_AJBSupportSkillBase_C;

SDK_NAMESPACE_END
