#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameCharacter_DOH

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_AJBInGameCharacter_classes.hpp"
#include "AJB_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBInGameCharacter_DOH.BP_AJBInGameCharacter_DOH_C
// 0x00A0 (0x1900 - 0x1860)
class ABP_AJBInGameCharacter_DOH_C final : public ABP_AJBInGameCharacter_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBInGameCharacter_DOH_C;        // 0x1858(0x0008)(Transient, DuplicateTransient)
	class UBP_AJBMostHigh_C*                      BP_AJBMostHigh;                                    // 0x1860(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBRRForceSkyMoveDVManager_C*       BP_AJBRRForceSkyMoveDVManager;                     // 0x1868(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBRuthlessBloodsuck_C*             BP_AJBRuthlessBloodsuck;                           // 0x1870(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBRoadRollerSkill_C*               BP_AJBRoadRollerSkill;                             // 0x1878(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBGlimpseOfForceSkill_C*           BP_AJBGlimpseOfForceSkill;                         // 0x1880(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBMudaRushWLDSill_C*               BP_AJBWRYRushWLDSill;                              // 0x1888(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBAccompanyWLDSkill_C*             BP_AJBAccompanyWLDSkill;                           // 0x1890(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RoadRollerDirection_Lookup_Rotation_Rate_DFB5AE1E44D23071B27BB1B07FE25FE9; // 0x1898(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            RoadRollerDirection_Lookup__Direction_DFB5AE1E44D23071B27BB1B07FE25FE9; // 0x189C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189D[0x3];                                     // 0x189D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     RoadRollerDirection_Lookup;                        // 0x18A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RoadRollerDirection_Start_Rotation_Rate_0BE103434AA1AEA1855C948D6960E9F6; // 0x18A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            RoadRollerDirection_Start__Direction_0BE103434AA1AEA1855C948D6960E9F6; // 0x18AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18AD[0x3];                                     // 0x18AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     RoadRollerDirection_Start;                         // 0x18B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            RoadRollerDirection_End__Direction_D3A98B734A124BBD817194AFC70176A5; // 0x18B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18B9[0x7];                                     // 0x18B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     RoadRollerDirection_End;                           // 0x18C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            RoadRollerDirection_Finish__Direction_6C1D7BC942571857ED7CB98ADBA301C1; // 0x18C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C9[0x7];                                     // 0x18C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     RoadRollerDirection_Finish;                        // 0x18D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            RoadRollerDirection_FullAttack__Direction_EBFC46974C105E8E89FFC4A4A5B58174; // 0x18D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18D9[0x7];                                     // 0x18D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     RoadRollerDirection_FullAttack;                    // 0x18E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RoadRollerDirection_Landing_Rotation_Pitch_52E0FA2D4B81F71871C674BBB74985EF; // 0x18E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            RoadRollerDirection_Landing__Direction_52E0FA2D4B81F71871C674BBB74985EF; // 0x18EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18ED[0x3];                                     // 0x18ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     RoadRollerDirection_Landing;                       // 0x18F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseRootBoneRotationOnRoadRoller;                  // 0x18F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_18F9[0x3];                                     // 0x18F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DirectionBeforePitch;                              // 0x18FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBInGameCharacter_DOH(int32 EntryPoint);
	void BeginRoadRollerDirection_End();
	void BeginRoadRollerDirection_Finish();
	void BeginRoadRollerDirection_FullAttack();
	void BeginRoadRollerDirection_Landing();
	void BeginRoadRollerDirection_Lookup();
	void BeginRoadRollerDirection_Start();
	void RoadRollerDirection_Lookup__UpdateFunc();
	void RoadRollerDirection_Lookup__FinishedFunc();
	void RoadRollerDirection_Start__UpdateFunc();
	void RoadRollerDirection_Start__FinishedFunc();
	void RoadRollerDirection_End__UpdateFunc();
	void RoadRollerDirection_End__FinishedFunc();
	void RoadRollerDirection_Finish__UpdateFunc();
	void RoadRollerDirection_Finish__FinishedFunc();
	void RoadRollerDirection_FullAttack__UpdateFunc();
	void RoadRollerDirection_FullAttack__FinishedFunc();
	void RoadRollerDirection_Landing__UpdateFunc();
	void RoadRollerDirection_Landing__FinishedFunc();
	void GetCurrentRotatePitch(float* Pitch);
	void ReleasedButton_ActiveSpecial();
	void PressedButton_ActiveSpecial();
	void PressedButton_Ultimate();
	void PressedButton_ActiveBase();
	void ReleasedButton_Basic();
	void PressedButton_Basic();
	void OnReleasedInteract();
	void OnReleasedCrouch();
	void OnPressedCrouch();
	void OnPressedJump();
	void OnReleasedJump();
	void ROC_GiveDamage(int32 Damage, const struct FGameplayTag& DamageType, class AActor* DamageReceiver, bool RemainHP, bool DamageIsCut, int32 SerialNumber, bool DamageReceiverIsPlayer, bool bWithSeparatedStandAttack, bool bHitEnemysSeparateStand, bool bSelfDamage, bool IsEndured);
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	void UserConstructionScript();
	void ConsumeGrowup(const struct FGameplayTag& Growup, float Value, float TotalValue, const class FText& SpecifiedText, bool bRewind, int32 CurrentSP);
	void OnBeforeInteract(bool* bShouldInteract);
	void CheckSpecialKill(class ABP_AJBInGameCharacter_C* DeadCharacterBP, bool* bSpecialKill, bool* bSpecialKill2);
	void ShouldRecordHistoryReplayServer(bool* bShouldRecord);
	void CheckErrorConditionOperator(class AActor* InteractActor, bool* bErrorCondition, uint8* ErrorType);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBInGameCharacter_DOH_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBInGameCharacter_DOH_C")
	}
	static class ABP_AJBInGameCharacter_DOH_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBInGameCharacter_DOH_C>();
	}
};
DUMPER7_ASSERTS_ABP_AJBInGameCharacter_DOH_C;

SDK_NAMESPACE_END
