#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameCharacter_CSR

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_AJBInGameCharacter_classes.hpp"
#include "AJB_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBInGameCharacter_CSR.BP_AJBInGameCharacter_CSR_C
// 0x0140 (0x19A0 - 0x1860)
class ABP_AJBInGameCharacter_CSR_C final : public ABP_AJBInGameCharacter_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBInGameCharacter_CSR_C;        // 0x1858(0x0008)(Transient, DuplicateTransient)
	class USceneComponent*                        ShotPoint_BubbleLauncher_Dummy2;                   // 0x1860(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        ShotPoint_BubbleLauncher_Dummy1;                   // 0x1868(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               BulletParticle1;                                   // 0x1870(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               BulletParticle2;                                   // 0x1878(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               BulletParticle3;                                   // 0x1880(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               BulletParticle4;                                   // 0x1888(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SpawnPoint_SoulBubble;                             // 0x1890(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               LensParticle5;                                     // 0x1898(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               LensParticle4;                                     // 0x18A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               LensParticle3;                                     // 0x18A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               LensParticle2;                                     // 0x18B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               LensParticle1;                                     // 0x18B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        ShotPoint_BubbleLens5;                             // 0x18C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        ShotPoint_BubbleLens4;                             // 0x18C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        ShotPoint_BubbleLens3;                             // 0x18D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        ShotPoint_BubbleLens2;                             // 0x18D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        ShotPoint_BubbleLens1;                             // 0x18E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        BubbleLens_Root;                                   // 0x18E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        BubbleCutter_Root;                                 // 0x18F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        ShotPoint_BubbleCutter5;                           // 0x18F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        ShotPoint_BubbleCutter4;                           // 0x1900(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        ShotPoint_BubbleCutter3;                           // 0x1908(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        ShotPoint_BubbleCutter2;                           // 0x1910(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        ShotPoint_BubbleCutter1;                           // 0x1918(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBBubbleLensSkill_C*               BP_AJBBubbleLensSkill;                             // 0x1920(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBSoulBubbleSkill_C*               BP_AJBSoulBubbleSkill;                             // 0x1928(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        ShotPoint_BubbleLauncher1;                         // 0x1930(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               BulletParticle5;                                   // 0x1938(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBBubbleCutterSkill_C*             BP_AJBBubbleCutterSkill;                           // 0x1940(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBBubbleLauncherSkill_C*           BP_AJBBubbleLauncherSkill;                         // 0x1948(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBHamonStatus_C*                   BP_AJBHamonStatus;                                 // 0x1950(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBHamonBreathingSkillCSR_C*        BP_AJBHamonBreathingSkillCSR;                      // 0x1958(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                BubbleLauncherShotPointComponentsCache;            // 0x1960(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, AdvancedDisplay)
	TArray<class USceneComponent*>                BubbleCutterShotPointComponentsCache;              // 0x1970(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, AdvancedDisplay)
	TArray<class USceneComponent*>                BubbleLauncherShotPointDummyComponentsCache;       // 0x1980(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, AdvancedDisplay)
	TArray<class USceneComponent*>                BubbleLensShotPointComponentsCache;                // 0x1990(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, AdvancedDisplay)

public:
	void ExecuteUbergraph_BP_AJBInGameCharacter_CSR(int32 EntryPoint);
	void SprinkleSP_Impl();
	void CharacterDead_Server__Impl(class AActor* DamageCauser, const struct FGameplayTag& DamageType, int32 SerialNumber, float AttackDistance, uint8 KilledCharacterId, bool WithSeparatedStandAttack, bool HitEnemysSeparatedStand, int32 UltimateSkillSerialNumberIfInEffect, bool WasCriticalState, int32 DeadPlayerId, bool IsDelayedSpecialDeath_0);
	void GetBubbleCutterShotPointComponents(TArray<class USceneComponent*>* ShotPointComponents);
	void GetBubbleLauncherShotPointComponents(TArray<class USceneComponent*>* ShotPointComponents);
	void GetBubbleLauncherShotPointDummyComponents(TArray<class USceneComponent*>* ShotPointComponents);
	void GetHamonSkillByTag(const struct FGameplayTag& SkillTag, TScriptInterface<class IBI_HamonTypeSkill_C>* HamonSkill);
	void GetBubbleLensShotPointComponents(TArray<class USceneComponent*>* ShotPointComponents);
	void GetDummyShotLocation(struct FVector* Location);
	void ShouldShowNGPoint(bool* bResult);
	void GetShutTraceRadius(float* Radius);
	void GetShotLocation(bool bConsiderCharacterCapsuleRadius, const struct FGameplayTag& SkillTag, TArray<struct FVector>* Locations);
	void CheckLocallyControlled(bool* bLocallyControlled);
	void RequestGionOnFalldown();
	void ReceiveBeginPlay();
	void SprinkleSP();
	void OnDamageAreaIn();
	void PressedButton_Ultimate();
	void ReleasedButton_ActiveBase();
	void ReleasedButton_ActiveSpecial();
	void PressedButton_ActiveSpecial();
	void PressedButton_ActiveBase();
	void ReleasedButton_Basic();
	void PressedButton_Basic();
	void UpdateCameraInput();
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	void CharacterDead_TheMoment(bool bWasCriticalState);
	void ROC_Die(bool bIsLastDefeated, bool bDiedOfKillZ);
	void CharacterDead_Server_(class AActor* DamageCauser, const struct FGameplayTag& DamageType, int32 SerialNumber, float AttackDistance, uint8 KilledCharacterId, bool WithSeparatedStandAttack, bool HitEnemysSeparatedStand, int32 UltimateSkillSerialNumberIfInEffect, bool WasCriticalState, int32 DeadPlayerId, bool IsDelayedSpecialDeath_0);
	void UserConstructionScript();
	void CalcDamageRate(class AActor* DamagedActor, const struct FGameplayTag& DamageType, float* DamageRate);
	void OnBeforeInteract(bool* bShouldInteract);
	void CheckPossibleDash(bool* bPossible);
	void CheckAnySkillActiveOnTiltOneDash(bool* bAnySkillActive);
	void CheckSpecialKill(class ABP_AJBInGameCharacter_C* DeadCharacterBP, bool* bSpecialKill, bool* bSpecialKill2);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBInGameCharacter_CSR_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBInGameCharacter_CSR_C")
	}
	static class ABP_AJBInGameCharacter_CSR_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBInGameCharacter_CSR_C>();
	}
};
DUMPER7_ASSERTS_ABP_AJBInGameCharacter_CSR_C;

SDK_NAMESPACE_END
