#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBRadioChat

#include "Basic.hpp"

#include "ST_RadioChatInfo_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function BP_AJBRadioChat.BP_AJBRadioChat_C.ExecuteUbergraph_BP_AJBRadioChat
// 0x0048 (0x0048 - 0x0000)
struct BP_AJBRadioChat_C_ExecuteUbergraph_BP_AJBRadioChat final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FST_RadioChatInfo                      K2Node_CustomEvent_ChatInfo;                       // 0x0008(0x0028)(HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               K2Node_DynamicCast_AsBP_AJBIn_Game_Character;      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_AJBRadioChat_C_ExecuteUbergraph_BP_AJBRadioChat;

// Function BP_AJBRadioChat.BP_AJBRadioChat_C.OnClickedButton
// 0x0028 (0x0028 - 0x0000)
struct BP_AJBRadioChat_C_OnClickedButton final
{
public:
	struct FST_RadioChatInfo                      ChatInfo;                                          // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_AJBRadioChat_C_OnClickedButton;

// Function BP_AJBRadioChat.BP_AJBRadioChat_C.SetupWidget
// 0x0038 (0x0038 - 0x0000)
struct BP_AJBRadioChat_C_SetupWidget final
{
public:
	class UWB_RadioChat_C*                        RadioChatWidget;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      Controller;                                        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FST_RadioChatInfo& ChatInfo)> K2Node_CreateDelegate_OutputDelegate;  // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(const struct FST_RadioChatInfo& ChatInfo)> K2Node_CreateDelegate_OutputDelegate1; // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
};
DUMPER7_ASSERTS_BP_AJBRadioChat_C_SetupWidget;

// Function BP_AJBRadioChat.BP_AJBRadioChat_C.SetEnableChat
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBRadioChat_C_SetEnableChat final
{
public:
	bool                                          bEnable_0;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      Controller;                                        // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_AJBRadioChat_C_SetEnableChat;

// Function BP_AJBRadioChat.BP_AJBRadioChat_C.Initialize
// 0x0010 (0x0010 - 0x0000)
struct BP_AJBRadioChat_C_Initialize final
{
public:
	class AAJBInGameCharacter*                    TargetCharacter_0;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_PlayModeIsPair_ReturnValue;               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_AJBRadioChat_C_Initialize;

// Function BP_AJBRadioChat.BP_AJBRadioChat_C.CloseChatList
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBRadioChat_C_CloseChatList final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_AJBRadioChat_C_CloseChatList;

// Function BP_AJBRadioChat.BP_AJBRadioChat_C.CollapsedWidget
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBRadioChat_C_CollapsedWidget final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_AJBRadioChat_C_CollapsedWidget;

// Function BP_AJBRadioChat.BP_AJBRadioChat_C.ShowWidget
// 0x0001 (0x0001 - 0x0000)
struct BP_AJBRadioChat_C_ShowWidget final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_AJBRadioChat_C_ShowWidget;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
