#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBInGameProjectileMTLBlade

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_AJBInGameProjectile_Straight_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBInGameProjectileMTLBlade.BP_AJBInGameProjectileMTLBlade_C
// 0x0028 (0x0518 - 0x04F0)
class ABP_AJBInGameProjectileMTLBlade_C final : public ABP_AJBInGameProjectile_Straight_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBInGameProjectileMTLBlade_C;   // 0x04F0(0x0008)(Transient, DuplicateTransient)
	class UParticleSystemComponent*               PS_RST_BladeGeneration_Idle;                       // 0x04F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_BladeBeamGL;                                    // 0x0500(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_BladeBeam;                                      // 0x0508(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   BladeMesh;                                         // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBInGameProjectileMTLBlade(int32 EntryPoint);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBInGameProjectileMTLBlade_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBInGameProjectileMTLBlade_C")
	}
	static class ABP_AJBInGameProjectileMTLBlade_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBInGameProjectileMTLBlade_C>();
	}
};
DUMPER7_ASSERTS_ABP_AJBInGameProjectileMTLBlade_C;

SDK_NAMESPACE_END
