#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBDamageAreaMaster

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBDamageAreaMaster.BP_AJBDamageAreaMaster_C
// 0x0028 (0x0118 - 0x00F0)
class UBP_AJBDamageAreaMaster_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00F0(0x0008)(Transient, DuplicateTransient)
	class UBP_AJBDamageAreaContext_C*             ContextRef;                                        // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsRestarting;                                     // 0x0100(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAJBParamFile*                          DamageAreaIntervalParam;                           // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDebugAdvanceCalculation;                          // 0x0110(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bDebugShowAdvanceCalcInfo;                         // 0x0111(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_112[0x2];                                      // 0x0112(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RangeLimitLoopCount;                               // 0x0114(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBDamageAreaMaster(int32 EntryPoint);
	void SetupNoReduction();
	void Vanish();
	void StopDamageAreaTick();
	void StartDamageAreaTick();
	void ToggleDebugPauseDamageArea(bool IsPause);
	void Restart();
	void CompleteInterval();
	void CloseIntervalTickInternal();
	void OpenIntervalTickInternal();
	void SetupInterval();
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	struct FST_DamageAreaInterval GetInterval(int32 IntervalIndex);
	void InitializeDamageAreaIntervalParam();
	void AdvanceCalculationTargetLocation();
	void AdvanceCalculationTargetLocationCore(struct FVector& CurrentLocation, struct FVector& CurrentLocationDiff, float& CurrentRadius, float NextRadius, bool bFirstCalculation);
	void CalcCurrentLocationDiff(const struct FVector& InCurrentLocationDiff, float CurrentRadius, float NextRadius, bool bFirstCalculation, struct FVector* OutCurrentLocationDiff);
	void CalcCurrentLocation(const struct FVector& InCurrentLocation, const struct FVector& InCurrentLocationDiff, struct FVector* CurrentLocation);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBDamageAreaMaster_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBDamageAreaMaster_C")
	}
	static class UBP_AJBDamageAreaMaster_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_AJBDamageAreaMaster_C>();
	}
};
DUMPER7_ASSERTS_UBP_AJBDamageAreaMaster_C;

SDK_NAMESPACE_END
