#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AJBFirstBombTrap

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_AJBPlacementTrapBase_classes.hpp"
#include "AJB_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_AJBFirstBombTrap.BP_AJBFirstBombTrap_C
// 0x0070 (0x04C0 - 0x0450)
class ABP_AJBFirstBombTrap_C final : public ABP_AJBPlacementTrapBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_AJBFirstBombTrap_C;              // 0x0450(0x0008)(Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_FX_Common_Plane1;                               // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x0460(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               PS_HDR_PinkDarkTrap_Appear;                        // 0x0468(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Decal;                                             // 0x0470(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          BoxCollision;                                      // 0x0478(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Opacity_3793D6F24A5082F04BC588A51D234895; // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_3793D6F24A5082F04BC588A51D234895; // 0x0484(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_485[0x3];                                      // 0x0485(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CacheFileName;                                     // 0x0490(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	float                                         SphereRadius;                                      // 0x0498(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDebugDrawSphere;                                  // 0x049C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49D[0x3];                                      // 0x049D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               DecalDMI;                                          // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DecalMaxValue;                                     // 0x04A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AC[0x4];                                      // 0x04AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   DecalScalaraParamName_Opacity;                     // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               PlaneDMI;                                          // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_AJBFirstBombTrap(int32 EntryPoint);
	void OnSetViewTargetToNewSpectator_Local();
	void PreInitializeComponentsBP();
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void BndEvt__BoxCollision_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void Timeline_0__NewTrack_3__EventFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void OnRep_CacheFileName();
	void ChangeDecalEnable(bool bEnable);
	void ChangeCollisionEnable(bool bEnable);
	void UpdateDecalEnableWhichOne();
	void OnBeginState_Prepare_OneShot();
	void OnBeginState_Standby();
	void OnBeginState_Triggering_OneShot();
	void UserConstructionScript();
	void CheckCollisionEnable(bool* bEnable);
	void GetEmphasisParticleLocation(struct FVector* Location);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_AJBFirstBombTrap_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_AJBFirstBombTrap_C")
	}
	static class ABP_AJBFirstBombTrap_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_AJBFirstBombTrap_C>();
	}
};
DUMPER7_ASSERTS_ABP_AJBFirstBombTrap_C;

SDK_NAMESPACE_END
