#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CharaSelectMannequin

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_CharaSelectMannequin.BP_CharaSelectMannequin_C
// 0x00F0 (0x0418 - 0x0328)
class ABP_CharaSelectMannequin_C final : public AAJBCharaSelectMannequin
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(Transient, DuplicateTransient)
	class UArrowComponent*                        Arrow;                                             // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    BackLight;                                         // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    FillLight;                                         // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    KeyLight;                                          // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_Stand;                                          // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SK_Character;                                      // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DMI_eyeL;                                          // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DMI_eyeR;                                          // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RightEye_MoveHorizontal;                           // 0x0370(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RightEye_MoveVertical;                             // 0x0374(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LeftEye_MoveHorizontal;                            // 0x0378(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LeftEye_MoveVertical;                              // 0x037C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CharacterTag;                                      // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                 CurrentCharaSkinName;                              // 0x0388(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 CurrentStandSkinName;                              // 0x0398(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class USkeletalMeshComponent*>         CharaAttachmentComponents;                         // 0x03A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class USkeletalMeshComponent*>         StandAttachmentComponents;                         // 0x03B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	float                                         Stand_RightEye_MoveHorizontal;                     // 0x03C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Stand_RightEye_MoveVertical;                       // 0x03CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Stand_LeftEye_MoveHorizontal;                      // 0x03D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Stand_LeftEye_MoveVertical;                        // 0x03D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               StandDMIEyeL;                                      // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               StandDMIEyeR;                                      // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnCompleteLoad;                                    // 0x03E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class UParticleSystemComponent*>       CachedParticleSystems;                             // 0x03F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UMaterialInstanceDynamic*               DMI_Eye;                                           // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Eye_MoveHorizontal;                                // 0x0410(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Eye_MoveVertical;                                  // 0x0414(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_CharaSelectMannequin(int32 EntryPoint);
	void UpdateSkin();
	void SetupCharaLookAtCamera();
	void ReceiveBeginPlay();
	void Debug_TryChangePrevSkin_Stand();
	void Debug_TryChangeNextSkin_Stand();
	void Debug_TryChangePrevSkin();
	void Debug_TryChangeNextSkin();
	void OnLoaded_BA603E3749AFE052581DE8A4CCFEB14E(class UObject* Loaded);
	void OnLoaded_E0CD556147EE73AC1B1063BA25D19247(class UObject* Loaded);
	void OnLoaded_BA603E3749AFE052581DE8A4D750F2BB(class UObject* Loaded);
	void OnLoaded_E0CD556147EE73AC1B1063BA3E7FD1B2(class UObject* Loaded);
	void OnLoaded_BA603E3749AFE052581DE8A402AFAB9B(class UObject* Loaded);
	void OnLoaded_E0CD556147EE73AC1B1063BAEB808892(class UObject* Loaded);
	void OnLoaded_E0CD556147EE73AC1B1063BAED328D0E(class UObject* Loaded);
	void OnLoaded_BA603E3749AFE052581DE8A4217FC12E(class UObject* Loaded);
	void OnLoaded_E0CD556147EE73AC1B1063BA2BF3AC31(class UObject* Loaded);
	void OnLoaded_BA603E3749AFE052581DE8A4E7BEE011(class UObject* Loaded);
	void OnLoaded_E0CD556147EE73AC1B1063BAF4330E9B(class UObject* Loaded);
	void OnLoaded_BA603E3749AFE052581DE8A4387E42BB(class UObject* Loaded);
	void OnLoaded_E0CD556147EE73AC1B1063BAF1430CC2(class UObject* Loaded);
	void OnLoaded_BA603E3749AFE052581DE8A43D0E40E2(class UObject* Loaded);
	void OnLoaded_E0CD556147EE73AC1B1063BAA7F4E85A(class UObject* Loaded);
	void OnLoaded_BA603E3749AFE052581DE8A46BB9A47A(class UObject* Loaded);
	void OnLoaded_E0CD556147EE73AC1B1063BAC31210CB(class UObject* Loaded);
	void OnLoaded_BA603E3749AFE052581DE8A40F5F5CEB(class UObject* Loaded);
	void OnLoaded_BA603E3749AFE052581DE8A4AF0E7D5B(class UObject* Loaded);
	void OnLoaded_E0CD556147EE73AC1B1063BAB25ABBDF(class UObject* Loaded);
	void OnLoaded_BA603E3749AFE052581DE8A45B7598D6(class UObject* Loaded);
	void OnLoaded_E0CD556147EE73AC1B1063BA46215E52(class UObject* Loaded);
	void OnLoaded_E0CD556147EE73AC1B1063BAF55EE14D(class UObject* Loaded);
	void OnLoaded_BA603E3749AFE052581DE8A41C71C244(class UObject* Loaded);
	void UserConstructionScript();
	void CreateDMI(const class FString& TargetName, class UMaterialInstanceDynamic** DMI);
	void UpdateDMI_VectorParam(class UMaterialInstanceDynamic* TargetDMI, class FName TargetParameter, float ScalarParameter);
	void GetCurrentCharaSkinName(class FText* Name_0);
	void GetCurrentStandSkinName(class FText* Name_0);
	void CreateDMI_Stand(const class FString& TargetName, class UMaterialInstanceDynamic** DMI);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_CharaSelectMannequin_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_CharaSelectMannequin_C")
	}
	static class ABP_CharaSelectMannequin_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CharaSelectMannequin_C>();
	}
};
DUMPER7_ASSERTS_ABP_CharaSelectMannequin_C;

SDK_NAMESPACE_END
