#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_DamageDecal_RoadRoller_Finish

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_DamageDecal_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_DamageDecal_RoadRoller_Finish.BP_DamageDecal_RoadRoller_Finish_C
// 0x0020 (0x0388 - 0x0368)
class ABP_DamageDecal_RoadRoller_Finish_C final : public ABP_DamageDecal_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_DamageDecal_RoadRoller_Finish_C; // 0x0368(0x0008)(Transient, DuplicateTransient)
	float                                         Timeline_0___Track_1_CBCECF8347930ED87840628F104494B6; // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0___Track_0_CBCECF8347930ED87840628F104494B6; // 0x0374(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_CBCECF8347930ED87840628F104494B6; // 0x0378(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_379[0x7];                                      // 0x0379(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0380(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_DamageDecal_RoadRoller_Finish(int32 EntryPoint);
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void PlayAnimationTimeline();
	void StopAnimationTimeline();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_DamageDecal_RoadRoller_Finish_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_DamageDecal_RoadRoller_Finish_C")
	}
	static class ABP_DamageDecal_RoadRoller_Finish_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DamageDecal_RoadRoller_Finish_C>();
	}
};
DUMPER7_ASSERTS_ABP_DamageDecal_RoadRoller_Finish_C;

SDK_NAMESPACE_END
