#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EnhancementItemSpawnPoint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_EnhancementItemSpawnPoint.BP_EnhancementItemSpawnPoint_C
// 0x0028 (0x0350 - 0x0328)
class ABP_EnhancementItemSpawnPoint_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(Transient, DuplicateTransient)
	class UTextRenderComponent*                   TextRender;                                        // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 SpawnClass;                                        // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpawnWeight;                                       // 0x0348(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_EnhancementItemSpawnPoint(int32 EntryPoint);
	void SpawnEnhancementItem();
	void RunOnServer_SpawnEnhancementItem(const struct FTransform& SpawnTransform, class UClass* SpawnClass_0, bool IsSpawn);
	void ReceiveBeginPlay();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_EnhancementItemSpawnPoint_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_EnhancementItemSpawnPoint_C")
	}
	static class ABP_EnhancementItemSpawnPoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EnhancementItemSpawnPoint_C>();
	}
};
DUMPER7_ASSERTS_ABP_EnhancementItemSpawnPoint_C;

SDK_NAMESPACE_END
