#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PreLoadEmoteHelper

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_PreLoadEmoteHelper.BP_PreLoadEmoteHelper_C
// 0x0050 (0x0378 - 0x0328)
class ABP_PreLoadEmoteHelper_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         CharacterID;                                       // 0x0338(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 LoadEmoteIds;                                      // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn)
	TArray<struct FPrimaryAssetId>                AssetIds;                                          // 0x0350(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          bLoadedEmoteAssets;                                // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnLoadedEmoteAssets;                               // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_BP_PreLoadEmoteHelper(int32 EntryPoint);
	void ReceiveBeginPlay();
	void StartLoadEmoteAssets();
	void Completed_107FF52F47F41BC3E625F288BF881739(const TArray<class UObject*>& Loaded);
	void UserConstructionScript();
	void IsLoadedEmoteAssets(bool* bLoaded);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_PreLoadEmoteHelper_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_PreLoadEmoteHelper_C")
	}
	static class ABP_PreLoadEmoteHelper_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PreLoadEmoteHelper_C>();
	}
};
DUMPER7_ASSERTS_ABP_PreLoadEmoteHelper_C;

SDK_NAMESPACE_END
