#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SequencerPlayGion

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function BP_SequencerPlayGion.BP_SequencerPlayGion_C.ExecuteUbergraph_BP_SequencerPlayGion
// 0x0018 (0x0018 - 0x0000)
struct BP_SequencerPlayGion_C_ExecuteUbergraph_BP_SequencerPlayGion final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestGion_OutGame__AkComponent__LocalOnly_; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RequestGion_OutGame__bFullfilDisplayCond_LocalOnly_; // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_SequencerPlayGion_C_ExecuteUbergraph_BP_SequencerPlayGion;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
