#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UnderwaterMaskingCylinder

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function BP_UnderwaterMaskingCylinder.BP_UnderwaterMaskingCylinder_C.ExecuteUbergraph_BP_UnderwaterMaskingCylinder
// 0x00B8 (0x00B8 - 0x0000)
struct BP_UnderwaterMaskingCylinder_C_ExecuteUbergraph_BP_UnderwaterMaskingCylinder final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_CustomEvent_TargetActor;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Value;                          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x001C(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0028(0x0088)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BP_UnderwaterMaskingCylinder_C_ExecuteUbergraph_BP_UnderwaterMaskingCylinder;

// Function BP_UnderwaterMaskingCylinder.BP_UnderwaterMaskingCylinder_C.SetTarget
// 0x0008 (0x0008 - 0x0000)
struct BP_UnderwaterMaskingCylinder_C_SetTarget final
{
public:
	class AActor*                                 TargetActor_0;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_UnderwaterMaskingCylinder_C_SetTarget;

// Function BP_UnderwaterMaskingCylinder.BP_UnderwaterMaskingCylinder_C.SetWaterSurfaceZ
// 0x0004 (0x0004 - 0x0000)
struct BP_UnderwaterMaskingCylinder_C_SetWaterSurfaceZ final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_UnderwaterMaskingCylinder_C_SetWaterSurfaceZ;

// Function BP_UnderwaterMaskingCylinder.BP_UnderwaterMaskingCylinder_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_UnderwaterMaskingCylinder_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_UnderwaterMaskingCylinder_C_ReceiveTick;

// Function BP_UnderwaterMaskingCylinder.BP_UnderwaterMaskingCylinder_C.UserConstructionScript
// 0x0020 (0x0020 - 0x0000)
struct BP_UnderwaterMaskingCylinder_C_UserConstructionScript final
{
public:
	float                                         CallFunc_GetStageUnderwaterMaskingCylinderHeightScale_Scale; // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStageUnderwaterMaskingCylinderRadiusScale_Scale; // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0008(0x000C)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_UnderwaterMaskingCylinder_C_UserConstructionScript;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
