#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UnderwaterAffecter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "E_GionSpawnedSpace_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_UnderwaterAffecter.BP_UnderwaterAffecter_C
// 0x0188 (0x0278 - 0x00F0)
class UBP_UnderwaterAffecter_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00F0(0x0008)(Transient, DuplicateTransient)
	TArray<class ABP_UnderwaterAreaVolume_C*>     OverlapVolume;                                     // 0x00F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	UMulticastDelegateProperty_                   OnBeginUnderwaterEvent;                            // 0x0108(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   OnEndUnderwaterEvent;                              // 0x0118(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FName                                   NoseSocket;                                        // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   FootSocketName;                                    // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SubmasionRate;                                     // 0x0138(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Oxygen;                                            // 0x013C(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ApneaTime;                                         // 0x0140(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DecreaseOxygenApneaTimeThreshold;                  // 0x0144(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OxygenDepletingAmaountPerSecond;                   // 0x0148(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OxygenRecoverAmaountPerSecond;                     // 0x014C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpeedDownSubmasionThreshold;                       // 0x0150(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpeedDownRate;                                     // 0x0154(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsDrowning;                                       // 0x0158(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_159[0x7];                                      // 0x0159(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnBeginDrown;                                      // 0x0160(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   OnEndDrown;                                        // 0x0170(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FTimespan                              DamageIntervalFinishTime;                          // 0x0180(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnDrownDamage;                                     // 0x0188(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FTimespan                              DrownDamageInterval;                               // 0x0198(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         DrownBaseDamage;                                   // 0x01A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSubmergedPelvis;                                 // 0x01A4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A5[0x3];                                      // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxWorldZLocationInCurrentFalling;                 // 0x01A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InWaterEffectThreasholdHeight;                     // 0x01AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<float>                                 DepthLevelThreashold;                              // 0x01B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         LastDepthLevel;                                    // 0x01C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InWaterEffectThresholdSpeed;                       // 0x01C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SpeedOfSubmergeMoment;                             // 0x01C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MovingEffectIntervalRemainTime;                    // 0x01CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MovingEffectInterval_D1;                           // 0x01D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         MovingEffectInterval_D2;                           // 0x01D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EffectSpawnPositionCorrectionFactor;               // 0x01D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsEnableSpeedDown;                                // 0x01DC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bIsEnableDrown;                                    // 0x01DD(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1DE[0x2];                                      // 0x01DE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               MovingRippleEffect;                                // 0x01E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCameraInWater;                                   // 0x01E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E9[0x7];                                      // 0x01E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           UnderWaterLoopSound;                               // 0x01F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsNoseInWater;                                     // 0x01F8(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnChangeCameraStatus;                              // 0x0200(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UParticleSystemComponent*               DustLoopEffect;                                    // 0x0210(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               NewVar_0;                                          // 0x0218(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               BreathingBubblesEffect;                            // 0x0220(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsActiveDustParticle;                              // 0x0228(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsActiveBreathBubblesParticle;                     // 0x0229(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22A[0x2];                                      // 0x022A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CharacterZSpeed;                                   // 0x022C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LastCharacterLocation;                             // 0x0230(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_UnderwaterMaskingCylinder_C*        WaterMaskCylinder;                                 // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OffsetCameraStatusThreasholdForMask;               // 0x0248(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCameraInWaterForMask;                            // 0x024C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_24D[0x3];                                      // 0x024D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 LastViewTarget;                                    // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnChangeNoseInServer;                              // 0x0258(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bIsDecreaseOxygenApneaTime;                        // 0x0268(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsOwnerNPC;                                        // 0x0269(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay)
	bool                                          IsDeterminatedLastSurvivor;                        // 0x026A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay)
	uint8                                         Pad_26B[0x1];                                      // 0x026B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WaterEffectsInterval;                              // 0x026C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bShouldSpawnWaterEffects;                          // 0x0270(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_UnderwaterAffecter(int32 EntryPoint);
	void OnBeginLastSurvivor();
	void ResetCylinder();
	void ResetViewingCondition();
	void RecoverOxygenFull();
	void OnChangeViewTarget();
	void OnEndKillCamera(const struct FGameplayTag& NextState);
	void UpdateStatusAfterResurrect(class AActor* Rescuer);
	void UpdateCheckCameraStatus_ForMaskCylinder();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ChangeMask(bool IsCameraInWater_0);
	void OnBeginResult(const struct FGameplayTag& PrevState);
	void UpdateCheckCameraStatus();
	void DisableDrown();
	void EnableDrown();
	void OnUpdateSubmasionRate();
	void DisableSpeedDown();
	void EnableSpeedDown();
	void CheckSubmergePelvis(float SubmasionRate_0);
	void OnDamageDrown();
	void UpdateDrown(float DeltaTime);
	void MC_OnUpdateSubmasionRate();
	void RecoverOxygen(float DeltaTime);
	void ROS_OnUpdateSubmasionRate(float SubmasionRate_0, bool IsNoseInWater_0);
	void UpdateSubmersionRate();
	void OnEndUnderwater(const class ABP_UnderwaterAreaVolume_C*& Volume);
	void OnBeginUnderwater(const class ABP_UnderwaterAreaVolume_C*& Volume);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void MC_SpawnInOutWaterEffects();
	void ROS_SpawnInOutWaterEffects();
	void OnPelvisInOut(bool IsSubmergedPelvis_0);
	void SpawnWaterSurfaceAttackSplashCore(const struct FVector& InputPin);
	void MC_SpawnWaterSurfaceAttackSplash(const struct FVector& Location);
	void ROS_SpawnWaterSurfaceAttackSplash(const struct FVector& Location);
	void SpawnWaterSurfaceAttackSplash(const struct FVector& Location);
	void UpdateRippleEffect();
	void SpawnMovingEffects();
	void OnInWater();
	void SpawnInOutWaterEffects();
	void GetOwnerInGameCharacter(class ABP_AJBInGameCharacter_C** InGameCharacter);
	void GetWaterSurfaceZ(float* Z);
	void GetOwnerSocketZ(class FName InSocketName, float* Z);
	void GetCurrentDepthLevel(int32* DeplthLevel);
	float GetMovingEffectInterval();
	void SetActiveRippleLoopEffect(bool bNewActive);
	void CheckOverlappingUnderwaterVolumes();
	void GetOwnerNosePointZ(float* Return_Value_Z);
	bool IsInWater();
	void GetCharacterWaterSurfacePosition(struct FVector* Position);
	void SetActiveDustLoopEffect(bool NewActive);
	void SetActiveBreathBubblesEffect(bool NewActive);
	bool IsDuringTeleportation();
	void tryGetUnderwaterMaskingCylinder(class ABP_UnderwaterMaskingCylinder_C** WaterMaskCylinder_0);
	void DestroyUnderwaterMaskingCylinder();
	void IsViewTargetOwner(bool* IsViewTarget);
	bool IsDuringStickyDive();
	void IsDecreaseOxygenApneaTimeServer(bool* bDecrease);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_UnderwaterAffecter_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_UnderwaterAffecter_C")
	}
	static class UBP_UnderwaterAffecter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_UnderwaterAffecter_C>();
	}
};
DUMPER7_ASSERTS_UBP_UnderwaterAffecter_C;

SDK_NAMESPACE_END
