#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VSEffectManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "E_VSEffectType_structs.hpp"
#include "AJB_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_VSEffectManager.BP_VSEffectManager_C
// 0x00C8 (0x03F0 - 0x0328)
class ABP_VSEffectManager_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(Transient, DuplicateTransient)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             DTVSEffect;                                        // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<E_VSEffectType, class UParticleSystem*>  VSEffectMap;                                       // 0x0348(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TMap<E_VSEffectType, class UParticleSystem*>  VSEffectMapDarkPlace;                              // 0x0398(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	E_VSEffectType                                CurrentType;                                       // 0x03E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDuringTheWorld;                                   // 0x03E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_VSEffectManager(int32 EntryPoint);
	void TryTimeStop();
	void ReceiveTick(float DeltaSeconds);
	void PrevEffect();
	void NextEffect();
	void ReceiveBeginPlay();
	void SetEffect(E_VSEffectType Type);
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	void UserConstructionScript();
	void Follow();
	void GetFollowTarget(class AActor** Actor);
	void TryUpdateParticle();
	void GetCurrentTypeInfo(bool* bSucceed, struct FST_VSEffectInfo* Info);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_VSEffectManager_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_VSEffectManager_C")
	}
	static class ABP_VSEffectManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_VSEffectManager_C>();
	}
};
DUMPER7_ASSERTS_ABP_VSEffectManager_C;

SDK_NAMESPACE_END
