#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VoiceComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AJB_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "ST_FinishVoiceInfo_structs.hpp"
#include "AkAudio_structs.hpp"
#include "E_VoiceProcessType_structs.hpp"
#include "E_VoiceCommandType_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BP_VoiceComponent.BP_VoiceComponent_C
// 0x0168 (0x0258 - 0x00F0)
class UBP_VoiceComponent_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00F0(0x0008)(Transient, DuplicateTransient)
	class UDataTable*                             VoiceDataTable;                                    // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 OwnerCharacterShortName;                           // 0x0100(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UAkComponent*                           AkVoice;                                           // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         KillCount;                                         // 0x0118(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         KillVoiceThreshold;                                // 0x011C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InitialPlayerCount;                                // 0x0120(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HPThreshold;                                       // 0x0124(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bMatchHasStarted;                                  // 0x0128(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x7];                                      // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FWwiseVoiceEventInfo>           VoiceQueue;                                        // 0x0130(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<struct FST_FinishVoiceInfo>            FinishVoiceInfoList;                               // 0x0140(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class FString                                 MarkerPrefixForReservedBreak;                      // 0x0150(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FGameplayTag                           VoiceEventTagForReservedBreak;                     // 0x0160(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bHasReservedVoice;                                 // 0x0168(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bShouldDisplayDebugString;                         // 0x0169(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16A[0x2];                                      // 0x016A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MaxQueueNum;                                       // 0x016C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PairKillDistanceThreshold;                         // 0x0170(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_174[0x4];                                      // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWwiseVoiceEventInfo                   LastPlayingVoiceEventInfo;                         // 0x0178(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         SameVoicePlayingDuration;                          // 0x0198(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SameVoicePlayingThresholdTimeSec;                  // 0x019C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, struct FGameplayTag>        LandmarkInfoList;                                  // 0x01A0(0x0050)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class FName>                           CheckedLandmarkTagList;                            // 0x01F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class FString                                 CharacterShortName;                                // 0x0200(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class UPrimitiveComponent*>            OverlapVolumes;                                    // 0x0210(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TArray<class FName>                           OverlappedHouseTags;                               // 0x0220(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          bPlayEmoteVoiceOnAllClientEnv;                     // 0x0230(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_231[0x7];                                      // 0x0231(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           SpecialKillVoiceTag;                               // 0x0238(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           VoiceTagLastSurvivor;                              // 0x0240(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnabledStage05MatchStartVoice;                   // 0x0248(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_249[0x7];                                      // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           SpecialKillVoiceTag2;                              // 0x0250(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_VoiceComponent(int32 EntryPoint);
	void OnSpawnSignalPin_Event(const struct FGameplayTag& SignalPinType);
	void OnEmote(int32 VoiceIndex);
	void CheckIsInLandmark();
	void SetupLandmarkWatcher();
	void OnPlayRadioChat(int32 ActionLogIndex, const struct FGameplayTag& VoiceTag);
	void SpeakLastSurvivorVoice();
	void ResetDamageAreaOutVoice();
	void OnStartDamageAreaReduction();
	void ResetDamageAreaDamageVoice();
	void OnDamageAreaOut();
	void OnCharacterPairKill();
	void OnCharacterPairDie();
	void OnCharacterRescueSuccess();
	void OnCharacterRevive(class AActor* Rescuer);
	void OnDown(int32 DownedMachingPlayerIndex);
	void OnDie(bool bWillRessurect, bool bIsLastDefeated, bool bDiedOfKillZ);
	void OnCritical();
	void OnCharacterKill(const struct FGameplayTag& SkillTag, int32 SerialNumber, float AttackDistance, uint8 KilledCharacterId, bool bWithSeparatedStandAttack, bool bHitEnemysSeparatedStand, bool bFirstBlood, int32 UltimateSkillSerialNumberIfInEffect, float ElapsedTime, int32 DeadPlayerId, bool bIsLastDefeated, bool bPlayerKill, bool bSpecialKill, bool bSelfKill, bool bSpecialKill2);
	void ReceiveTick(float DeltaSeconds);
	void ROC_OnCharacterHidingPropDamaged();
	void OnCharacterHidingPropDamaged_OnServer();
	void ROC_OnCharacterHideIntoZipper();
	void OnCharacterHideIntoZipper_OnServer();
	void OnCharacterEmote(int32 VoiceIndex);
	void OnCharacterRessurect();
	void ROC_OnCharacterPassThruEnter();
	void OnCharacterPassThruEnter_OnServer(bool bOriginToCounterpart);
	void OnCharacterSkillGrownup(const struct FGameplayTag& GameplayTag, float Value, const class FText& SpecifiedText);
	void OnGameStateChangeLivingPlayerCount(int32 Count, float LivingPlayerRate, int32 PairCount);
	void BindGameStateDispatcher();
	void OnHUDOpenTheGame();
	void BindHUDDispatcher();
	void OnCharacterPassiveAdded(const struct FGameplayTag& AddCondition, const struct FGameplayTag& SecondTag);
	void OnCharacterGiveDamage(int32 Damage, const struct FGameplayTag& DamageType, class AActor* DamageReceiver, bool bRemainHP, bool bDamageIsCut, int32 SerialNumber, bool DamageReceiverIsPlayer, bool bWithSeparatedStandAttack, bool bEnemysSeparateStand, bool bSelfDamage, bool IsEndured);
	void OnCharacterReceiveDamage(int32 Damage, const struct FGameplayTag& DamageType, class AActor* DamageCauser, bool bRemainHP, bool bDamageIsCutByStatus, bool bDamageIsCutByAAP, bool IsEndured);
	void OnCharacterGetItem(const struct FGameplayTag& ItemTag);
	void OnCharacterJump();
	void BindCharacterDispatcher();
	void ReceiveBeginPlay();
	void OnServer_SpeakFromRemote_Core(class ABP_AJBInGameCharacter_C* CharacterBPToSpeak, class ABP_AJBInGameCharacter_C* CharacterBPForComm, const struct FGameplayTag& VoiceTag, E_VoiceCommandType VoiceCommandType, bool bAlsoSpeakOnPairEnv);
	void SpeakFromRemote(const struct FGameplayTag& VoiceTag, E_VoiceCommandType VoiceCommandType);
	void ROS_SpeakFromRemote(const struct FGameplayTag& VoiceTag, E_VoiceCommandType VoiceCommandType, bool bAlsoSpeakOnPairEnv);
	void OnWwiseEventCallback(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo);
	void NotifyTheWorld(class AAJBInGameCharacter* Operator, float Time, EGeneralTiming Timing, bool bEnable, bool bOperatorIsEmpty);
	void TryToSpeak(const struct FGameplayTag& VoiceTag, E_VoiceProcessType VoiceProcessType, bool bSpeakEvenIfNotAlive, bool bSpeakEvenIfDuringTheWorld, bool bSpeakEvenIfNotLocalEnv, bool bAlsoSpeakOnPairEnv, bool bIgnoreIfDuringTheWorld, bool bSpeakIfTheSameEventIsNotQueued, bool* bWillBeSpoken);
	void GetCharacterShortName(bool* Result, class FString* ShortName);
	void GetVoiceEventInfo(const struct FGameplayTag& VoiceTagWithoutCharacterShortName, bool* bResult, struct FWwiseVoiceEventInfo* VoiceEventInfo);
	void TryToSpeakFromQueue();
	void GetCurrentSpokenVoiceEventInfo(struct FWwiseVoiceEventInfo* VoiceEventInfo);
	void PostEvent(const struct FGameplayTag& VoiceTag);
	void TryToSpeakFinishVoice();
	void ReserveBreak(const struct FGameplayTag& VoiceEventTagToStop);
	void RemoveBreakReservation();
	void CheckPostedAkEventExistence(int32 PostAkEventReturnValue, const class FString& WwiseEvent, bool* bExist);
	void ShouldSpeakVoiceFromRemote(bool* bResult);
	bool VoiceEventIsStopEvent(const struct FWwiseVoiceEventInfo& VoiceEvent);
	void TryToSpeakDamageVoice(const struct FGameplayTag& VoiceTag, bool bCausedByDamageArea);
	void TryToSpeakEmoteVoicePoliticClientEnv(int32 VoiceIndex);
	void GetSignalVoiceTag(const struct FGameplayTag& SignalPinType, struct FGameplayTag* VoiceTag);
	void CheckQueuedVoiceTag(const struct FGameplayTag& VoiceTag, bool* bQueued, int32* QueuedNum);
	void CheckQueuedVoiceEvent(const class FString& EventName, bool bExactMatch, bool* bQueued);
	void DequeueVoiceEvent(const class FString& EventName, bool bExactMatch);
	void DequeueVoiceTag(const struct FGameplayTag& VoiceTag, bool IgnoreCurrentSpeakVoice);
	void ResetKillCount();
	void GetPoliticVoiceComponent(bool bIsOwnerPlay, class UBP_VoiceComponent_C** VoiceComponent);
	void GetMatchStartVoiceTag(struct FGameplayTag* MatchStartVoiceTag);
	void CheckQueuedVoiceTags(const struct FGameplayTagContainer& VoiceTagContainer, bool* bQueued);
	void IsHamonSkillbyTag(const struct FGameplayTag& SkillTag, bool* IsHamonSkill);
	void GetKillVoiceTag(const struct FGameplayTag& NomalKillVoiceTag, bool IsSpecialKillVoice1, bool IsSpecialKillVoice2, struct FGameplayTag* KillVoice);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_VoiceComponent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_VoiceComponent_C")
	}
	static class UBP_VoiceComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_VoiceComponent_C>();
	}
};
DUMPER7_ASSERTS_UBP_VoiceComponent_C;

SDK_NAMESPACE_END
