#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_ObjectLoader

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ST_ObjectLoadInfo_structs.hpp"
#include "ST_ObjectClassLoadInfo_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BPC_ObjectLoader.BPC_ObjectLoader_C
// 0x0058 (0x0148 - 0x00F0)
class UBPC_ObjectLoader_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00F0(0x0008)(Transient, DuplicateTransient)
	TArray<struct FST_ObjectLoadInfo>             ObjectLoadingList;                                 // 0x00F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	UMulticastDelegateProperty_                   OnLoadedObjectDispatcher;                          // 0x0108(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bLoadingObject;                                    // 0x0118(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bAscendingOrder;                                   // 0x0119(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnLoadedClassDispatcher;                           // 0x0120(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<struct FST_ObjectClassLoadInfo>        ObjClassLoadingList;                               // 0x0130(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	bool                                          bLoadingObjectClass;                               // 0x0140(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BPC_ObjectLoader(int32 EntryPoint);
	void StartLoadObjectClass(const struct FST_ObjectClassLoadInfo& LoadObjClassInfo);
	void ReceiveTick(float DeltaSeconds);
	void RequestLoadObjectClass(const class FString& LoadId, TSoftClassPtr<class UClass> ObjectClassAssetId);
	void RequestLoadObject(const class FString& LoadId, TSoftObjectPtr<class UObject> ObjectAssetId);
	void StartLoadObject(const struct FST_ObjectLoadInfo& LoadObjInfo);
	void OnLoaded_B3CE73F644F30E7B1B2ECAA2C7ED9949(class UClass* Loaded);
	void OnLoaded_066D0130431550B75D2FBDB198B97FBC(class UObject* Loaded);
	void AddLoadingList(const class FString& LoadId, TSoftObjectPtr<class UObject> ObjectAssetId);
	void RemoveLoadingList(const class FString& LoadId);
	void AssetLoadObject(struct FST_ObjectLoadInfo& LoadInfo);
	void AddLoadingClassList(const class FString& LoadId, TSoftClassPtr<class UClass> ObjClassAssetId);
	void AssetLoadObjClass(struct FST_ObjectClassLoadInfo& LoadInfo);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BPC_ObjectLoader_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BPC_ObjectLoader_C")
	}
	static class UBPC_ObjectLoader_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBPC_ObjectLoader_C>();
	}
};
DUMPER7_ASSERTS_UBPC_ObjectLoader_C;

SDK_NAMESPACE_END
