#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_AnimPostProcess

#include "Basic.hpp"

#include "ELipType_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function BPI_AnimPostProcess.BPI_AnimPostProcess_C.SetEnableLip
// 0x0001 (0x0001 - 0x0000)
struct BPI_AnimPostProcess_C_SetEnableLip final
{
public:
	bool                                          NewFlag;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_BPI_AnimPostProcess_C_SetEnableLip;

// Function BPI_AnimPostProcess.BPI_AnimPostProcess_C.SetLipAnimSequence
// 0x0028 (0x0028 - 0x0000)
struct BPI_AnimPostProcess_C_SetLipAnimSequence final
{
public:
	class UAnimSequenceBase*                      Lip_A;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Lip_I;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Lip_U;                                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Lip_E;                                             // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Lip_O;                                             // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_AnimPostProcess_C_SetLipAnimSequence;

// Function BPI_AnimPostProcess.BPI_AnimPostProcess_C.UpdateLipType
// 0x0001 (0x0001 - 0x0000)
struct BPI_AnimPostProcess_C_UpdateLipType final
{
public:
	ELipType                                      NewType;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_AnimPostProcess_C_UpdateLipType;

// Function BPI_AnimPostProcess.BPI_AnimPostProcess_C.UpdateLipBlendTime
// 0x0004 (0x0004 - 0x0000)
struct BPI_AnimPostProcess_C_UpdateLipBlendTime final
{
public:
	float                                         NewBlendTime;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_AnimPostProcess_C_UpdateLipBlendTime;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
