#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTD_AJBCannotApproachToEnemySoon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BTD_AJBCannotApproachToEnemySoon.BTD_AJBCannotApproachToEnemySoon_C
// 0x0050 (0x00F0 - 0x00A0)
class UBTD_AJBCannotApproachToEnemySoon_C final : public UBTDecorator_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 RO_FocusingEnemy;                                  // 0x00A8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly)
	float                                         AttackRangeSelf;                                   // 0x00D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AttackRangeDiffThreshParam;                        // 0x00D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FarawayDistanceThreshSqParam;                      // 0x00D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FarawayDistanceThreshLessHPSqParam;                // 0x00DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_AJBInGameAIRecognition_C*           Recognition;                                       // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HPThreshParam;                                     // 0x00E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTD_AJBCannotApproachToEnemySoon(int32 EntryPoint);
	void InitializeParameters(class AAIController* AI_Controller);
	bool PerformConditionCheckAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BTD_AJBCannotApproachToEnemySoon_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTD_AJBCannotApproachToEnemySoon_C")
	}
	static class UBTD_AJBCannotApproachToEnemySoon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTD_AJBCannotApproachToEnemySoon_C>();
	}
};
DUMPER7_ASSERTS_UBTD_AJBCannotApproachToEnemySoon_C;

SDK_NAMESPACE_END
