#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTD_AJBItemSPExists_Paramed

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BTD_AJBItemSPExists_Paramed.BTD_AJBItemSPExists_Paramed_C
// 0x0060 (0x0100 - 0x00A0)
class UBTD_AJBItemSPExists_Paramed_C final : public UBTDecorator_BlueprintBase
{
public:
	float                                         SearchDistanceParamSq;                             // 0x00A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SearchDistance;                                    // 0x00A8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBlackboardKeySelector                 DestinationKey;                                    // 0x00B0(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly)
	struct FBlackboardKeySelector                 PathKey;                                           // 0x00D8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly)

public:
	bool PerformConditionCheckAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BTD_AJBItemSPExists_Paramed_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTD_AJBItemSPExists_Paramed_C")
	}
	static class UBTD_AJBItemSPExists_Paramed_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTD_AJBItemSPExists_Paramed_C>();
	}
};
DUMPER7_ASSERTS_UBTD_AJBItemSPExists_Paramed_C;

SDK_NAMESPACE_END
