#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTS_AJBJumpIfOnSlopeSHA

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BTS_AJBJumpIfOnSlopeSHA.BTS_AJBJumpIfOnSlopeSHA_C
// 0x0068 (0x0100 - 0x0098)
class UBTS_AJBJumpIfOnSlopeSHA_C final : public UBTService_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0098(0x0008)(Transient, DuplicateTransient)
	float                                         DegreeSlopeThresh;                                 // 0x00A0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlackboardKeySelector                 InputDestinationKey;                               // 0x00A8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly)
	struct FVector                                v1;                                                // 0x00D0(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                v2;                                                // 0x00DC(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                V3;                                                // 0x00E8(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                V4;                                                // 0x00F4(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTS_AJBJumpIfOnSlopeSHA(int32 EntryPoint);
	void ReceiveTickAI(class AAIController* OwnerController, class APawn* ControlledPawn, float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BTS_AJBJumpIfOnSlopeSHA_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTS_AJBJumpIfOnSlopeSHA_C")
	}
	static class UBTS_AJBJumpIfOnSlopeSHA_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTS_AJBJumpIfOnSlopeSHA_C>();
	}
};
DUMPER7_ASSERTS_UBTS_AJBJumpIfOnSlopeSHA_C;

SDK_NAMESPACE_END
