#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_AJBFindNearestWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BTT_AJBFindNearestWindow.BTT_AJBFindNearestWindow_C
// 0x00B0 (0x0150 - 0x00A0)
class UBTT_AJBFindNearestWindow_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 WindowActorKey;                                    // 0x00A8(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 PathToWindowKey;                                   // 0x00D0(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 DestinationKey;                                    // 0x00F8(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 LookForDirKey;                                     // 0x0120(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly)
	bool                                          bFromIndoor;                                       // 0x0148(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BTT_AJBFindNearestWindow(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	class AActor* FindNearestWindow(class UBP_AJBInGameAIRecognition_C* Recognition, const struct FBlackboardKeySelector& WindowObjectToIgnore, class UNavigationPath** PathToNearestActor1);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BTT_AJBFindNearestWindow_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTT_AJBFindNearestWindow_C")
	}
	static class UBTT_AJBFindNearestWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_AJBFindNearestWindow_C>();
	}
};
DUMPER7_ASSERTS_UBTT_AJBFindNearestWindow_C;

SDK_NAMESPACE_END
