#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_AJBFindHidingPlace

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BTT_AJBFindHidingPlace.BTT_AJBFindHidingPlace_C
// 0x00A8 (0x0148 - 0x00A0)
class UBTT_AJBFindHidingPlace_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(Transient, DuplicateTransient)
	float                                         Radius;                                            // 0x00A8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlackboardKeySelector                 HidingObjectKey;                                   // 0x00B0(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly)
	TArray<float>                                 TraceAngles;                                       // 0x00D8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	TArray<EObjectTypeQuery>                      TraceObjectTypes;                                  // 0x00E8(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance)
	struct FBlackboardKeySelector                 PathToHidingPlaceKey;                              // 0x00F8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly)
	struct FBlackboardKeySelector                 RO_EnemyFocusingOnKey;                             // 0x0120(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly)

public:
	void ExecuteUbergraph_BTT_AJBFindHidingPlace(int32 EntryPoint);
	void BreakLineTrace();
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BTT_AJBFindHidingPlace_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTT_AJBFindHidingPlace_C")
	}
	static class UBTT_AJBFindHidingPlace_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_AJBFindHidingPlace_C>();
	}
};
DUMPER7_ASSERTS_UBTT_AJBFindHidingPlace_C;

SDK_NAMESPACE_END
