#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_AJBRunIntoSaferAreaCenter

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass BTT_AJBRunIntoSaferAreaCenter.BTT_AJBRunIntoSaferAreaCenter_C
// 0x0070 (0x0110 - 0x00A0)
class UBTT_AJBRunIntoSaferAreaCenter_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 NextMovementPointKey;                              // 0x00A8(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly)
	struct FBlackboardKeySelector                 IsArrivedKey;                                      // 0x00D0(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly)
	bool                                          bDebugDraw;                                        // 0x00F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bToCheckPathNavigating;                            // 0x00F9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_FA[0x6];                                       // 0x00FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBAIPathController_C*              PathController;                                    // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          MyAIController;                                    // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTT_AJBRunIntoSaferAreaCenter(int32 EntryPoint);
	void ReceiveTickAI(class AAIController* OwnerController, class APawn* ControlledPawn, float DeltaSeconds);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	class UNavigationPath* GetRandomPathForSaferArea(class AAIController* AIController, float RatioOfRadius);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BTT_AJBRunIntoSaferAreaCenter_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTT_AJBRunIntoSaferAreaCenter_C")
	}
	static class UBTT_AJBRunIntoSaferAreaCenter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_AJBRunIntoSaferAreaCenter_C>();
	}
};
DUMPER7_ASSERTS_UBTT_AJBRunIntoSaferAreaCenter_C;

SDK_NAMESPACE_END
