#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FlowState

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// Class FlowState.FlowStateInterface
// 0x0000 (0x0000 - 0x0000)
class IFlowStateInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FlowStateInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FlowStateInterface")
	}
	static class IFlowStateInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IFlowStateInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IFlowStateInterface;

// Class FlowState.FlowStateUtil
// 0x0000 (0x0028 - 0x0028)
class UFlowStateUtil final : public UBlueprintFunctionLibrary
{
public:
	static bool ChangeState(struct FFlowStateHandler& StateHandler, const struct FGameplayTag& NextStateTag);
	static class UStateObj* FindFlowState(const struct FFlowStateHandler& StateHandler, const struct FGameplayTag& NextStateTag);
	static void InitializeFlowState(struct FFlowStateHandler& InStateHandler);
	static void TickFlowState(struct FFlowStateHandler& StateHandler, float DeltaSconde);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FlowStateUtil")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FlowStateUtil")
	}
	static class UFlowStateUtil* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFlowStateUtil>();
	}
};
DUMPER7_ASSERTS_UFlowStateUtil;

// Class FlowState.StateObj
// 0x0038 (0x0060 - 0x0028)
class UStateObj final : public UObject
{
public:
	bool                                          IsAutoTransition;                                  // 0x0028(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnBegin;                                           // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnTick;                                            // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                   OnEnd;                                             // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	void CallOnBegin(const struct FGameplayTag& PrevState);
	void CallOnEnd(const struct FGameplayTag& NextState);
	void CallOnTick(float DeltaSecond);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("StateObj")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"StateObj")
	}
	static class UStateObj* GetDefaultObj()
	{
		return GetDefaultObjImpl<UStateObj>();
	}
};
DUMPER7_ASSERTS_UStateObj;

// Class FlowState.TransitionInterface
// 0x0000 (0x0000 - 0x0000)
class ITransitionInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("TransitionInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TransitionInterface")
	}
	static class ITransitionInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ITransitionInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_ITransitionInterface;

SDK_NAMESPACE_END
