#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FShowRewardData

#include "Basic.hpp"

#include "AJB_structs.hpp"


SDK_NAMESPACE_START

// UserDefinedStruct FShowRewardData.FShowRewardData
// 0x0068 (0x0068 - 0x0000)
struct FFShowRewardData final
{
public:
	class FText                                   ItemTypeName_22_3D0454DA45EE5257C20906B09B7635F1;  // 0x0000(0x0018)(Edit, BlueprintVisible)
	class FText                                   CharacterName_4_AA371EEC4D175954EE2F7DB851DDF1EB;  // 0x0018(0x0018)(Edit, BlueprintVisible)
	class FText                                   ItemName_6_D65BE8E44FCCC3431E6D9A9D4E815EB5;       // 0x0030(0x0018)(Edit, BlueprintVisible)
	int32                                         RewardItemNum_21_7DDC8CBE43446FF2E7C0DABB0D15A4F6; // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             ItemTexture_10_FD258E3C4969A82AAE0C24B1566E9A8D;   // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERewardItemType                               RewardItemType_20_809636534D04AAED55B1AEBF3650FFDF; // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Rarity_24_4094113B4DAAFF841AD1939806FECB57;        // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RewardNo_27_D36775B0486DB5A9820ECCB19356EEFD;      // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FFShowRewardData;

SDK_NAMESPACE_END
