#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameDataStorage

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START

// ScriptStruct GameDataStorage.DataStorageSaveBase
// 0x0008 (0x0008 - 0x0000)
struct FDataStorageSaveBase
{
public:
	struct FGameplayTag                           Key;                                               // 0x0000(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDataStorageSaveBase;

// ScriptStruct GameDataStorage.DataStorageSaveString
// 0x0010 (0x0018 - 0x0008)
struct FDataStorageSaveString final : public FDataStorageSaveBase
{
public:
	TArray<class FString>                         Values;                                            // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDataStorageSaveString;

// ScriptStruct GameDataStorage.DataStorage
// 0x01E0 (0x01E0 - 0x0000)
struct alignas(0x08) FDataStorage final
{
public:
	uint8                                         Pad_0[0x1E0];                                      // 0x0000(0x01E0)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FDataStorage;

// ScriptStruct GameDataStorage.DataStorageSaveByte
// 0x0010 (0x0018 - 0x0008)
struct FDataStorageSaveByte final : public FDataStorageSaveBase
{
public:
	TArray<uint8>                                 Values;                                            // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDataStorageSaveByte;

// ScriptStruct GameDataStorage.DataStorageSaveInt
// 0x0010 (0x0018 - 0x0008)
struct FDataStorageSaveInt final : public FDataStorageSaveBase
{
public:
	TArray<int32>                                 Values;                                            // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDataStorageSaveInt;

// ScriptStruct GameDataStorage.DataStorageSaveFloat
// 0x0010 (0x0018 - 0x0008)
struct FDataStorageSaveFloat final : public FDataStorageSaveBase
{
public:
	TArray<float>                                 Values;                                            // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDataStorageSaveFloat;

// ScriptStruct GameDataStorage.DataStorageSaveVector
// 0x0010 (0x0018 - 0x0008)
struct FDataStorageSaveVector final : public FDataStorageSaveBase
{
public:
	TArray<struct FVector>                        Values;                                            // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDataStorageSaveVector;

// ScriptStruct GameDataStorage.DataStorageSaveRotator
// 0x0010 (0x0018 - 0x0008)
struct FDataStorageSaveRotator final : public FDataStorageSaveBase
{
public:
	TArray<struct FRotator>                       Values;                                            // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDataStorageSaveRotator;

// ScriptStruct GameDataStorage.DataStorageSaveData
// 0x0060 (0x0060 - 0x0000)
struct FDataStorageSaveData final
{
public:
	TArray<struct FDataStorageSaveByte>           ByteValues;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FDataStorageSaveInt>            IntValues;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FDataStorageSaveFloat>          FloatValues;                                       // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FDataStorageSaveString>         StringValues;                                      // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FDataStorageSaveVector>         VectorValues;                                      // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FDataStorageSaveRotator>        RotatorValues;                                     // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDataStorageSaveData;

SDK_NAMESPACE_END
