#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LinearTimecode

#include "Basic.hpp"

#include "LinearTimecode_structs.hpp"
#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// Class LinearTimecode.LinearTimecodeComponent
// 0x0068 (0x02A0 - 0x0238)
class ULinearTimecodeComponent final : public USceneComponent
{
public:
	class UMediaPlayer*                           MediaPlayer;                                       // 0x0238(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDropTimecode                          DropTimecode;                                      // 0x0240(0x001C)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnTimecodeChange;                                  // 0x0260(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_270[0x30];                                     // 0x0270(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void GetDropTimeCodeFrameNumber(const struct FDropTimecode& Timecode, int32* FrameNumber);
	static void SetDropTimecodeFrameNumber(const struct FDropTimecode& Timecode, int32 FrameNumber, struct FDropTimecode* OutTimecode);

	int32 GetDropFrameNumber() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LinearTimecodeComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LinearTimecodeComponent")
	}
	static class ULinearTimecodeComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULinearTimecodeComponent>();
	}
};
DUMPER7_ASSERTS_ULinearTimecodeComponent;

// Class LinearTimecode.DropTimecodeToStringConversion
// 0x0000 (0x0028 - 0x0028)
class UDropTimecodeToStringConversion final : public UBlueprintFunctionLibrary
{
public:
	static class FString Conv_DropTimecodeToString(const struct FDropTimecode& InTimecode);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DropTimecodeToStringConversion")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DropTimecodeToStringConversion")
	}
	static class UDropTimecodeToStringConversion* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDropTimecodeToStringConversion>();
	}
};
DUMPER7_ASSERTS_UDropTimecodeToStringConversion;

SDK_NAMESPACE_END
