#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SimpleStateMachine

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


SDK_NAMESPACE_START

// BlueprintGeneratedClass SimpleStateMachine.SimpleStateMachine_C
// 0x0040 (0x0130 - 0x00F0)
class USimpleStateMachine_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00F0(0x0008)(Transient, DuplicateTransient)
	class FName                                   CurrentState;                                      // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   PreviousState;                                     // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   NextState;                                         // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DefaultStateIndex;                                 // 0x0110(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_114[0x4];                                      // 0x0114(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           StateCollection;                                   // 0x0118(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	bool                                          DebugLogEnabled;                                   // 0x0128(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ElapsedTime;                                       // 0x012C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SimpleStateMachine(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void ChangeState(class FName State);
	void Tick();
	void IsInState(class FName State, bool* Result);
	void ResetElapsedTime();
	void GetElapsedTime(float* Elapsed_Time);
	void ChangeStateViaIndex(int32 Idx);
	void GetCurrentState(class FName* CurrentState_0);
	void GetNextState(class FName* NextState_0);
	void GetPreviousState(class FName* Previous_State);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("SimpleStateMachine_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SimpleStateMachine_C")
	}
	static class USimpleStateMachine_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USimpleStateMachine_C>();
	}
};
DUMPER7_ASSERTS_USimpleStateMachine_C;

SDK_NAMESPACE_END
