#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_AJBInGamePvE_EnemySpawnTableRow

#include "Basic.hpp"

#include "EPvEGameDifficulty_structs.hpp"


SDK_NAMESPACE_START

// UserDefinedStruct ST_AJBInGamePvE_EnemySpawnTableRow.ST_AJBInGamePvE_EnemySpawnTableRow
// 0x0020 (0x0020 - 0x0000)
struct FST_AJBInGamePvE_EnemySpawnTableRow final
{
public:
	EPvEGameDifficulty                            Difficulty_36_1115229843CC2C9795351AA2AF0985F8;    // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         WaveCount_10_93562B6C466FB389C8B00A80D8376A07;     // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AreaA_28_74DD75D74C552D5EC5C82B85233770FA;         // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AreaB_29_D0C7506F4C1886A2DBA908B64FD7EDD8;         // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AreaC_30_2DAB3B9045200EB3D277F9BDD641B1B4;         // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AreaD_31_69BCB5E24FC65C7AF400F49796B1F8DE;         // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AreaE_32_E2B8E3064396934D4BCFDD844AE2D8E5;         // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AreaF_33_F4630515421E1735CEA6FCB291B7E46E;         // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FST_AJBInGamePvE_EnemySpawnTableRow;

SDK_NAMESPACE_END
