#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_AllCharaHighlightSkillKey

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


SDK_NAMESPACE_START

// UserDefinedStruct ST_AllCharaHighlightSkillKey.ST_AllCharaHighlightSkillKey
// 0x0018 (0x0018 - 0x0000)
struct FST_AllCharaHighlightSkillKey final
{
public:
	float                                         Time_8_A2305C9549FBAF92083E449A7B39F45C;           // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OnStart_27_DE85A1F04740A3BAB817FE9925B2AC85;       // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           SkillTag_19_54EF044C460E6D2A9C90AAA082960423;      // 0x0008(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	int32                                         OwnerId_31_146CB21A4A856D283CF4A395D5D15C4A;       // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FST_AllCharaHighlightSkillKey;

SDK_NAMESPACE_END
