#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_AJBPvEScoreResult

#include "Basic.hpp"


SDK_NAMESPACE_START

// UserDefinedStruct ST_AJBPvEScoreResult.ST_AJBPvEScoreResult
// 0x0020 (0x0020 - 0x0000)
struct FST_AJBPvEScoreResult final
{
public:
	int32                                         ScoreRank_2_5E0965AA4BF36E77C593B5999E95E75A;      // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalScore_10_44908C05426A84A77D0C66928C08B7E1;    // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MobKillCount_18_84AC492841F07DA38E6F5EAE17C08B1F;  // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MobKillBonusScore_19_8C823BD24E2EF15A620599B856095C83; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BossKillCount_24_16F359DF4DE390D94CE0179F3BE448E2; // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BossKillBonusScore_25_5D7E5E0842C5C8FDF9881E9F34977EE5; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RetiredCount_16_76E5F97F4AEF87BA52AFF9804427488E;  // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RetiredBonusScore_17_B8D3C4EF4D4F6A1085D29DA5C5181B6E; // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FST_AJBPvEScoreResult;

SDK_NAMESPACE_END
