#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_AJBInGamePvE_ScoreSettings

#include "Basic.hpp"

#include "EPvEGameDifficulty_structs.hpp"


SDK_NAMESPACE_START

// UserDefinedStruct ST_AJBInGamePvE_ScoreSettings.ST_AJBInGamePvE_ScoreSettings
// 0x0010 (0x0010 - 0x0000)
struct FST_AJBInGamePvE_ScoreSettings final
{
public:
	EPvEGameDifficulty                            Difficulty_2_3EFF2FFE4A218DC9A1FF02BE9CA35293;     // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         KnockDownScore_5_E1D3907C4073D91EE82562AB307CBB9D; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NoRetiredBonusScore_7_C3D8CEA242F109CE2CF940B6CB06A298; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RespawnPenaltyScore_9_F17556064596BDD70B0C40B51977877D; // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FST_AJBInGamePvE_ScoreSettings;

SDK_NAMESPACE_END
