#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_AJBInGamePvE_EnemyInfo

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


SDK_NAMESPACE_START

// UserDefinedStruct ST_AJBInGamePvE_EnemyInfo.ST_AJBInGamePvE_EnemyInfo
// 0x0030 (0x0030 - 0x0000)
struct FST_AJBInGamePvE_EnemyInfo final
{
public:
	struct FGameplayTag                           CharacterTag_2_2963B3ED49E6432105DDFFAC4A8E4D47;   // 0x0000(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	uint8                                         AILevel_22_409C45D94C72CE08A2275CA900C6CF1E;       // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         HP_6_9D19699644C25E43FF6905B86924E5A1;             // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AP_8_466429EA49FDF82202FDFF80A0974995;             // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SP_10_93E7CD8B40352B2259966897CBFFF5D1;            // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LifeTime_17_20AB2EEE4D49ACDDD705839768A65485;      // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Score_14_0C3CD38C4CC4893728A54C8938D4DD21;         // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGameplayTag>                   InitialPassive_21_4EE0B78C4015B6D379F8D98E6F30AB6F; // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
};
DUMPER7_ASSERTS_FST_AJBInGamePvE_EnemyInfo;

SDK_NAMESPACE_END
