#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_DamageDisplayOverrideSetting

#include "Basic.hpp"

#include "E_DamageDisplayPosition_structs.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START

// UserDefinedStruct ST_DamageDisplayOverrideSetting.ST_DamageDisplayOverrideSetting
// 0x0018 (0x0018 - 0x0000)
struct FST_DamageDisplayOverrideSetting final
{
public:
	E_DamageDisplayPosition                       Position_7_F4BE11C34E20897627E9AE8CB09CB116;       // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TextType_17_603F5F264A0C33179CCEACBABFC30CF9;      // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Offset_12_4FC525B74A0402C62BE79AB6F38ABD85;        // 0x0008(0x0008)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              RandomOffsetRange_14_FBDE4D134835CFF636473DB10F60B5F8; // 0x0010(0x0008)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FST_DamageDisplayOverrideSetting;

SDK_NAMESPACE_END
