#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_DebugAIEventReplay

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START

// UserDefinedStruct ST_DebugAIEventReplay.ST_DebugAIEventReplay
// 0x0028 (0x0028 - 0x0000)
struct FST_DebugAIEventReplay final
{
public:
	int32                                         TargetIndex_16_612B049C428B16ADE7E0719F9BDE9218;   // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ElapsedTime_2_64D14283461D37545F4C3EAFC746265A;    // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Tag_6_44AD04EF48F2F4CBC5A31B87FD6FE297;            // 0x0008(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FVector                                V1_20_A20B7C6846B47EAE71EAA286B7D2EF69;            // 0x0010(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                V2_21_6E16D5644CDF75E3353D969BD22B1566;            // 0x001C(0x000C)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FST_DebugAIEventReplay;

SDK_NAMESPACE_END
