#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_EmoteAccompanyInfo

#include "Basic.hpp"


SDK_NAMESPACE_START

// UserDefinedStruct ST_EmoteAccompanyInfo.ST_EmoteAccompanyInfo
// 0x0068 (0x0068 - 0x0000)
struct FST_EmoteAccompanyInfo final
{
public:
	TSoftObjectPtr<class UAnimMontage>            BeginMontage_28_07CAB8A2451BAEB5BC01FBB0A1E3A1F8;  // 0x0000(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            LoopMontage_25_6B793C23431B0FFA66E7679C036054B8;   // 0x0028(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          ShouldSyncMontageTimeline_24_3EC1AE9C414CE32545EFF8B1E52D3C40; // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         YawToPlayer_12_7D3771124E1B4EA2AD74C997D6586D77;   // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DistanceToPlayer_14_6B81956249801D1CD8A152A9A9A088D9; // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OffsetZToPlayer_16_0F75DC5B46C9013A2182C2AFD63DE04B; // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         StandYaw_22_9781591B4EB50CD2F53D7B933E7CCF4B;      // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FST_EmoteAccompanyInfo;

SDK_NAMESPACE_END
