#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_GrowupDesc

#include "Basic.hpp"


SDK_NAMESPACE_START

// UserDefinedStruct ST_GrowupDesc.ST_GrowupDesc
// 0x0078 (0x0078 - 0x0000)
struct FST_GrowupDesc final
{
public:
	class FText                                   DescriptionLv2_7_5792169E4772782C9762989D0996FEF5; // 0x0000(0x0018)(Edit, BlueprintVisible)
	class FText                                   DescriptionLv3_12_D9C2165B4867686B4842E190E9F0EF4E; // 0x0018(0x0018)(Edit, BlueprintVisible)
	class FText                                   DescriptionLv4_13_49504CCB48086EC514D4E6A74A39A2F0; // 0x0030(0x0018)(Edit, BlueprintVisible)
	class FText                                   DescriptionLv5_14_3FE27DE1499D31845E7FBD99F9B05E85; // 0x0048(0x0018)(Edit, BlueprintVisible)
	class FText                                   DescriptionLv6_15_E76303D44DD2A15219CC0B9C0F88C93E; // 0x0060(0x0018)(Edit, BlueprintVisible)
};
DUMPER7_ASSERTS_FST_GrowupDesc;

SDK_NAMESPACE_END
