#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_HighlightKillInfo

#include "Basic.hpp"


SDK_NAMESPACE_START

// UserDefinedStruct ST_HighlightKillInfo.ST_HighlightKillInfo
// 0x000C (0x000C - 0x0000)
struct FST_HighlightKillInfo final
{
public:
	bool                                          KillPlayer_1_F50731C94BEDB322CB8C9B9F71D778D7;     // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsUltimate_5_3FB2723E44C9384D01B782BF5BAB8D90;     // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          IsTech_7_B68F84464AE804F4DDF544A89219F8CB;         // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         MultiKillcount_17_01F9B8F448BC0CE13E793592D24470D5; // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MultiKillIPlayerCount_15_C838D7874D234F45698504A596F4BC22; // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FST_HighlightKillInfo;

SDK_NAMESPACE_END
