#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_HighlightKillKey

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "AJB_structs.hpp"


SDK_NAMESPACE_START

// UserDefinedStruct ST_HighlightKillKey.ST_HighlightKillKey
// 0x0018 (0x0018 - 0x0000)
struct FST_HighlightKillKey final
{
public:
	float                                         Time_8_A2305C9549FBAF92083E449A7B39F45C;           // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          KillPlayer_11_D0EE9BA44FCF172D0FD2E883E37D9B10;    // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           SkillTag_19_54EF044C460E6D2A9C90AAA082960423;      // 0x0008(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	EAJBSkillType                                 SkillType_22_5E34F38B4257475F8DAD6D8C8D4043D8;     // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FST_HighlightKillKey;

SDK_NAMESPACE_END
