#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_ShopCompetitionUICharaParam

#include "Basic.hpp"

#include "AJB_structs.hpp"


SDK_NAMESPACE_START

// UserDefinedStruct ST_ShopCompetitionUICharaParam.ST_ShopCompetitionUICharaParam
// 0x0020 (0x0020 - 0x0000)
struct FST_ShopCompetitionUICharaParam final
{
public:
	int32                                         PlayerID_2_2AC6ECAB49D9C1AA5AF2ECB4D1BFF493;       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         HP_6_ABFAF7E74C9D7C4FF9CA9FB78F9834CF;             // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxHP_7_DAD0ECEC40B89CE16FAFE9ACBE30EDAA;          // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AP_9_A5804F494E5DFB8E53C4A2ABFFDB9BDC;             // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxAP_12_23F9FAC5417A3F4B83D1E3A91380DCB5;         // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECharacterBehavior                            CharacterBehavior_16_D272F94744C3B387B1FD37A3D34015AC; // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CP_19_A96226814D393B651C4F0697929D6D52;            // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxCP_21_6921DAD949B3F9F21E5E288A381E9CD0;         // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FST_ShopCompetitionUICharaParam;

SDK_NAMESPACE_END
