#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_TutorialMessageInfo

#include "Basic.hpp"

#include "AJB_structs.hpp"


SDK_NAMESPACE_START

// UserDefinedStruct ST_TutorialMessageInfo.ST_TutorialMessageInfo
// 0x0010 (0x0010 - 0x0000)
struct FST_TutorialMessageInfo final
{
public:
	float                                         DisplayTime_3_B39E14434EF7D57BCF78F799C26A670E;    // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAJBPadIconType                               PadIcon_10_A4AF6D084A8A89356439D4811889E66A;       // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnablePadIcon_9_191E33204EB1D88F295314B07F0D7DC7; // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Priority_13_5DE4CD6B4F39CFCAAA7EBC8065EC42CC;      // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnableReticleArrow_15_39F804BE47893B8AC0EBA4A2BB05DE21; // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_FST_TutorialMessageInfo;

SDK_NAMESPACE_END
