#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ST_VSEffectInfo

#include "Basic.hpp"

#include "E_VSEffectType_structs.hpp"


SDK_NAMESPACE_START

// UserDefinedStruct ST_VSEffectInfo.ST_VSEffectInfo
// 0x0020 (0x0020 - 0x0000)
struct FST_VSEffectInfo final
{
public:
	E_VSEffectType                                Type_11_B91BE1474773AD8E0E6E25A70F99DE72;          // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystem*                        Particle_12_C0341F85406283BC3CB2CAAF335266DF;      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        ParticleDarkPlace_13_19B369BF40E4589AD90E24A402AAA94D; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFollowCameraOnShotPhase_16_D3FBD7EA4C71C50C96B017B8546091F0; // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bVanishIndoor_18_8CB58C4643AC56C378E812B2DBAFC696; // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_FST_VSEffectInfo;

SDK_NAMESPACE_END
