#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_AJBSignalPinIcon_Caution

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WB_AJBSignalPinIcon_Caution.WB_AJBSignalPinIcon_Caution_C
// 0x0040 (0x0248 - 0x0208)
class UWB_AJBSignalPinIcon_Caution_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Start;                                             // 0x0210(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Circle;                                      // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Flash;                                       // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_SignalWave;                                  // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_0;                                        // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              SignalPinIconImage;                                // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               IconDMI;                                           // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_AJBSignalPinIcon_Caution(int32 EntryPoint);
	void UpdateBlurOffset(float BlurOffset);
	void Construct();
	void SetIsPair(bool bIsPair);
	void UpdateSize(const struct FVector2D& Size);
	void SetSignalType(const struct FGameplayTag& SignalTypeTag);
	void PlayVanishAnimation(bool bIsTimeUp, float* AnimationLength);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_AJBSignalPinIcon_Caution_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_AJBSignalPinIcon_Caution_C")
	}
	static class UWB_AJBSignalPinIcon_Caution_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_AJBSignalPinIcon_Caution_C>();
	}
};
DUMPER7_ASSERTS_UWB_AJBSignalPinIcon_Caution_C;

SDK_NAMESPACE_END
