#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Aura_Yellow

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WB_Aura_Yellow.WB_Aura_Yellow_C.ExecuteUbergraph_WB_Aura_Yellow
// 0x0048 (0x0048 - 0x0000)
struct WB_Aura_Yellow_C_ExecuteUbergraph_WB_Aura_Yellow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_AuraOffset;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x000C(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0020(0x0028)()
};
DUMPER7_ASSERTS_WB_Aura_Yellow_C_ExecuteUbergraph_WB_Aura_Yellow;

// Function WB_Aura_Yellow.WB_Aura_Yellow_C.SetAuraOffset
// 0x0004 (0x0004 - 0x0000)
struct WB_Aura_Yellow_C_SetAuraOffset final
{
public:
	float                                         AuraOffset_0;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_Aura_Yellow_C_SetAuraOffset;

// Function WB_Aura_Yellow.WB_Aura_Yellow_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_Aura_Yellow_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Aura_Yellow_C_PreConstruct;

// Function WB_Aura_Yellow.WB_Aura_Yellow_C.GetDynamicMaterialInstance
// 0x0010 (0x0010 - 0x0000)
struct WB_Aura_Yellow_C_GetDynamicMaterialInstance final
{
public:
	class UMaterialInstanceDynamic*               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_Aura_Yellow_C_GetDynamicMaterialInstance;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
