#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ActionLogColumn

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WB_ActionLogColumn.WB_ActionLogColumn_C
// 0x0038 (0x0280 - 0x0248)
class UWB_ActionLogColumn_C final : public UAJBUserWidget
{
public:
	class UWidgetAnimation*                       Anim_ChatIcon;                                     // 0x0248(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_194;                                      // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              Img_ChatIcon;                                      // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock_ActionLog;                           // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FTimerHandle                           DisplayTimer;                                      // 0x0268(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	UMulticastDelegateProperty_                   OnFinishedVisibleTime;                             // 0x0270(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void UpdateText(class FText& MessageBase, int32& Type, int32& Value1, int32& Value2);
	void InvisibleText();
	void IsUsedText(bool* bUsed);
	void SetVisibleTimer(float Time);
	float GetVisibleTimerElapsedTime_();
	void IsRadioChatLog(int32& Type, bool* bRadioChat);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_ActionLogColumn_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_ActionLogColumn_C")
	}
	static class UWB_ActionLogColumn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ActionLogColumn_C>();
	}
};
DUMPER7_ASSERTS_UWB_ActionLogColumn_C;

SDK_NAMESPACE_END
