#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_AJBPassiveSkillWidget

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WB_AJBPassiveSkillWidget.WB_AJBPassiveSkillWidget_C.ExecuteUbergraph_WB_AJBPassiveSkillWidget
// 0x0008 (0x0008 - 0x0000)
struct WB_AJBPassiveSkillWidget_C_ExecuteUbergraph_WB_AJBPassiveSkillWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_AJBPassiveSkillWidget_C_ExecuteUbergraph_WB_AJBPassiveSkillWidget;

// Function WB_AJBPassiveSkillWidget.WB_AJBPassiveSkillWidget_C.OnOutsideComponentUpdate
// 0x0004 (0x0004 - 0x0000)
struct WB_AJBPassiveSkillWidget_C_OnOutsideComponentUpdate final
{
public:
	float                                         InDeltaTime;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_AJBPassiveSkillWidget_C_OnOutsideComponentUpdate;

// Function WB_AJBPassiveSkillWidget.WB_AJBPassiveSkillWidget_C.GetPassiveSkill
// 0x0008 (0x0008 - 0x0000)
struct WB_AJBPassiveSkillWidget_C_GetPassiveSkill final
{
public:
	class UBP_AJBPassiveSkillBase_C*              ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_AJBPassiveSkillWidget_C_GetPassiveSkill;

// Function WB_AJBPassiveSkillWidget.WB_AJBPassiveSkillWidget_C.SetOwnerPassiveSkill
// 0x0008 (0x0008 - 0x0000)
struct WB_AJBPassiveSkillWidget_C_SetOwnerPassiveSkill final
{
public:
	class UBP_AJBPassiveSkillBase_C*              PassiveSkill;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_AJBPassiveSkillWidget_C_SetOwnerPassiveSkill;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
