#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_AJBTestModeReadOnlyValue

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ST_TestModeText_structs.hpp"
#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WB_AJBTestModeReadOnlyValue.WB_AJBTestModeReadOnlyValue_C
// 0x00A8 (0x02B0 - 0x0208)
class UWB_AJBTestModeReadOnlyValue_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UCanvasPanel*                           RootCanvasPanel;                                   // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FST_TestModeText                       LabelData;                                         // 0x0218(0x0028)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         ValueOffset;                                       // 0x0240(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextBlock*                             ValueText;                                         // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LabelOffset;                                       // 0x0250(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextBlock*                             LabelText;                                         // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         FontInfo;                                          // 0x0260(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_AJBTestModeReadOnlyValue(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void SetTextLabel_ONOFF(bool bOn);
	void SetInteger(int32 Value);
	void SetValueText(const struct FST_TestModeText& TextInfo, ETextJustify InJustification);
	void SetLabelText(const struct FST_TestModeText& TextInfo);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_AJBTestModeReadOnlyValue_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_AJBTestModeReadOnlyValue_C")
	}
	static class UWB_AJBTestModeReadOnlyValue_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_AJBTestModeReadOnlyValue_C>();
	}
};
DUMPER7_ASSERTS_UWB_AJBTestModeReadOnlyValue_C;

SDK_NAMESPACE_END
