#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_AJBInGameGionScreen

#include "Basic.hpp"

#include "AJB_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "ST_GionLocallyControlScreenInfo_structs.hpp"
#include "E_GionSpawnedSpace_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WB_AJBInGameGionScreen.WB_AJBInGameGionScreen_C
// 0x00A8 (0x02F0 - 0x0248)
class UWB_AJBInGameGionScreen_C final : public UAJBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0248(0x0008)(Transient, DuplicateTransient)
	class UCanvasPanel*                           ScreenRoot;                                        // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWB_AJBInGameGionEffect_C*>      EffectPool;                                        // 0x0258(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         EffectPoolSize;                                    // 0x0268(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentIndex;                                      // 0x026C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBox2D                                 MarginRect;                                        // 0x0270(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FVector2D                              ScreenScale;                                       // 0x0284(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28C[0x4];                                      // 0x028C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FST_GionLocallyControlScreenInfo> LocallyScreenData;                               // 0x0290(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	float                                         LossSize;                                          // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsShowDebug;                                      // 0x02A4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A5[0x3];                                      // 0x02A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnDisplayGion;                                     // 0x02A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         ViewTargetHearingAbilityRate;                      // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              PaddingOnScreen;                                   // 0x02BC(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WidgetSizeCache;                                   // 0x02C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CameraVectorCache;                                 // 0x02C8(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetVectorCache;                                 // 0x02D4(0x000C)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              WidgetMaxSizeCache;                                // 0x02E0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ProcessingBufferYUpper;                            // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ProcessingBufferYLower;                            // 0x02EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_AJBInGameGionScreen(int32 EntryPoint);
	void StopCallOnDisplayGionDispatcher();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void RequestEffect(bool bIsOwner, class AActor* Owner, bool bIsFriend, E_GionSpawnedSpace SpanwedSpaceInOwnersEnv, E_GionSpawnedSpace SpanwedSpaceInNotOwnersEnv, class ABP_AJBInGameGion_C* GionActor);
	void Construct();
	void FindUseEffect(class UWB_AJBInGameGionEffect_C** Output_Get);
	void UpdateEffectPosition(class UWB_AJBInGameGionEffect_C* UpdateWidget, struct FGameplayTag* GionType, bool* bIsOnScreen, bool* bIsOwnerGion);
	void SetupEffect(bool bIsOwner, class AActor* Owner, bool bIsFriend, E_GionSpawnedSpace SpanwedSpaceInOwnersEnv, E_GionSpawnedSpace SpanwedSpaceInNotOwnersEnv, class ABP_AJBInGameGion_C* GionActor, struct FGameplayTag* GionType, bool* bIsOnScreen);
	void ToggleShowDebug();
	void GetViewTargetHearingAbilityRate(float* HearingAbilityRate);
	void AdjustEffect(class AActor* Owner, const struct FST_GionInfo& GionInfo);
	void CalcTargetScreenPosition(const struct FVector& TargetLocation, struct FVector2D* TargetScreenPosition);
	void IsWithinViewport(const struct FVector2D& Location, bool* bIsWithinViewport);
	void GetTargetOutOfViewPosition(const struct FVector& TargetLocation, bool bProcessingLocation, struct FVector2D* TargetOutOfViewPosition);
	void GetScaledWidgetSize(struct FVector2D* ScaledWidgetSize);
	void GetWidgetSize(struct FVector2D* WidgetSize);
	void ProcessingPosition(const struct FVector2D& InPosition, struct FVector2D* OutPosition);
	void ClampPosition(const struct FVector2D& InPosition, bool bApplyUpper, bool bApplyLower, struct FVector2D* OutPosition);

	void OnPaint(struct FPaintContext& Context) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_AJBInGameGionScreen_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_AJBInGameGionScreen_C")
	}
	static class UWB_AJBInGameGionScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_AJBInGameGionScreen_C>();
	}
};
DUMPER7_ASSERTS_UWB_AJBInGameGionScreen_C;

SDK_NAMESPACE_END
