#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ButtonGuideText

#include "Basic.hpp"

#include "AJB_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WB_ButtonGuideText.WB_ButtonGuideText_C.ExecuteUbergraph_WB_ButtonGuideText
// 0x0008 (0x0008 - 0x0000)
struct WB_ButtonGuideText_C_ExecuteUbergraph_WB_ButtonGuideText final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ButtonGuideText_C_ExecuteUbergraph_WB_ButtonGuideText;

// Function WB_ButtonGuideText.WB_ButtonGuideText_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_ButtonGuideText_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ButtonGuideText_C_PreConstruct;

// Function WB_ButtonGuideText.WB_ButtonGuideText_C.SetParamater
// 0x0028 (0x0028 - 0x0000)
struct WB_ButtonGuideText_C_SetParamater final
{
public:
	EAJBPadIconType                               PadType_0;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   InText;                                            // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UTexture2D*                             CallFunc_GetAJBPadIcon_KeyAssignConsidering_OutTexture; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_ButtonGuideText_C_SetParamater;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
