#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Connecting

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WB_Connecting.WB_Connecting_C.ExecuteUbergraph_WB_Connecting
// 0x0038 (0x0038 - 0x0000)
struct WB_Connecting_C_ExecuteUbergraph_WB_Connecting final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent;     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent1;    // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent2;    // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0028(0x0010)(ZeroConstructor, NoDestructor)
};
DUMPER7_ASSERTS_WB_Connecting_C_ExecuteUbergraph_WB_Connecting;

// Function WB_Connecting.WB_Connecting_C.OnInputReleasedUp
// 0x0001 (0x0001 - 0x0000)
struct WB_Connecting_C_OnInputReleasedUp final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Connecting_C_OnInputReleasedUp;

// Function WB_Connecting.WB_Connecting_C.OnInputReleasedRight
// 0x0001 (0x0001 - 0x0000)
struct WB_Connecting_C_OnInputReleasedRight final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Connecting_C_OnInputReleasedRight;

// Function WB_Connecting.WB_Connecting_C.OnInputReleasedLeft
// 0x0001 (0x0001 - 0x0000)
struct WB_Connecting_C_OnInputReleasedLeft final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Connecting_C_OnInputReleasedLeft;

// Function WB_Connecting.WB_Connecting_C.OnInputReleasedDown
// 0x0001 (0x0001 - 0x0000)
struct WB_Connecting_C_OnInputReleasedDown final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Connecting_C_OnInputReleasedDown;

// Function WB_Connecting.WB_Connecting_C.OnInputReleasedDecide
// 0x0001 (0x0001 - 0x0000)
struct WB_Connecting_C_OnInputReleasedDecide final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Connecting_C_OnInputReleasedDecide;

// Function WB_Connecting.WB_Connecting_C.OnInputReleasedCancel
// 0x0001 (0x0001 - 0x0000)
struct WB_Connecting_C_OnInputReleasedCancel final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Connecting_C_OnInputReleasedCancel;

// Function WB_Connecting.WB_Connecting_C.OnInputPressedUp
// 0x0001 (0x0001 - 0x0000)
struct WB_Connecting_C_OnInputPressedUp final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Connecting_C_OnInputPressedUp;

// Function WB_Connecting.WB_Connecting_C.OnInputPressedRight
// 0x0001 (0x0001 - 0x0000)
struct WB_Connecting_C_OnInputPressedRight final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Connecting_C_OnInputPressedRight;

// Function WB_Connecting.WB_Connecting_C.OnInputPressedLeft
// 0x0001 (0x0001 - 0x0000)
struct WB_Connecting_C_OnInputPressedLeft final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Connecting_C_OnInputPressedLeft;

// Function WB_Connecting.WB_Connecting_C.OnInputPressedDown
// 0x0001 (0x0001 - 0x0000)
struct WB_Connecting_C_OnInputPressedDown final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Connecting_C_OnInputPressedDown;

// Function WB_Connecting.WB_Connecting_C.OnInputPressedDecide
// 0x0001 (0x0001 - 0x0000)
struct WB_Connecting_C_OnInputPressedDecide final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Connecting_C_OnInputPressedDecide;

// Function WB_Connecting.WB_Connecting_C.OnInputPressedCancel
// 0x0001 (0x0001 - 0x0000)
struct WB_Connecting_C_OnInputPressedCancel final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Connecting_C_OnInputPressedCancel;

// Function WB_Connecting.WB_Connecting_C.OnInputTurnRate
// 0x0008 (0x0008 - 0x0000)
struct WB_Connecting_C_OnInputTurnRate final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Connecting_C_OnInputTurnRate;

// Function WB_Connecting.WB_Connecting_C.OnInputReleasedTouch
// 0x0001 (0x0001 - 0x0000)
struct WB_Connecting_C_OnInputReleasedTouch final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Connecting_C_OnInputReleasedTouch;

// Function WB_Connecting.WB_Connecting_C.OnInputPressedTouch
// 0x000C (0x000C - 0x0000)
struct WB_Connecting_C_OnInputPressedTouch final
{
public:
	float                                         LocationX;                                         // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LocationY;                                         // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Connecting_C_OnInputPressedTouch;

// Function WB_Connecting.WB_Connecting_C.OnInputMoveRight
// 0x0008 (0x0008 - 0x0000)
struct WB_Connecting_C_OnInputMoveRight final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Connecting_C_OnInputMoveRight;

// Function WB_Connecting.WB_Connecting_C.OnInputMoveForward
// 0x0008 (0x0008 - 0x0000)
struct WB_Connecting_C_OnInputMoveForward final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Connecting_C_OnInputMoveForward;

// Function WB_Connecting.WB_Connecting_C.OnInputLookupRate
// 0x0008 (0x0008 - 0x0000)
struct WB_Connecting_C_OnInputLookupRate final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Connecting_C_OnInputLookupRate;

// Function WB_Connecting.WB_Connecting_C.IsModeless
// 0x0001 (0x0001 - 0x0000)
struct WB_Connecting_C_IsModeless final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Connecting_C_IsModeless;

// Function WB_Connecting.WB_Connecting_C.OnInputReleasedR2
// 0x0001 (0x0001 - 0x0000)
struct WB_Connecting_C_OnInputReleasedR2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Connecting_C_OnInputReleasedR2;

// Function WB_Connecting.WB_Connecting_C.OnInputReleasedR1
// 0x0001 (0x0001 - 0x0000)
struct WB_Connecting_C_OnInputReleasedR1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Connecting_C_OnInputReleasedR1;

// Function WB_Connecting.WB_Connecting_C.OnInputReleasedL2
// 0x0001 (0x0001 - 0x0000)
struct WB_Connecting_C_OnInputReleasedL2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Connecting_C_OnInputReleasedL2;

// Function WB_Connecting.WB_Connecting_C.OnInputReleasedL1
// 0x0001 (0x0001 - 0x0000)
struct WB_Connecting_C_OnInputReleasedL1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Connecting_C_OnInputReleasedL1;

// Function WB_Connecting.WB_Connecting_C.OnInputPressedR2
// 0x0001 (0x0001 - 0x0000)
struct WB_Connecting_C_OnInputPressedR2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Connecting_C_OnInputPressedR2;

// Function WB_Connecting.WB_Connecting_C.OnInputPressedR1
// 0x0001 (0x0001 - 0x0000)
struct WB_Connecting_C_OnInputPressedR1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Connecting_C_OnInputPressedR1;

// Function WB_Connecting.WB_Connecting_C.OnInputPressedL2
// 0x0001 (0x0001 - 0x0000)
struct WB_Connecting_C_OnInputPressedL2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Connecting_C_OnInputPressedL2;

// Function WB_Connecting.WB_Connecting_C.OnInputPressedL1
// 0x0001 (0x0001 - 0x0000)
struct WB_Connecting_C_OnInputPressedL1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Connecting_C_OnInputPressedL1;

// Function WB_Connecting.WB_Connecting_C.OnInputReleasedL3
// 0x0001 (0x0001 - 0x0000)
struct WB_Connecting_C_OnInputReleasedL3 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Connecting_C_OnInputReleasedL3;

// Function WB_Connecting.WB_Connecting_C.OnInputPressedL3
// 0x0001 (0x0001 - 0x0000)
struct WB_Connecting_C_OnInputPressedL3 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Connecting_C_OnInputPressedL3;

// Function WB_Connecting.WB_Connecting_C.OnInputPressedY
// 0x0001 (0x0001 - 0x0000)
struct WB_Connecting_C_OnInputPressedY final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Connecting_C_OnInputPressedY;

// Function WB_Connecting.WB_Connecting_C.OnInputPressedX
// 0x0001 (0x0001 - 0x0000)
struct WB_Connecting_C_OnInputPressedX final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Connecting_C_OnInputPressedX;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
