#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ChallengeEventProgressHeader

#include "Basic.hpp"

#include "AJB_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WB_ChallengeEventProgressHeader.WB_ChallengeEventProgressHeader_C.ExecuteUbergraph_WB_ChallengeEventProgressHeader
// 0x0078 (0x0078 - 0x0000)
struct WB_ChallengeEventProgressHeader_C_ExecuteUbergraph_WB_ChallengeEventProgressHeader final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FChallengeEventProgressContext         K2Node_CustomEvent_ProgressContext;                // 0x0008(0x0058)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0060(0x0018)()
};
DUMPER7_ASSERTS_WB_ChallengeEventProgressHeader_C_ExecuteUbergraph_WB_ChallengeEventProgressHeader;

// Function WB_ChallengeEventProgressHeader.WB_ChallengeEventProgressHeader_C.Setup
// 0x0058 (0x0058 - 0x0000)
struct WB_ChallengeEventProgressHeader_C_Setup final
{
public:
	struct FChallengeEventProgressContext         ProgressContext_0;                                 // 0x0000(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WB_ChallengeEventProgressHeader_C_Setup;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
