#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_CharaSelectDetail

#include "Basic.hpp"

#include "AJB_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WB_CharaSelectDetail.WB_CharaSelectDetail_C.ExecuteUbergraph_WB_CharaSelectDetail
// 0x0108 (0x0108 - 0x0000)
struct WB_CharaSelectDetail_C_ExecuteUbergraph_WB_CharaSelectDetail final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAJBCharacterInfo                      K2Node_CustomEvent_CharacterInfo;                  // 0x0008(0x00E8)(ConstParm)
	class FText                                   CallFunc_GetAJBBattleTypeString_Out;               // 0x00F0(0x0018)()
};
DUMPER7_ASSERTS_WB_CharaSelectDetail_C_ExecuteUbergraph_WB_CharaSelectDetail;

// Function WB_CharaSelectDetail.WB_CharaSelectDetail_C.UpdateDisplay
// 0x00E8 (0x00E8 - 0x0000)
struct WB_CharaSelectDetail_C_UpdateDisplay final
{
public:
	struct FAJBCharacterInfo                      CharacterInfo;                                     // 0x0000(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_WB_CharaSelectDetail_C_UpdateDisplay;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
