#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_CharaAchieve_SmallProgress

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WB_CharaAchieve_SmallProgress.WB_CharaAchieve_SmallProgress_C.ExecuteUbergraph_WB_CharaAchieve_SmallProgress
// 0x0040 (0x0040 - 0x0000)
struct WB_CharaAchieve_SmallProgress_C_ExecuteUbergraph_WB_CharaAchieve_SmallProgress final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue1;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue2;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue3;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEffectsAlsoBeDisplayed;              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SelectFloat_ReturnValue;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue4;          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue5;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_CharaAchieve_SmallProgress_C_ExecuteUbergraph_WB_CharaAchieve_SmallProgress;

// Function WB_CharaAchieve_SmallProgress.WB_CharaAchieve_SmallProgress_C.SetActiveDisplay
// 0x0001 (0x0001 - 0x0000)
struct WB_CharaAchieve_SmallProgress_C_SetActiveDisplay final
{
public:
	bool                                          bEffectsAlsoBeDisplayed;                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_CharaAchieve_SmallProgress_C_SetActiveDisplay;

// Function WB_CharaAchieve_SmallProgress.WB_CharaAchieve_SmallProgress_C.GetFadeInAnimation
// 0x0008 (0x0008 - 0x0000)
struct WB_CharaAchieve_SmallProgress_C_GetFadeInAnimation final
{
public:
	class UWidgetAnimation*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_CharaAchieve_SmallProgress_C_GetFadeInAnimation;

// Function WB_CharaAchieve_SmallProgress.WB_CharaAchieve_SmallProgress_C.GetFadeOutAnimation
// 0x0008 (0x0008 - 0x0000)
struct WB_CharaAchieve_SmallProgress_C_GetFadeOutAnimation final
{
public:
	class UWidgetAnimation*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_CharaAchieve_SmallProgress_C_GetFadeOutAnimation;

// Function WB_CharaAchieve_SmallProgress.WB_CharaAchieve_SmallProgress_C.GetLoopPillerMoveAnimation
// 0x0008 (0x0008 - 0x0000)
struct WB_CharaAchieve_SmallProgress_C_GetLoopPillerMoveAnimation final
{
public:
	class UWidgetAnimation*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_CharaAchieve_SmallProgress_C_GetLoopPillerMoveAnimation;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
