#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ChallengeEventProgressWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_structs.hpp"
#include "AJB_classes.hpp"
#include "UMG_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WB_ChallengeEventProgressWindow.WB_ChallengeEventProgressWindow_C
// 0x00F8 (0x03B8 - 0x02C0)
class UWB_ChallengeEventProgressWindow_C final : public UAJBWindowWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Appear;                                       // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBRetainerBox*                        AJBRetainerBox_0;                                  // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              BG;                                                // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SnapTouchScrollBox_C*               ClassesScrollBox;                                  // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ChallengeEventProgressFooter_C*     Footer;                                            // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ChallengeEventProgressHeader_C*     Header;                                            // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ChallengeEventClassList_C*          WB_ChallengeEventClassList;                        // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_CommonButton_C*                     WB_CommonButton_Close;                             // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_WindowFrame_C*                      WB_WindowFrame;                                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FChallengeEventProgressContext         ProgressContext;                                   // 0x0310(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UWB_ChallengeEventClassItem_C*>  ClassUIItemsToProgress;                            // 0x0368(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class AAJBHUDBase*                            AJBHUDBase;                                        // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_HUDCountDownTimerWrapper_C*         CountDownTimer;                                    // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeForCountDown;                                  // 0x0388(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WaitBeforeShowReward;                              // 0x038C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         WaitBeforeEnableCloseButton;                       // 0x0390(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnableApplyReward;                                // 0x0394(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_395[0x3];                                      // 0x0395(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ClassIndexToProgress;                              // 0x0398(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ClassIndexToScroll;                                // 0x039C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           ExpUpSEAkComponent;                                // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnPlayerOperationEnabled;                          // 0x03A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_WB_ChallengeEventProgressWindow(int32 EntryPoint);
	void PlayOnCloseSequence();
	void PlayOnOpenSequence();
	void OnCloseAnimationFinished();
	void OnOpenAnimationFinished();
	void OnCountDownTimerExpired();
	void OnExpUpFInishedOfClassItem();
	void BndEvt__ClassesScrollBox_K2Node_ComponentBoundEvent_2_OnSnapRightScrolled__DelegateSignature();
	void BndEvt__ClassesScrollBox_K2Node_ComponentBoundEvent_1_OnSnapLeftScrolled__DelegateSignature();
	void BndEvt__ClassesScrollBox_K2Node_ComponentBoundEvent_0_OnScrollMoved__DelegateSignature();
	void Scroll(int32 ClassIndexTo);
	void OnRewardWindowFinished();
	void OnDecidedCloseButton(class UAJBButtonWidget* OwnerWidget, class UAJBButton* TargetButton);
	void OnFooterAppearanceFinished();
	void ProgressNextClassItem();
	void ShowRewardWindow(const struct FChallengeEventClassContext& ClassContext);
	void StartToPlayerOperation();
	void ShowNextExp();
	void OnFinishedProgressOfClassItem(class UWB_ChallengeEventClassItem_C* ItemObj);
	void OnClosingWindow();
	void OnOpeningWindow();
	void Setup(const struct FChallengeEventProgressContext& ProgressContext_0, class AAJBHUDBase* AJBHUDBase_0);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void DebugSetupWithTestContext(class AAJBHUDBase* AJBHUDBase_0);
	int32 GetRestExpToClassUp();
	void SetEnableApplyReward(bool Enable);
	bool IsPlayerOperatable();
	void SetIsEnabledPlayerOperation(bool bInIsEnabled);
	void UpdateScrollArrowsVisibility();
	struct FAJBGameRewardInfo GetRewardInfoFromClassContext(const struct FChallengeEventClassContext& ClassContext);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_ChallengeEventProgressWindow_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_ChallengeEventProgressWindow_C")
	}
	static class UWB_ChallengeEventProgressWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ChallengeEventProgressWindow_C>();
	}
};
DUMPER7_ASSERTS_UWB_ChallengeEventProgressWindow_C;

SDK_NAMESPACE_END
