#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_CharaAchieve_Progress

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WB_CharaAchieve_Progress.WB_CharaAchieve_Progress_C.ExecuteUbergraph_WB_CharaAchieve_Progress
// 0x0028 (0x0028 - 0x0000)
struct WB_CharaAchieve_Progress_C_ExecuteUbergraph_WB_CharaAchieve_Progress final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       CallFunc_GetLoopPillerMoveAnimation_ReturnValue;   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CallFunc_GetFadeInAnimation_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       CallFunc_GetFadeOutAnimation_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bEffectsAlsoBeDisplayed;        // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_CharaAchieve_Progress_C_ExecuteUbergraph_WB_CharaAchieve_Progress;

// Function WB_CharaAchieve_Progress.WB_CharaAchieve_Progress_C.SetActiveDisplay
// 0x0001 (0x0001 - 0x0000)
struct WB_CharaAchieve_Progress_C_SetActiveDisplay final
{
public:
	bool                                          bEffectsAlsoBeDisplayed;                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_CharaAchieve_Progress_C_SetActiveDisplay;

// Function WB_CharaAchieve_Progress.WB_CharaAchieve_Progress_C.GetFadeInAnimation
// 0x0008 (0x0008 - 0x0000)
struct WB_CharaAchieve_Progress_C_GetFadeInAnimation final
{
public:
	class UWidgetAnimation*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_CharaAchieve_Progress_C_GetFadeInAnimation;

// Function WB_CharaAchieve_Progress.WB_CharaAchieve_Progress_C.GetFadeOutAnimation
// 0x0008 (0x0008 - 0x0000)
struct WB_CharaAchieve_Progress_C_GetFadeOutAnimation final
{
public:
	class UWidgetAnimation*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_CharaAchieve_Progress_C_GetFadeOutAnimation;

// Function WB_CharaAchieve_Progress.WB_CharaAchieve_Progress_C.GetLoopPillerMoveAnimation
// 0x0008 (0x0008 - 0x0000)
struct WB_CharaAchieve_Progress_C_GetLoopPillerMoveAnimation final
{
public:
	class UWidgetAnimation*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_CharaAchieve_Progress_C_GetLoopPillerMoveAnimation;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
