#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_CommonWIndow_S

#include "Basic.hpp"

#include "AJB_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WB_CommonWIndow_S.WB_CommonWIndow_S_C.ExecuteUbergraph_WB_CommonWIndow_S
// 0x01D0 (0x01D0 - 0x0000)
struct WB_CommonWIndow_S_C_ExecuteUbergraph_WB_CommonWIndow_S final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class FText                                   K2Node_CustomEvent_Title1;                         // 0x0018(0x0018)()
	class FText                                   K2Node_CustomEvent_Text2;                          // 0x0030(0x0018)()
	class FText                                   K2Node_CustomEvent_Text1;                          // 0x0048(0x0018)()
	class UAJBButtonWidget*                       K2Node_ComponentBoundEvent_OwnerWidget1;           // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             K2Node_ComponentBoundEvent_TargetButton1;          // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButtonWidget*                       K2Node_ComponentBoundEvent_OwnerWidget;            // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             K2Node_ComponentBoundEvent_TargetButton;           // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent;     // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent1;    // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent2;    // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent3;    // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_Title2;                         // 0x00B0(0x0018)()
	class FText                                   K2Node_CustomEvent_YesButton1;                     // 0x00C8(0x0018)()
	class FText                                   K2Node_CustomEvent_NoButton1;                      // 0x00E0(0x0018)()
	bool                                          CallFunc_FindAJBViewportWidgetOfClass_bSuccess;    // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_GameOver_C*                         CallFunc_FindAJBViewportWidgetOfClass_OutWidget;   // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum1_CmpSuccess;                     // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAJBWindowWidget*                       K2Node_CustomEvent_TargetWidget;                   // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPlayDecisionSE;              // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bIsPlayCancelSE;                // 0x011A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bIsPlayOpenSE;                  // 0x011B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bIsPlayCloseSE;                 // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable1;                               // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x011E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              Temp_byte_Variable2;                               // 0x011F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable3;                               // 0x0121(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable1;                               // 0x0122(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_123[0x5];                                      // 0x0123(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_Title;                          // 0x0128(0x0018)()
	class FText                                   K2Node_CustomEvent_Text;                           // 0x0140(0x0018)()
	class FText                                   K2Node_CustomEvent_YesButton;                      // 0x0158(0x0018)()
	class FText                                   K2Node_CustomEvent_NoButton;                       // 0x0170(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue1;                 // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select1_Default;                            // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18A[0x2];                                      // 0x018A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x018C(0x0010)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue;        // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_SlotAsVerticalBoxSlot_ReturnValue1;       // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin1;                         // 0x01B0(0x0010)(IsPlainOldData, NoDestructor)
	TDelegate<void(class UAJBWindowWidget* TargetWidget)> K2Node_CreateDelegate_OutputDelegate1;     // 0x01C0(0x0010)(ZeroConstructor, NoDestructor)
};
DUMPER7_ASSERTS_WB_CommonWIndow_S_C_ExecuteUbergraph_WB_CommonWIndow_S;

// Function WB_CommonWIndow_S.WB_CommonWIndow_S_C.ShowButton2AndText
// 0x0060 (0x0060 - 0x0000)
struct WB_CommonWIndow_S_C_ShowButton2AndText final
{
public:
	class FText                                   Title;                                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Text;                                              // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   YesButton;                                         // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   NoButton;                                          // 0x0048(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WB_CommonWIndow_S_C_ShowButton2AndText;

// Function WB_CommonWIndow_S.WB_CommonWIndow_S_C.SetIsPlaySE
// 0x0004 (0x0004 - 0x0000)
struct WB_CommonWIndow_S_C_SetIsPlaySE final
{
public:
	bool                                          bIsPlayDecisionSE;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsPlayCancelSE;                                   // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsPlayOpenSE_0;                                   // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsPlayCloseSE_0;                                  // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_CommonWIndow_S_C_SetIsPlaySE;

// Function WB_CommonWIndow_S.WB_CommonWIndow_S_C.OnOpeningGameOver
// 0x0008 (0x0008 - 0x0000)
struct WB_CommonWIndow_S_C_OnOpeningGameOver final
{
public:
	class UAJBWindowWidget*                       TargetWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_CommonWIndow_S_C_OnOpeningGameOver;

// Function WB_CommonWIndow_S.WB_CommonWIndow_S_C.BndEvt__WB_CommonButton_YES_K2Node_ComponentBoundEvent_1_OnAJBButtonEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_CommonWIndow_S_C_BndEvt__WB_CommonButton_YES_K2Node_ComponentBoundEvent_1_OnAJBButtonEvent__DelegateSignature final
{
public:
	class UAJBButtonWidget*                       OwnerWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             TargetButton;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_CommonWIndow_S_C_BndEvt__WB_CommonButton_YES_K2Node_ComponentBoundEvent_1_OnAJBButtonEvent__DelegateSignature;

// Function WB_CommonWIndow_S.WB_CommonWIndow_S_C.BndEvt__WB_CommonButton_NO_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_CommonWIndow_S_C_BndEvt__WB_CommonButton_NO_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature final
{
public:
	class UAJBButtonWidget*                       OwnerWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             TargetButton;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_CommonWIndow_S_C_BndEvt__WB_CommonButton_NO_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature;

// Function WB_CommonWIndow_S.WB_CommonWIndow_S_C.ShowTextOnly
// 0x0018 (0x0018 - 0x0000)
struct WB_CommonWIndow_S_C_ShowTextOnly final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WB_CommonWIndow_S_C_ShowTextOnly;

// Function WB_CommonWIndow_S.WB_CommonWIndow_S_C.ShowTitle
// 0x0030 (0x0030 - 0x0000)
struct WB_CommonWIndow_S_C_ShowTitle final
{
public:
	class FText                                   Title;                                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   Text;                                              // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WB_CommonWIndow_S_C_ShowTitle;

// Function WB_CommonWIndow_S.WB_CommonWIndow_S_C.ShowButton2
// 0x0048 (0x0048 - 0x0000)
struct WB_CommonWIndow_S_C_ShowButton2 final
{
public:
	class FText                                   Title;                                             // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   YesButton;                                         // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   NoButton;                                          // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WB_CommonWIndow_S_C_ShowButton2;

// Function WB_CommonWIndow_S.WB_CommonWIndow_S_C.GetButtonResult
// 0x0001 (0x0001 - 0x0000)
struct WB_CommonWIndow_S_C_GetButtonResult final
{
public:
	EAJBConfirmResult                             Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_CommonWIndow_S_C_GetButtonResult;

// Function WB_CommonWIndow_S.WB_CommonWIndow_S_C.OnInputReleasedUp
// 0x0001 (0x0001 - 0x0000)
struct WB_CommonWIndow_S_C_OnInputReleasedUp final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_CommonWIndow_S_C_OnInputReleasedUp;

// Function WB_CommonWIndow_S.WB_CommonWIndow_S_C.OnInputReleasedRight
// 0x0001 (0x0001 - 0x0000)
struct WB_CommonWIndow_S_C_OnInputReleasedRight final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_CommonWIndow_S_C_OnInputReleasedRight;

// Function WB_CommonWIndow_S.WB_CommonWIndow_S_C.OnInputReleasedLeft
// 0x0001 (0x0001 - 0x0000)
struct WB_CommonWIndow_S_C_OnInputReleasedLeft final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_CommonWIndow_S_C_OnInputReleasedLeft;

// Function WB_CommonWIndow_S.WB_CommonWIndow_S_C.OnInputReleasedDown
// 0x0001 (0x0001 - 0x0000)
struct WB_CommonWIndow_S_C_OnInputReleasedDown final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_CommonWIndow_S_C_OnInputReleasedDown;

// Function WB_CommonWIndow_S.WB_CommonWIndow_S_C.OnInputReleasedDecide
// 0x0001 (0x0001 - 0x0000)
struct WB_CommonWIndow_S_C_OnInputReleasedDecide final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_CommonWIndow_S_C_OnInputReleasedDecide;

// Function WB_CommonWIndow_S.WB_CommonWIndow_S_C.OnInputReleasedCancel
// 0x0001 (0x0001 - 0x0000)
struct WB_CommonWIndow_S_C_OnInputReleasedCancel final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_CommonWIndow_S_C_OnInputReleasedCancel;

// Function WB_CommonWIndow_S.WB_CommonWIndow_S_C.OnInputPressedUp
// 0x0001 (0x0001 - 0x0000)
struct WB_CommonWIndow_S_C_OnInputPressedUp final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_CommonWIndow_S_C_OnInputPressedUp;

// Function WB_CommonWIndow_S.WB_CommonWIndow_S_C.OnInputPressedRight
// 0x0001 (0x0001 - 0x0000)
struct WB_CommonWIndow_S_C_OnInputPressedRight final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_CommonWIndow_S_C_OnInputPressedRight;

// Function WB_CommonWIndow_S.WB_CommonWIndow_S_C.OnInputPressedLeft
// 0x0001 (0x0001 - 0x0000)
struct WB_CommonWIndow_S_C_OnInputPressedLeft final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_CommonWIndow_S_C_OnInputPressedLeft;

// Function WB_CommonWIndow_S.WB_CommonWIndow_S_C.OnInputPressedDown
// 0x0001 (0x0001 - 0x0000)
struct WB_CommonWIndow_S_C_OnInputPressedDown final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_CommonWIndow_S_C_OnInputPressedDown;

// Function WB_CommonWIndow_S.WB_CommonWIndow_S_C.OnInputPressedDecide
// 0x0001 (0x0001 - 0x0000)
struct WB_CommonWIndow_S_C_OnInputPressedDecide final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_CommonWIndow_S_C_OnInputPressedDecide;

// Function WB_CommonWIndow_S.WB_CommonWIndow_S_C.OnInputPressedCancel
// 0x0001 (0x0001 - 0x0000)
struct WB_CommonWIndow_S_C_OnInputPressedCancel final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_CommonWIndow_S_C_OnInputPressedCancel;

// Function WB_CommonWIndow_S.WB_CommonWIndow_S_C.OnInputTurnRate
// 0x0008 (0x0008 - 0x0000)
struct WB_CommonWIndow_S_C_OnInputTurnRate final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_CommonWIndow_S_C_OnInputTurnRate;

// Function WB_CommonWIndow_S.WB_CommonWIndow_S_C.OnInputReleasedTouch
// 0x0001 (0x0001 - 0x0000)
struct WB_CommonWIndow_S_C_OnInputReleasedTouch final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_CommonWIndow_S_C_OnInputReleasedTouch;

// Function WB_CommonWIndow_S.WB_CommonWIndow_S_C.OnInputPressedTouch
// 0x000C (0x000C - 0x0000)
struct WB_CommonWIndow_S_C_OnInputPressedTouch final
{
public:
	float                                         LocationX;                                         // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LocationY;                                         // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_CommonWIndow_S_C_OnInputPressedTouch;

// Function WB_CommonWIndow_S.WB_CommonWIndow_S_C.OnInputMoveRight
// 0x0008 (0x0008 - 0x0000)
struct WB_CommonWIndow_S_C_OnInputMoveRight final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_CommonWIndow_S_C_OnInputMoveRight;

// Function WB_CommonWIndow_S.WB_CommonWIndow_S_C.OnInputMoveForward
// 0x0008 (0x0008 - 0x0000)
struct WB_CommonWIndow_S_C_OnInputMoveForward final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_CommonWIndow_S_C_OnInputMoveForward;

// Function WB_CommonWIndow_S.WB_CommonWIndow_S_C.OnInputLookupRate
// 0x0008 (0x0008 - 0x0000)
struct WB_CommonWIndow_S_C_OnInputLookupRate final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_CommonWIndow_S_C_OnInputLookupRate;

// Function WB_CommonWIndow_S.WB_CommonWIndow_S_C.IsModeless
// 0x0001 (0x0001 - 0x0000)
struct WB_CommonWIndow_S_C_IsModeless final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_CommonWIndow_S_C_IsModeless;

// Function WB_CommonWIndow_S.WB_CommonWIndow_S_C.OnInputReleasedR2
// 0x0001 (0x0001 - 0x0000)
struct WB_CommonWIndow_S_C_OnInputReleasedR2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_CommonWIndow_S_C_OnInputReleasedR2;

// Function WB_CommonWIndow_S.WB_CommonWIndow_S_C.OnInputReleasedR1
// 0x0001 (0x0001 - 0x0000)
struct WB_CommonWIndow_S_C_OnInputReleasedR1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_CommonWIndow_S_C_OnInputReleasedR1;

// Function WB_CommonWIndow_S.WB_CommonWIndow_S_C.OnInputReleasedL3
// 0x0001 (0x0001 - 0x0000)
struct WB_CommonWIndow_S_C_OnInputReleasedL3 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_CommonWIndow_S_C_OnInputReleasedL3;

// Function WB_CommonWIndow_S.WB_CommonWIndow_S_C.OnInputReleasedL2
// 0x0001 (0x0001 - 0x0000)
struct WB_CommonWIndow_S_C_OnInputReleasedL2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_CommonWIndow_S_C_OnInputReleasedL2;

// Function WB_CommonWIndow_S.WB_CommonWIndow_S_C.OnInputReleasedL1
// 0x0001 (0x0001 - 0x0000)
struct WB_CommonWIndow_S_C_OnInputReleasedL1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_CommonWIndow_S_C_OnInputReleasedL1;

// Function WB_CommonWIndow_S.WB_CommonWIndow_S_C.OnInputPressedR2
// 0x0001 (0x0001 - 0x0000)
struct WB_CommonWIndow_S_C_OnInputPressedR2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_CommonWIndow_S_C_OnInputPressedR2;

// Function WB_CommonWIndow_S.WB_CommonWIndow_S_C.OnInputPressedR1
// 0x0001 (0x0001 - 0x0000)
struct WB_CommonWIndow_S_C_OnInputPressedR1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_CommonWIndow_S_C_OnInputPressedR1;

// Function WB_CommonWIndow_S.WB_CommonWIndow_S_C.OnInputPressedL3
// 0x0001 (0x0001 - 0x0000)
struct WB_CommonWIndow_S_C_OnInputPressedL3 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_CommonWIndow_S_C_OnInputPressedL3;

// Function WB_CommonWIndow_S.WB_CommonWIndow_S_C.OnInputPressedL2
// 0x0001 (0x0001 - 0x0000)
struct WB_CommonWIndow_S_C_OnInputPressedL2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_CommonWIndow_S_C_OnInputPressedL2;

// Function WB_CommonWIndow_S.WB_CommonWIndow_S_C.OnInputPressedL1
// 0x0001 (0x0001 - 0x0000)
struct WB_CommonWIndow_S_C_OnInputPressedL1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_CommonWIndow_S_C_OnInputPressedL1;

// Function WB_CommonWIndow_S.WB_CommonWIndow_S_C.OnInputPressedY
// 0x0001 (0x0001 - 0x0000)
struct WB_CommonWIndow_S_C_OnInputPressedY final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_CommonWIndow_S_C_OnInputPressedY;

// Function WB_CommonWIndow_S.WB_CommonWIndow_S_C.OnInputPressedX
// 0x0001 (0x0001 - 0x0000)
struct WB_CommonWIndow_S_C_OnInputPressedX final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_CommonWIndow_S_C_OnInputPressedX;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
