#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_CharacterSelect_PairInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_structs.hpp"
#include "AJB_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WB_CharacterSelect_PairInfo.WB_CharacterSelect_PairInfo_C
// 0x0130 (0x0378 - 0x0248)
class UWB_CharacterSelect_PairInfo_C final : public UAJBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0248(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Appear;                                            // 0x0250(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              Img_CharaIcon;                                     // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          Txt_CharacterName;                                 // 0x0260(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          Txt_PairPlayerName;                                // 0x0268(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          Txt_TitleName;                                     // 0x0270(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FAJBCharacterInfo                      CurrentPairCharacterInfo;                          // 0x0278(0x00E8)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bLoadedPlayerIcon;                                 // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CheckLoadedIconTimer;                              // 0x0368(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          bOpened;                                           // 0x0370(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WB_CharacterSelect_PairInfo(int32 EntryPoint);
	void OnCheckLoadedIcon();
	void Close();
	void Open();
	void SetPairCharacter(const struct FAJBCharacterInfo& AJBCharacterInfo);
	void SetPairInfo(const class FText& TitleName, const class FText& PairPlayerName);
	void OnLoaded_C683495D4A6FFF6328BC899C33F27267(class UObject* Loaded);
	void IsShowingUI(bool* bShow);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_CharacterSelect_PairInfo_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_CharacterSelect_PairInfo_C")
	}
	static class UWB_CharacterSelect_PairInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_CharacterSelect_PairInfo_C>();
	}
};
DUMPER7_ASSERTS_UWB_CharacterSelect_PairInfo_C;

SDK_NAMESPACE_END
