#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ChallengeEventProgressFooter

#include "Basic.hpp"

#include "AJB_structs.hpp"
#include "Engine_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WB_ChallengeEventProgressFooter.WB_ChallengeEventProgressFooter_C.ExecuteUbergraph_WB_ChallengeEventProgressFooter
// 0x0158 (0x0158 - 0x0000)
struct WB_ChallengeEventProgressFooter_C_ExecuteUbergraph_WB_ChallengeEventProgressFooter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetAJBConvertedServerDateTimeStringToText_Result; // 0x0008(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0020(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_GetAJBConvertedServerDateTimeStringToText_Result1; // 0x0060(0x0018)()
	int32                                         K2Node_CustomEvent_RestExpToNextClass;             // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData1;             // 0x0080(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x00C0(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D8(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E8(0x0018)()
	struct FChallengeEventProgressContext         K2Node_CustomEvent_ProgressContext;                // 0x0100(0x0058)()
};
DUMPER7_ASSERTS_WB_ChallengeEventProgressFooter_C_ExecuteUbergraph_WB_ChallengeEventProgressFooter;

// Function WB_ChallengeEventProgressFooter.WB_ChallengeEventProgressFooter_C.Setup
// 0x0058 (0x0058 - 0x0000)
struct WB_ChallengeEventProgressFooter_C_Setup final
{
public:
	struct FChallengeEventProgressContext         ProgressContext_0;                                 // 0x0000(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WB_ChallengeEventProgressFooter_C_Setup;

// Function WB_ChallengeEventProgressFooter.WB_ChallengeEventProgressFooter_C.Start
// 0x0004 (0x0004 - 0x0000)
struct WB_ChallengeEventProgressFooter_C_Start final
{
public:
	int32                                         RestExpToNextClass;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_ChallengeEventProgressFooter_C_Start;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
