#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_DBISequencerSkipper

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WB_DBISequencerSkipper.WB_DBISequencerSkipper_C
// 0x0038 (0x0240 - 0x0208)
class UWB_DBISequencerSkipper_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_FadeOut;                                      // 0x0210(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBButton*                             AJBButton_0;                                       // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_0;                                         // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	UMulticastDelegateProperty_                   OnClickedSkip;                                     // 0x0228(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          bAutoRemove;                                       // 0x0238(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WB_DBISequencerSkipper(int32 EntryPoint);
	void BndEvt__AJBButton_0_K2Node_ComponentBoundEvent_0_OnButtonPressedEvent__DelegateSignature();
	void BndEvt__Anim_FadeOut_K2Node_ComponentBoundEvent_1_OnWidgetAnimationPlaybackStatusChanged__DelegateSignature();
	void Close();
	void Reset();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_DBISequencerSkipper_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_DBISequencerSkipper_C")
	}
	static class UWB_DBISequencerSkipper_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_DBISequencerSkipper_C>();
	}
};
DUMPER7_ASSERTS_UWB_DBISequencerSkipper_C;

SDK_NAMESPACE_END
