#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_DBISequencerSubtitler

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WB_DBISequencerSubtitler.WB_DBISequencerSubtitler_C.ExecuteUbergraph_WB_DBISequencerSubtitler
// 0x0028 (0x0028 - 0x0000)
struct WB_DBISequencerSubtitler_C_ExecuteUbergraph_WB_DBISequencerSubtitler final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_InText;                         // 0x0008(0x0018)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_DBISequencerSubtitler_C_ExecuteUbergraph_WB_DBISequencerSubtitler;

// Function WB_DBISequencerSubtitler.WB_DBISequencerSubtitler_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_DBISequencerSubtitler_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_DBISequencerSubtitler_C_PreConstruct;

// Function WB_DBISequencerSubtitler.WB_DBISequencerSubtitler_C.SetSubtitle
// 0x0018 (0x0018 - 0x0000)
struct WB_DBISequencerSubtitler_C_SetSubtitle final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WB_DBISequencerSubtitler_C_SetSubtitle;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
