#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_EmissionRate_RarityList

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WB_EmissionRate_RarityList.WB_EmissionRate_RarityList_C.ExecuteUbergraph_WB_EmissionRate_RarityList
// 0x0020 (0x0020 - 0x0000)
struct WB_EmissionRate_RarityList_C_ExecuteUbergraph_WB_EmissionRate_RarityList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_Set_PercentNum;                 // 0x0008(0x0018)()
};
DUMPER7_ASSERTS_WB_EmissionRate_RarityList_C_ExecuteUbergraph_WB_EmissionRate_RarityList;

// Function WB_EmissionRate_RarityList.WB_EmissionRate_RarityList_C.SetTextPercentNum
// 0x0018 (0x0018 - 0x0000)
struct WB_EmissionRate_RarityList_C_SetTextPercentNum final
{
public:
	class FText                                   Set_PercentNum_0;                                  // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WB_EmissionRate_RarityList_C_SetTextPercentNum;

// Function WB_EmissionRate_RarityList.WB_EmissionRate_RarityList_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_EmissionRate_RarityList_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_EmissionRate_RarityList_C_PreConstruct;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
