#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ERayGaugeList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WB_ERayGaugeList.WB_ERayGaugeList_C
// 0x0050 (0x0258 - 0x0208)
class UWB_ERayGaugeList_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasPanel_Root;                                  // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          Text_Max;                                          // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          Text_Percent;                                      // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ERayGauge_C*                        WB_ERayGauge_1;                                    // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ERayGauge_C*                        WB_ERayGauge_2;                                    // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWB_VirusCapsule_C*>             WB_VirusCapsuleArray;                              // 0x0238(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         GaugeNum;                                          // 0x0248(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24C[0x4];                                      // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameCharacter_C*               TargetUICharacter;                                 // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ERayGaugeList(int32 EntryPoint);
	void Initialize(class ABP_AJBInGameCharacter_C* TargetUICharacter_0);
	void UpdateERayGauge(float ERayValuce);
	void Construct();
	void Update_ERayGaugeNum(int32 GaugeCount);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_ERayGaugeList_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_ERayGaugeList_C")
	}
	static class UWB_ERayGaugeList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ERayGaugeList_C>();
	}
};
DUMPER7_ASSERTS_UWB_ERayGaugeList_C;

SDK_NAMESPACE_END
