#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_EmissionRate_LimitedRarityList

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WB_EmissionRate_LimitedRarityList.WB_EmissionRate_LimitedRarityList_C
// 0x00A0 (0x02A8 - 0x0208)
class UWB_EmissionRate_LimitedRarityList_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UAJBTextBlock*                          AJBText_PickUpItemName;                            // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          AJBText_PickUpItemType;                            // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          TEXT_RARE;                                         // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_Rarity_C*                           WB_Rarity;                                         // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWB_EmptyStar_C*>                RarityList_Star;                                   // 0x0230(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	int32                                         Set_StarNum;                                       // 0x0240(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_244[0x4];                                      // 0x0244(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Set_PercentNum;                                    // 0x0248(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ExposeOnSpawn)
	class FText                                   Set_PickUpItemName;                                // 0x0260(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ExposeOnSpawn)
	class FText                                   Set_PickUpItemTypeName;                            // 0x0278(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ExposeOnSpawn)
	class FText                                   Set_PickUpItemCharacterName;                       // 0x0290(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ExposeOnSpawn)

public:
	void ExecuteUbergraph_WB_EmissionRate_LimitedRarityList(int32 EntryPoint);
	void Construct();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_EmissionRate_LimitedRarityList_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_EmissionRate_LimitedRarityList_C")
	}
	static class UWB_EmissionRate_LimitedRarityList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_EmissionRate_LimitedRarityList_C>();
	}
};
DUMPER7_ASSERTS_UWB_EmissionRate_LimitedRarityList_C;

SDK_NAMESPACE_END
