#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_EmoteChange_Window

#include "Basic.hpp"

#include "AJB_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.ExecuteUbergraph_WB_EmoteChange_Window
// 0x05D8 (0x05D8 - 0x0000)
struct WB_EmoteChange_Window_C_ExecuteUbergraph_WB_EmoteChange_Window final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Temp_float_Variable;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Temp_float_Variable1;                              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_CommonWIndow_S_C*                   CallFunc_Create_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class UAJBWindowWidget*                       K2Node_CustomEvent_TargetWidget2;                  // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAJBWindowWidget* TargetWidget)> K2Node_CreateDelegate_OutputDelegate1;     // 0x0030(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UAJBWindowWidget* TargetWidget)> K2Node_CreateDelegate_OutputDelegate2;     // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	class UAJBWindowWidget*                       K2Node_CustomEvent_TargetWidget1;                  // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0058(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButtonWidget*                       K2Node_ComponentBoundEvent_OwnerWidget4;           // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             K2Node_ComponentBoundEvent_TargetButton4;          // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButtonWidget*                       K2Node_ComponentBoundEvent_OwnerWidget3;           // 0x00B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             K2Node_ComponentBoundEvent_TargetButton3;          // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPressableButton_ReturnValue;            // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPressableButton_ReturnValue1;           // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C2[0x6];                                       // 0x00C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAJBButtonWidget*                       K2Node_ComponentBoundEvent_OwnerWidget2;           // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             K2Node_ComponentBoundEvent_TargetButton2;          // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButtonWidget*                       K2Node_ComponentBoundEvent_OwnerWidget1;           // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             K2Node_ComponentBoundEvent_TargetButton1;          // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPressableButton_ReturnValue2;           // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPressableButton_ReturnValue3;           // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAJBWindowWidget*                       K2Node_CustomEvent_TargetWidget;                   // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent;     // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Position;                       // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAJBNetAPIResult                              Temp_byte_Variable;                                // 0x0104(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_105[0x3];                                      // 0x0105(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAJBButtonWidget*                       K2Node_ComponentBoundEvent_OwnerWidget;            // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             K2Node_ComponentBoundEvent_TargetButton;           // 0x0110(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent1;    // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_CharacterName4;                 // 0x0120(0x0018)()
	class FText                                   K2Node_CustomEvent_EmoteName4;                     // 0x0138(0x0018)()
	EAJBNetAPIResult                              K2Node_CustomEvent_Result;                         // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_CharacterName3;                 // 0x0158(0x0018)()
	class FText                                   K2Node_CustomEvent_EmoteName3;                     // 0x0170(0x0018)()
	TDelegate<void(EAJBNetAPIResult Result)>      K2Node_CreateDelegate_OutputDelegate3;             // 0x0188(0x0010)(ZeroConstructor, NoDestructor)
	EAJBNetAPIResult                              K2Node_CustomEvent_Result1;                        // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_199[0x7];                                      // 0x0199(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_CharacterName2;                 // 0x01A0(0x0018)()
	class FText                                   K2Node_CustomEvent_EmoteName2;                     // 0x01B8(0x0018)()
	TDelegate<void(EAJBNetAPIResult Result)>      K2Node_CreateDelegate_OutputDelegate4;             // 0x01D0(0x0010)(ZeroConstructor, NoDestructor)
	class FText                                   K2Node_CustomEvent_CharacterName1;                 // 0x01E0(0x0018)()
	class FText                                   K2Node_CustomEvent_EmoteName1;                     // 0x01F8(0x0018)()
	class FString                                 Temp_string_Variable;                              // 0x0210(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable1;                             // 0x0220(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_DirectionIndex;                 // 0x0230(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_234[0x4];                                      // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_CustomEvent_CharacterName;                  // 0x0238(0x0018)()
	class FText                                   K2Node_CustomEvent_EmoteName;                      // 0x0250(0x0018)()
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Temp_string_Variable2;                             // 0x0270(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable3;                             // 0x0280(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_295[0x3];                                      // 0x0295(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FEmoteData>                     CallFunc_GetPlayerCharacterEmoteData_OutEmoteData; // 0x02A0(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_GetPlayerCharacterEmoteData_ReturnValue;  // 0x02B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAJBCharacterInfo                      CallFunc_GetCharacterInfoByCharaIndex_Out;         // 0x02B8(0x00E8)()
	bool                                          CallFunc_GetCharacterInfoByCharaIndex_ReturnValue; // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A1[0x7];                                      // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEmoteData                             CallFunc_Array_Get_Item;                           // 0x03A8(0x0028)()
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x03D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D4[0x4];                                      // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetAJBRewardItemTypeString_Out;           // 0x03D8(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x03F0(0x0040)(HasGetValueTypeHash)
	TDelegate<void(class UAJBWindowWidget* TargetWidget)> K2Node_CreateDelegate_OutputDelegate5;     // 0x0430(0x0010)(ZeroConstructor, NoDestructor)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0440(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0450(0x0018)()
	class UNetHttp*                               CallFunc_Create_ReturnValue1;                      // 0x0468(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable4;                             // 0x0470(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable5;                             // 0x0480(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable6;                             // 0x0490(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ERewardItemType                               Temp_byte_Variable1;                               // 0x04A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A1[0x7];                                      // 0x04A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_Select_Default;                             // 0x04A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_RewardNo;                       // 0x04B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_CharacterID;                    // 0x04BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERewardItemType                               K2Node_CustomEvent_RewardItemType;                 // 0x04C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C1[0x7];                                      // 0x04C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_RewardString;                   // 0x04C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x04D8(0x0018)()
	class FText                                   K2Node_CustomEvent_TargetText;                     // 0x04F0(0x0018)()
	class UTextBlock*                             K2Node_CustomEvent_TargetTextWidget;               // 0x0508(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetAJBEmoteChangeLimitStringLen_Len;      // 0x0510(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_514[0x4];                                      // 0x0514(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0518(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Left_ReturnValue;                         // 0x0528(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FAJBSetGameRewardParam                 K2Node_MakeStruct_AJBSetGameRewardParam;           // 0x0538(0x0020)()
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0558(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAJBNetAPI*                             CallFunc_Request_ResultSetReward_ReturnValue;      // 0x0568(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue1;           // 0x0570(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0588(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_589[0x3];                                      // 0x0589(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Len_ReturnValue;                          // 0x058C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0590(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0591(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_592[0x6];                                      // 0x0592(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CommonWIndow_S_C*                   CallFunc_Create_ReturnValue2;                      // 0x0598(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x05A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5A1[0x3];                                      // 0x05A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select1_Default;                            // 0x05A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x05A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AC[0x4];                                      // 0x05AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x05B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x05B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5B9[0x7];                                      // 0x05B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x05C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAJBHUDBase*                            K2Node_DynamicCast_AsAJBHUDBase;                   // 0x05C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x05D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x05D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5D2[0x2];                                      // 0x05D2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x05D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_ExecuteUbergraph_WB_EmoteChange_Window;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.UpdateText
// 0x0020 (0x0020 - 0x0000)
struct WB_EmoteChange_Window_C_UpdateText final
{
public:
	class FText                                   TargetText;                                        // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UTextBlock*                             TargetTextWidget;                                  // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_UpdateText;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.SetupParam
// 0x0020 (0x0020 - 0x0000)
struct WB_EmoteChange_Window_C_SetupParam final
{
public:
	int32                                         RewardNo_0;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CharacterID_0;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERewardItemType                               RewardItemType_0;                                  // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 RewardString_0;                                    // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_SetupParam;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.ChangeEmoteInfo
// 0x0038 (0x0038 - 0x0000)
struct WB_EmoteChange_Window_C_ChangeEmoteInfo final
{
public:
	int32                                         DirectionIndex;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CharacterName;                                     // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   EmoteName;                                         // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_ChangeEmoteInfo;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.ChangeLeftEmoteInfo
// 0x0030 (0x0030 - 0x0000)
struct WB_EmoteChange_Window_C_ChangeLeftEmoteInfo final
{
public:
	class FText                                   CharacterName;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   EmoteName;                                         // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_ChangeLeftEmoteInfo;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.ChangeRightEmoteInfo
// 0x0030 (0x0030 - 0x0000)
struct WB_EmoteChange_Window_C_ChangeRightEmoteInfo final
{
public:
	class FText                                   CharacterName;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   EmoteName;                                         // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_ChangeRightEmoteInfo;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.ChangeBottomEmoteInfo
// 0x0030 (0x0030 - 0x0000)
struct WB_EmoteChange_Window_C_ChangeBottomEmoteInfo final
{
public:
	class FText                                   CharacterName;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   EmoteName;                                         // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_ChangeBottomEmoteInfo;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.ChangeTopEmoteInfo
// 0x0030 (0x0030 - 0x0000)
struct WB_EmoteChange_Window_C_ChangeTopEmoteInfo final
{
public:
	class FText                                   CharacterName;                                     // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   EmoteName;                                         // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_ChangeTopEmoteInfo;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.BndEvt__WB_CommonButton_Cancel_K2Node_ComponentBoundEvent_5_OnAJBButtonEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_EmoteChange_Window_C_BndEvt__WB_CommonButton_Cancel_K2Node_ComponentBoundEvent_5_OnAJBButtonEvent__DelegateSignature final
{
public:
	class UAJBButtonWidget*                       OwnerWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             TargetButton;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_BndEvt__WB_CommonButton_Cancel_K2Node_ComponentBoundEvent_5_OnAJBButtonEvent__DelegateSignature;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.RequestChangeEmote
// 0x0004 (0x0004 - 0x0000)
struct WB_EmoteChange_Window_C_RequestChangeEmote final
{
public:
	int32                                         Position;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_RequestChangeEmote;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.OnClosedNotifyEmotionChangeConfirm
// 0x0008 (0x0008 - 0x0000)
struct WB_EmoteChange_Window_C_OnClosedNotifyEmotionChangeConfirm final
{
public:
	class UAJBWindowWidget*                       TargetWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_OnClosedNotifyEmotionChangeConfirm;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.BndEvt__WB_CommonButton_Top_K2Node_ComponentBoundEvent_3_OnAJBButtonEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_EmoteChange_Window_C_BndEvt__WB_CommonButton_Top_K2Node_ComponentBoundEvent_3_OnAJBButtonEvent__DelegateSignature final
{
public:
	class UAJBButtonWidget*                       OwnerWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             TargetButton;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_BndEvt__WB_CommonButton_Top_K2Node_ComponentBoundEvent_3_OnAJBButtonEvent__DelegateSignature;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.BndEvt__WB_CommonButton_Right_K2Node_ComponentBoundEvent_2_OnAJBButtonEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_EmoteChange_Window_C_BndEvt__WB_CommonButton_Right_K2Node_ComponentBoundEvent_2_OnAJBButtonEvent__DelegateSignature final
{
public:
	class UAJBButtonWidget*                       OwnerWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             TargetButton;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_BndEvt__WB_CommonButton_Right_K2Node_ComponentBoundEvent_2_OnAJBButtonEvent__DelegateSignature;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.BndEvt__WB_CommonButton_Bottom_K2Node_ComponentBoundEvent_1_OnAJBButtonEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_EmoteChange_Window_C_BndEvt__WB_CommonButton_Bottom_K2Node_ComponentBoundEvent_1_OnAJBButtonEvent__DelegateSignature final
{
public:
	class UAJBButtonWidget*                       OwnerWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             TargetButton;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_BndEvt__WB_CommonButton_Bottom_K2Node_ComponentBoundEvent_1_OnAJBButtonEvent__DelegateSignature;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.BndEvt__WB_CommonButton_Left_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_EmoteChange_Window_C_BndEvt__WB_CommonButton_Left_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature final
{
public:
	class UAJBButtonWidget*                       OwnerWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             TargetButton;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_BndEvt__WB_CommonButton_Left_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_EmoteChange_Window_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_Tick;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.OnClosedWindow
// 0x0008 (0x0008 - 0x0000)
struct WB_EmoteChange_Window_C_OnClosedWindow final
{
public:
	class UAJBWindowWidget*                       TargetWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_OnClosedWindow;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.OnOpenedWindow
// 0x0008 (0x0008 - 0x0000)
struct WB_EmoteChange_Window_C_OnOpenedWindow final
{
public:
	class UAJBWindowWidget*                       TargetWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_OnOpenedWindow;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.OnSuccess_7F1CACB54C174945FB87CCBFF9C3464D
// 0x0001 (0x0001 - 0x0000)
struct WB_EmoteChange_Window_C_OnSuccess_7F1CACB54C174945FB87CCBFF9C3464D final
{
public:
	EAJBNetAPIResult                              Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_OnSuccess_7F1CACB54C174945FB87CCBFF9C3464D;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.OnFailed_7F1CACB54C174945FB87CCBFF9C3464D
// 0x0001 (0x0001 - 0x0000)
struct WB_EmoteChange_Window_C_OnFailed_7F1CACB54C174945FB87CCBFF9C3464D final
{
public:
	EAJBNetAPIResult                              Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_OnFailed_7F1CACB54C174945FB87CCBFF9C3464D;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.OnInputTurnRate
// 0x0008 (0x0008 - 0x0000)
struct WB_EmoteChange_Window_C_OnInputTurnRate final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_OnInputTurnRate;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.OnInputReleasedUp
// 0x0001 (0x0001 - 0x0000)
struct WB_EmoteChange_Window_C_OnInputReleasedUp final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_OnInputReleasedUp;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.OnInputReleasedTouch
// 0x0001 (0x0001 - 0x0000)
struct WB_EmoteChange_Window_C_OnInputReleasedTouch final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_OnInputReleasedTouch;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.OnInputReleasedRight
// 0x0001 (0x0001 - 0x0000)
struct WB_EmoteChange_Window_C_OnInputReleasedRight final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_OnInputReleasedRight;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.OnInputReleasedLeft
// 0x0001 (0x0001 - 0x0000)
struct WB_EmoteChange_Window_C_OnInputReleasedLeft final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_OnInputReleasedLeft;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.OnInputReleasedDown
// 0x0001 (0x0001 - 0x0000)
struct WB_EmoteChange_Window_C_OnInputReleasedDown final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_OnInputReleasedDown;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.OnInputReleasedDecide
// 0x0001 (0x0001 - 0x0000)
struct WB_EmoteChange_Window_C_OnInputReleasedDecide final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_OnInputReleasedDecide;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.OnInputReleasedCancel
// 0x0001 (0x0001 - 0x0000)
struct WB_EmoteChange_Window_C_OnInputReleasedCancel final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_OnInputReleasedCancel;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.OnInputPressedUp
// 0x0001 (0x0001 - 0x0000)
struct WB_EmoteChange_Window_C_OnInputPressedUp final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_OnInputPressedUp;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.OnInputPressedTouch
// 0x000C (0x000C - 0x0000)
struct WB_EmoteChange_Window_C_OnInputPressedTouch final
{
public:
	float                                         LocationX;                                         // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LocationY;                                         // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_OnInputPressedTouch;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.OnInputPressedRight
// 0x0001 (0x0001 - 0x0000)
struct WB_EmoteChange_Window_C_OnInputPressedRight final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_OnInputPressedRight;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.OnInputPressedLeft
// 0x0001 (0x0001 - 0x0000)
struct WB_EmoteChange_Window_C_OnInputPressedLeft final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_OnInputPressedLeft;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.OnInputPressedDown
// 0x0001 (0x0001 - 0x0000)
struct WB_EmoteChange_Window_C_OnInputPressedDown final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_OnInputPressedDown;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.OnInputPressedDecide
// 0x0020 (0x0020 - 0x0000)
struct WB_EmoteChange_Window_C_OnInputPressedDecide final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CommonButton_C*                     SelectingButtonLocal;                              // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_CommonButton_C*                     CallFunc_GetSelectingButton_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_OnInputPressedDecide;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.OnInputPressedCancel
// 0x0001 (0x0001 - 0x0000)
struct WB_EmoteChange_Window_C_OnInputPressedCancel final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_OnInputPressedCancel;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.OnInputMoveRight
// 0x0008 (0x0008 - 0x0000)
struct WB_EmoteChange_Window_C_OnInputMoveRight final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_OnInputMoveRight;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.OnInputMoveForward
// 0x0008 (0x0008 - 0x0000)
struct WB_EmoteChange_Window_C_OnInputMoveForward final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_OnInputMoveForward;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.OnInputLookupRate
// 0x0008 (0x0008 - 0x0000)
struct WB_EmoteChange_Window_C_OnInputLookupRate final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_OnInputLookupRate;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.IsModeless
// 0x0001 (0x0001 - 0x0000)
struct WB_EmoteChange_Window_C_IsModeless final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_IsModeless;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.OnInputReleasedR2
// 0x0001 (0x0001 - 0x0000)
struct WB_EmoteChange_Window_C_OnInputReleasedR2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_OnInputReleasedR2;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.OnInputReleasedR1
// 0x0001 (0x0001 - 0x0000)
struct WB_EmoteChange_Window_C_OnInputReleasedR1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_OnInputReleasedR1;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.OnInputReleasedL3
// 0x0001 (0x0001 - 0x0000)
struct WB_EmoteChange_Window_C_OnInputReleasedL3 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_OnInputReleasedL3;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.OnInputReleasedL2
// 0x0001 (0x0001 - 0x0000)
struct WB_EmoteChange_Window_C_OnInputReleasedL2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_OnInputReleasedL2;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.OnInputReleasedL1
// 0x0001 (0x0001 - 0x0000)
struct WB_EmoteChange_Window_C_OnInputReleasedL1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_OnInputReleasedL1;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.OnInputPressedR2
// 0x0001 (0x0001 - 0x0000)
struct WB_EmoteChange_Window_C_OnInputPressedR2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_OnInputPressedR2;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.OnInputPressedR1
// 0x0001 (0x0001 - 0x0000)
struct WB_EmoteChange_Window_C_OnInputPressedR1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_OnInputPressedR1;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.OnInputPressedL3
// 0x0001 (0x0001 - 0x0000)
struct WB_EmoteChange_Window_C_OnInputPressedL3 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_OnInputPressedL3;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.OnInputPressedL2
// 0x0001 (0x0001 - 0x0000)
struct WB_EmoteChange_Window_C_OnInputPressedL2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_OnInputPressedL2;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.OnInputPressedL1
// 0x0001 (0x0001 - 0x0000)
struct WB_EmoteChange_Window_C_OnInputPressedL1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_OnInputPressedL1;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.OnInputPressedY
// 0x0001 (0x0001 - 0x0000)
struct WB_EmoteChange_Window_C_OnInputPressedY final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_OnInputPressedY;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.OnInputPressedX
// 0x0001 (0x0001 - 0x0000)
struct WB_EmoteChange_Window_C_OnInputPressedX final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_OnInputPressedX;

// Function WB_EmoteChange_Window.WB_EmoteChange_Window_C.GetSelectingButton
// 0x0020 (0x0020 - 0x0000)
struct WB_EmoteChange_Window_C_GetSelectingButton final
{
public:
	class UWB_CommonButton_C*                     ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CommonButton_C*                     Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_CommonButton_C*                     K2Node_Select_Default;                             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_EmoteChange_Window_C_GetSelectingButton;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
