#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_EmoneyButton_OK

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WB_EmoneyButton_OK.WB_EmoneyButton_OK_C
// 0x0028 (0x02C8 - 0x02A0)
class UWB_EmoneyButton_OK_C final : public UAJBButtonWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Pressed;                                      // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_GrayOut;                                  // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBButton*                             Button;                                            // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_0;                                     // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__Button_K2Node_ComponentBoundEvent_0_OnButtonCancelledEvent__DelegateSignature();
	void ExecuteUbergraph_WB_EmoneyButton_OK(int32 EntryPoint);
	class UAJBButton* GetButton();
	void OnButtonPressedAnimation();
	void OnButtonReleasedAnimation();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_EmoneyButton_OK_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_EmoneyButton_OK_C")
	}
	static class UWB_EmoneyButton_OK_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_EmoneyButton_OK_C>();
	}
};
DUMPER7_ASSERTS_UWB_EmoneyButton_OK_C;

SDK_NAMESPACE_END
