#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_FastMove

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WB_FastMove.WB_FastMove_C
// 0x0030 (0x0238 - 0x0208)
class UWB_FastMove_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UWB_VirusCapsule_C*                     WB_VirusCapsule01;                                 // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_VirusCapsule_C*                     WB_VirusCapsule02;                                 // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_VirusCapsule_C*                     WB_VirusCapsule03;                                 // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWB_VirusCapsule_C*>             WB_VirusCapsuleArray;                              // 0x0228(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WB_FastMove(int32 EntryPoint);
	void Construct();
	void UpdateUI(int32 Num);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_FastMove_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_FastMove_C")
	}
	static class UWB_FastMove_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_FastMove_C>();
	}
};
DUMPER7_ASSERTS_UWB_FastMove_C;

SDK_NAMESPACE_END
