#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_GameResultBonusPoint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "AJB_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WB_GameResultBonusPoint.WB_GameResultBonusPoint_C
// 0x0038 (0x0240 - 0x0208)
class UWB_GameResultBonusPoint_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Appear;                                            // 0x0210(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          Point;                                             // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          TicketUnit;                                        // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          Title;                                             // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       CachedTargetAnimation;                             // 0x0230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OutViewUMGAnimationElapsedTime;                    // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bVisibleTicket;                                    // 0x023C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          bSetup;                                            // 0x023D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WB_GameResultBonusPoint(int32 EntryPoint);
	void Construct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdateOutViewUMGAnimation();
	void StartOutViewUMGAnimation(class UWidgetAnimation* Target);
	void OnAnimationFinished_OutViewUMGAnimation();
	void PlayBonusPointAnimation(float DelayTime);
	void UpdateDisplay(const class FText& Title_0, EAJBLimitedBounusSign Sign, float Value);
	void IsUsedWidget(bool* bUsed);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_GameResultBonusPoint_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_GameResultBonusPoint_C")
	}
	static class UWB_GameResultBonusPoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_GameResultBonusPoint_C>();
	}
};
DUMPER7_ASSERTS_UWB_GameResultBonusPoint_C;

SDK_NAMESPACE_END
