#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_GameModeView

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_classes.hpp"
#include "UMG_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WB_GameModeView.WB_GameModeView_C
// 0x0030 (0x02F0 - 0x02C0)
class UWB_GameModeView_C final : public UAJBWindowWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_SwitchVictoryShot;                            // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_SwtichGameResult;                             // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_OfflineModeLabel_C*                 WB_OfflineModeLabel;                               // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_TournamentModeLabel_C*              WB_TournamentModeLabel;                            // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bOfflineModeCheck;                                 // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bInGameModeCheck;                                  // 0x02E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bPPBuyUICheck;                                     // 0x02EA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WB_GameModeView(int32 EntryPoint);
	void ChangeDisplayMode();
	void Construct();
	void CustomEvent_0();
	void OnClosed(class UAJBWindowWidget* TargetWidget);
	void OnClosingWindow();
	void OnOpen(class UAJBWindowWidget* TargetWidget);
	void OnOpeningWindow();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_GameModeView_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_GameModeView_C")
	}
	static class UWB_GameModeView_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_GameModeView_C>();
	}
};
DUMPER7_ASSERTS_UWB_GameModeView_C;

SDK_NAMESPACE_END
