#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Highlight_LoadingWindow

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WB_Highlight_LoadingWindow.WB_Highlight_LoadingWindow_C.ExecuteUbergraph_WB_Highlight_LoadingWindow
// 0x0020 (0x0020 - 0x0000)
struct WB_Highlight_LoadingWindow_C_ExecuteUbergraph_WB_Highlight_LoadingWindow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Value;                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent;     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
};
DUMPER7_ASSERTS_WB_Highlight_LoadingWindow_C_ExecuteUbergraph_WB_Highlight_LoadingWindow;

// Function WB_Highlight_LoadingWindow.WB_Highlight_LoadingWindow_C.UpdateProgressBar
// 0x0004 (0x0004 - 0x0000)
struct WB_Highlight_LoadingWindow_C_UpdateProgressBar final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_Highlight_LoadingWindow_C_UpdateProgressBar;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
