#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_IngameCustomizeSelecter

#include "Basic.hpp"

#include "UMG_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WB_IngameCustomizeSelecter.WB_IngameCustomizeSelecter_C
// 0x0030 (0x0238 - 0x0208)
class UWB_IngameCustomizeSelecter_C final : public UUserWidget
{
public:
	class UImage*                                 BG_1;                                              // 0x0208(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 BG_2;                                              // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          Text_CustomizeName;                                // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          Text_CustomizeType;                                // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ArrowButton_Small_R_C*              WB_ArrowButton_Small_L;                            // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ArrowButton_Small_R_C*              WB_ArrowButton_Small_R;                            // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_IngameCustomizeSelecter_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_IngameCustomizeSelecter_C")
	}
	static class UWB_IngameCustomizeSelecter_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_IngameCustomizeSelecter_C>();
	}
};
DUMPER7_ASSERTS_UWB_IngameCustomizeSelecter_C;

SDK_NAMESPACE_END
