#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_LandmarkPlayerMarker

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WB_LandmarkBase_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WB_LandmarkPlayerMarker.WB_LandmarkPlayerMarker_C
// 0x0038 (0x02A8 - 0x0270)
class UWB_LandmarkPlayerMarker_C final : public UWB_LandmarkBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WB_LandmarkPlayerMarker_C;          // 0x0270(0x0008)(Transient, DuplicateTransient)
	class UAJBImage*                              AJBImage_Pin;                                      // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_Pin;                                       // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_SubPixeler;                            // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_Scaler;                                   // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Resizer;                                   // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         PrevScale;                                         // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_LandmarkPlayerMarker(int32 EntryPoint);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void SetInnerScale(float InnerScale_0);

	void IsTouchMarker(const struct FVector2D& TouchPosition, float Scale, bool* IsTouch) const;
	void GetContentWidget(class UWidget** ContentWidget) const;
	class URetainerBox* GetRetainerBoxWidget() const;
	void GetResizerWidget(class USizeBox** SizeBox) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_LandmarkPlayerMarker_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_LandmarkPlayerMarker_C")
	}
	static class UWB_LandmarkPlayerMarker_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_LandmarkPlayerMarker_C>();
	}
};
DUMPER7_ASSERTS_UWB_LandmarkPlayerMarker_C;

SDK_NAMESPACE_END
