#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_LandmarkPlayer

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WB_LandmarkPlayer.WB_LandmarkPlayer_C.ExecuteUbergraph_WB_LandmarkPlayer
// 0x0058 (0x0058 - 0x0000)
struct WB_LandmarkPlayer_C_ExecuteUbergraph_WB_LandmarkPlayer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InnerScale;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0010(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bEnableBlink;                         // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_LandmarkPlayer_C_ExecuteUbergraph_WB_LandmarkPlayer;

// Function WB_LandmarkPlayer.WB_LandmarkPlayer_C.SetupBlink
// 0x0001 (0x0001 - 0x0000)
struct WB_LandmarkPlayer_C_SetupBlink final
{
public:
	bool                                          bEnableBlink;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_LandmarkPlayer_C_SetupBlink;

// Function WB_LandmarkPlayer.WB_LandmarkPlayer_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_LandmarkPlayer_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_LandmarkPlayer_C_Tick;

// Function WB_LandmarkPlayer.WB_LandmarkPlayer_C.SetInnerScale
// 0x0004 (0x0004 - 0x0000)
struct WB_LandmarkPlayer_C_SetInnerScale final
{
public:
	float                                         InnerScale_0;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_LandmarkPlayer_C_SetInnerScale;

// Function WB_LandmarkPlayer.WB_LandmarkPlayer_C.GetContentWidget
// 0x0008 (0x0008 - 0x0000)
struct WB_LandmarkPlayer_C_GetContentWidget final
{
public:
	class UWidget*                                ContentWidget;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_LandmarkPlayer_C_GetContentWidget;

// Function WB_LandmarkPlayer.WB_LandmarkPlayer_C.GetResizerWidget
// 0x0008 (0x0008 - 0x0000)
struct WB_LandmarkPlayer_C_GetResizerWidget final
{
public:
	class USizeBox*                               SizeBox;                                           // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_LandmarkPlayer_C_GetResizerWidget;

// Function WB_LandmarkPlayer.WB_LandmarkPlayer_C.GetRetainerBoxWidget
// 0x0008 (0x0008 - 0x0000)
struct WB_LandmarkPlayer_C_GetRetainerBoxWidget final
{
public:
	class URetainerBox*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_LandmarkPlayer_C_GetRetainerBoxWidget;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
