#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Lottery_10CardWindow_CloseButton

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WB_Lottery_10CardWindow_CloseButton.WB_Lottery_10CardWindow_CloseButton_C.ExecuteUbergraph_WB_Lottery_10CardWindow_CloseButton
// 0x0030 (0x0030 - 0x0000)
struct WB_Lottery_10CardWindow_CloseButton_C_ExecuteUbergraph_WB_Lottery_10CardWindow_CloseButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent;     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAJBButtonWidget* OwnerWidget, class UAJBButton* TargetButton)> K2Node_CreateDelegate_OutputDelegate; // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	class UAJBButtonWidget*                       K2Node_CustomEvent_OwnerWidget;                    // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             K2Node_CustomEvent_TargetButton;                   // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_Lottery_10CardWindow_CloseButton_C_ExecuteUbergraph_WB_Lottery_10CardWindow_CloseButton;

// Function WB_Lottery_10CardWindow_CloseButton.WB_Lottery_10CardWindow_CloseButton_C.OnDecidedButtonEvent
// 0x0010 (0x0010 - 0x0000)
struct WB_Lottery_10CardWindow_CloseButton_C_OnDecidedButtonEvent final
{
public:
	class UAJBButtonWidget*                       OwnerWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             TargetButton;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_Lottery_10CardWindow_CloseButton_C_OnDecidedButtonEvent;

// Function WB_Lottery_10CardWindow_CloseButton.WB_Lottery_10CardWindow_CloseButton_C.GetTextBlock
// 0x0008 (0x0008 - 0x0000)
struct WB_Lottery_10CardWindow_CloseButton_C_GetTextBlock final
{
public:
	class UAJBTextBlock*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_Lottery_10CardWindow_CloseButton_C_GetTextBlock;

// Function WB_Lottery_10CardWindow_CloseButton.WB_Lottery_10CardWindow_CloseButton_C.GetButton
// 0x0008 (0x0008 - 0x0000)
struct WB_Lottery_10CardWindow_CloseButton_C_GetButton final
{
public:
	class UAJBButton*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_Lottery_10CardWindow_CloseButton_C_GetButton;

// Function WB_Lottery_10CardWindow_CloseButton.WB_Lottery_10CardWindow_CloseButton_C.EnableInput
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_10CardWindow_CloseButton_C_EnableInput final
{
public:
	bool                                          IsEnable;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_10CardWindow_CloseButton_C_EnableInput;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
