#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_LandmarkPlayer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WB_LandmarkBase_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WB_LandmarkPlayer.WB_LandmarkPlayer_C
// 0x0030 (0x02A0 - 0x0270)
class UWB_LandmarkPlayer_C final : public UWB_LandmarkBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WB_LandmarkPlayer_C;                // 0x0270(0x0008)(Transient, DuplicateTransient)
	class UAJBImage*                              AJBImage_Arrow;                                    // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           RetainerBox_SubPixeler;                            // 0x0280(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_Scaler;                                   // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Resizer;                                   // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         PrevScale;                                         // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_LandmarkPlayer(int32 EntryPoint);
	void SetupBlink(bool bEnableBlink);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void SetInnerScale(float InnerScale_0);

	void GetContentWidget(class UWidget** ContentWidget) const;
	void GetResizerWidget(class USizeBox** SizeBox) const;
	class URetainerBox* GetRetainerBoxWidget() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_LandmarkPlayer_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_LandmarkPlayer_C")
	}
	static class UWB_LandmarkPlayer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_LandmarkPlayer_C>();
	}
};
DUMPER7_ASSERTS_UWB_LandmarkPlayer_C;

SDK_NAMESPACE_END
