#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Lottery_SelectCardWindow_Button

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WB_Lottery_SelectCardWindow_Button.WB_Lottery_SelectCardWindow_Button_C.ExecuteUbergraph_WB_Lottery_SelectCardWindow_Button
// 0x0228 (0x0228 - 0x0000)
struct WB_Lottery_SelectCardWindow_Button_C_ExecuteUbergraph_WB_Lottery_SelectCardWindow_Button final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent;     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent1;    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterialInstance_ReturnValue;   // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetEffectMaterial_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0028(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0038(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue1;             // 0x0050(0x0018)()
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue2;             // 0x0070(0x0018)()
	class FText                                   CallFunc_MakeLiteralText_ReturnValue3;             // 0x0088(0x0018)()
	bool                                          K2Node_CustomEvent_IsPremiam1;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsPremiam;                      // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A2[0x2];                                       // 0x00A2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00A4(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue;                    // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FInterpTo_ReturnValue1;                   // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x00F0(0x0050)(HasGetValueTypeHash)
	struct FFontOutlineSettings                   K2Node_MakeStruct_FontOutlineSettings;             // 0x0140(0x0020)(NoDestructor, HasGetValueTypeHash)
	struct FFontOutlineSettings                   K2Node_MakeStruct_FontOutlineSettings1;            // 0x0160(0x0020)(NoDestructor, HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo1;                  // 0x0180(0x0050)(HasGetValueTypeHash)
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo2;                  // 0x01D0(0x0050)(HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent2;    // 0x0220(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_Lottery_SelectCardWindow_Button_C_ExecuteUbergraph_WB_Lottery_SelectCardWindow_Button;

// Function WB_Lottery_SelectCardWindow_Button.WB_Lottery_SelectCardWindow_Button_C.SetUpTenPullDrawButton
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectCardWindow_Button_C_SetUpTenPullDrawButton final
{
public:
	bool                                          IsPremiam;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectCardWindow_Button_C_SetUpTenPullDrawButton;

// Function WB_Lottery_SelectCardWindow_Button.WB_Lottery_SelectCardWindow_Button_C.SetUpOneTimeDrawButton
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectCardWindow_Button_C_SetUpOneTimeDrawButton final
{
public:
	bool                                          IsPremiam;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectCardWindow_Button_C_SetUpOneTimeDrawButton;

// Function WB_Lottery_SelectCardWindow_Button.WB_Lottery_SelectCardWindow_Button_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectCardWindow_Button_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectCardWindow_Button_C_PreConstruct;

// Function WB_Lottery_SelectCardWindow_Button.WB_Lottery_SelectCardWindow_Button_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_Lottery_SelectCardWindow_Button_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_Lottery_SelectCardWindow_Button_C_Tick;

// Function WB_Lottery_SelectCardWindow_Button.WB_Lottery_SelectCardWindow_Button_C.GetTextBlock
// 0x0008 (0x0008 - 0x0000)
struct WB_Lottery_SelectCardWindow_Button_C_GetTextBlock final
{
public:
	class UAJBTextBlock*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_Lottery_SelectCardWindow_Button_C_GetTextBlock;

// Function WB_Lottery_SelectCardWindow_Button.WB_Lottery_SelectCardWindow_Button_C.GetButton
// 0x0008 (0x0008 - 0x0000)
struct WB_Lottery_SelectCardWindow_Button_C_GetButton final
{
public:
	class UAJBButton*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_Lottery_SelectCardWindow_Button_C_GetButton;

// Function WB_Lottery_SelectCardWindow_Button.WB_Lottery_SelectCardWindow_Button_C.UpdateEnableButton
// 0x0010 (0x0010 - 0x0000)
struct WB_Lottery_SelectCardWindow_Button_C_UpdateEnableButton final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetEffectMaterial_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_Lottery_SelectCardWindow_Button_C_UpdateEnableButton;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
