#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Lottery_Card

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WB_Lottery_Card.WB_Lottery_Card_C.ExecuteUbergraph_WB_Lottery_Card
// 0x0010 (0x0010 - 0x0000)
struct WB_Lottery_Card_C_ExecuteUbergraph_WB_Lottery_Card final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bInIsEnabled;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bPremium;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_BoolToInt_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_Card_C_ExecuteUbergraph_WB_Lottery_Card;

// Function WB_Lottery_Card.WB_Lottery_Card_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_Card_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_Card_C_PreConstruct;

// Function WB_Lottery_Card.WB_Lottery_Card_C.SetupPremiumCard
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_Card_C_SetupPremiumCard final
{
public:
	bool                                          bPremium;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_Card_C_SetupPremiumCard;

// Function WB_Lottery_Card.WB_Lottery_Card_C.EnableInput
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_Card_C_EnableInput final
{
public:
	bool                                          bInIsEnabled;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_Card_C_EnableInput;

// Function WB_Lottery_Card.WB_Lottery_Card_C.GetButton
// 0x0008 (0x0008 - 0x0000)
struct WB_Lottery_Card_C_GetButton final
{
public:
	class UAJBButton*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_Lottery_Card_C_GetButton;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
