#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Lottery_SelectCardWindow

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WB_Lottery_SelectCardWindow.WB_Lottery_SelectCardWindow_C.ExecuteUbergraph_WB_Lottery_SelectCardWindow
// 0x01B0 (0x01B0 - 0x0000)
struct WB_Lottery_SelectCardWindow_C_ExecuteUbergraph_WB_Lottery_SelectCardWindow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWB_Lottery_Card_C*>             K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_Lottery_Card_C*                     K2Node_CustomEvent_ClickCardWidget;                // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBOutGameHUD_BP_bSuccess;             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBOutGameHUD_C*                    CallFunc_GetAJBOutGameHUD_BP_Out_Game_HUD;         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0060(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A1[0x3];                                       // 0x00A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FMax_ReturnValue;                         // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBOutGameHUD_BP_bSuccess1;            // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBOutGameHUD_C*                    CallFunc_GetAJBOutGameHUD_BP_Out_Game_HUD1;        // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomInteger_ReturnValue;                // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_Lottery_Card_C*                     CallFunc_Array_Get_Item;                           // 0x00C8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBOutGameHUD_BP_bSuccess2;            // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBOutGameHUD_C*                    CallFunc_GetAJBOutGameHUD_BP_Out_Game_HUD2;        // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable2;                    // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_Lottery_Card_C*                     CallFunc_Array_Get_Item1;                          // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_Lottery_Card_C*                     CallFunc_Array_Get_Item2;                          // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_Lottery_Card_C*                     CallFunc_Array_Get_Item3;                          // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue3;                // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bPremiumMode;                   // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_10A[0x2];                                      // 0x010A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_TicketNum;                      // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_CurrentRewardNum;               // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_MaxRewardNum;                   // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable2;                   // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue2;                 // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11D[0x3];                                      // 0x011D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue2;                  // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0128(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue1;              // 0x0140(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue2;              // 0x0158(0x0018)()
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0170(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UWB_Lottery_Card_C* ClickCardWidget)> K2Node_CreateDelegate_OutputDelegate1; // 0x0188(0x0010)(ZeroConstructor, NoDestructor)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent;     // 0x0198(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent1;    // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent2;    // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_Lottery_SelectCardWindow_C_ExecuteUbergraph_WB_Lottery_SelectCardWindow;

// Function WB_Lottery_SelectCardWindow.WB_Lottery_SelectCardWindow_C.SetupParam
// 0x0010 (0x0010 - 0x0000)
struct WB_Lottery_SelectCardWindow_C_SetupParam final
{
public:
	bool                                          bPremiumMode_0;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         TicketNum_0;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CurrentRewardNum_0;                                // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxRewardNum_0;                                    // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_Lottery_SelectCardWindow_C_SetupParam;

// Function WB_Lottery_SelectCardWindow.WB_Lottery_SelectCardWindow_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_Lottery_SelectCardWindow_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_Lottery_SelectCardWindow_C_Tick;

// Function WB_Lottery_SelectCardWindow.WB_Lottery_SelectCardWindow_C.OnClickedCard
// 0x0008 (0x0008 - 0x0000)
struct WB_Lottery_SelectCardWindow_C_OnClickedCard final
{
public:
	class UWB_Lottery_Card_C*                     ClickCardWidget;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_Lottery_SelectCardWindow_C_OnClickedCard;

// Function WB_Lottery_SelectCardWindow.WB_Lottery_SelectCardWindow_C.OnInputTurnRate
// 0x0008 (0x0008 - 0x0000)
struct WB_Lottery_SelectCardWindow_C_OnInputTurnRate final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectCardWindow_C_OnInputTurnRate;

// Function WB_Lottery_SelectCardWindow.WB_Lottery_SelectCardWindow_C.OnInputReleasedUp
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectCardWindow_C_OnInputReleasedUp final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectCardWindow_C_OnInputReleasedUp;

// Function WB_Lottery_SelectCardWindow.WB_Lottery_SelectCardWindow_C.OnInputReleasedTouch
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectCardWindow_C_OnInputReleasedTouch final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectCardWindow_C_OnInputReleasedTouch;

// Function WB_Lottery_SelectCardWindow.WB_Lottery_SelectCardWindow_C.OnInputReleasedRight
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectCardWindow_C_OnInputReleasedRight final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectCardWindow_C_OnInputReleasedRight;

// Function WB_Lottery_SelectCardWindow.WB_Lottery_SelectCardWindow_C.OnInputReleasedR2
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectCardWindow_C_OnInputReleasedR2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectCardWindow_C_OnInputReleasedR2;

// Function WB_Lottery_SelectCardWindow.WB_Lottery_SelectCardWindow_C.OnInputReleasedR1
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectCardWindow_C_OnInputReleasedR1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectCardWindow_C_OnInputReleasedR1;

// Function WB_Lottery_SelectCardWindow.WB_Lottery_SelectCardWindow_C.OnInputReleasedLeft
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectCardWindow_C_OnInputReleasedLeft final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectCardWindow_C_OnInputReleasedLeft;

// Function WB_Lottery_SelectCardWindow.WB_Lottery_SelectCardWindow_C.OnInputReleasedL3
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectCardWindow_C_OnInputReleasedL3 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectCardWindow_C_OnInputReleasedL3;

// Function WB_Lottery_SelectCardWindow.WB_Lottery_SelectCardWindow_C.OnInputReleasedL2
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectCardWindow_C_OnInputReleasedL2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectCardWindow_C_OnInputReleasedL2;

// Function WB_Lottery_SelectCardWindow.WB_Lottery_SelectCardWindow_C.OnInputReleasedL1
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectCardWindow_C_OnInputReleasedL1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectCardWindow_C_OnInputReleasedL1;

// Function WB_Lottery_SelectCardWindow.WB_Lottery_SelectCardWindow_C.OnInputReleasedDown
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectCardWindow_C_OnInputReleasedDown final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectCardWindow_C_OnInputReleasedDown;

// Function WB_Lottery_SelectCardWindow.WB_Lottery_SelectCardWindow_C.OnInputReleasedDecide
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectCardWindow_C_OnInputReleasedDecide final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectCardWindow_C_OnInputReleasedDecide;

// Function WB_Lottery_SelectCardWindow.WB_Lottery_SelectCardWindow_C.OnInputReleasedCancel
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectCardWindow_C_OnInputReleasedCancel final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectCardWindow_C_OnInputReleasedCancel;

// Function WB_Lottery_SelectCardWindow.WB_Lottery_SelectCardWindow_C.OnInputPressedUp
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectCardWindow_C_OnInputPressedUp final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectCardWindow_C_OnInputPressedUp;

// Function WB_Lottery_SelectCardWindow.WB_Lottery_SelectCardWindow_C.OnInputPressedTouch
// 0x000C (0x000C - 0x0000)
struct WB_Lottery_SelectCardWindow_C_OnInputPressedTouch final
{
public:
	float                                         LocationX;                                         // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LocationY;                                         // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectCardWindow_C_OnInputPressedTouch;

// Function WB_Lottery_SelectCardWindow.WB_Lottery_SelectCardWindow_C.OnInputPressedRight
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectCardWindow_C_OnInputPressedRight final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectCardWindow_C_OnInputPressedRight;

// Function WB_Lottery_SelectCardWindow.WB_Lottery_SelectCardWindow_C.OnInputPressedR2
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectCardWindow_C_OnInputPressedR2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectCardWindow_C_OnInputPressedR2;

// Function WB_Lottery_SelectCardWindow.WB_Lottery_SelectCardWindow_C.OnInputPressedR1
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectCardWindow_C_OnInputPressedR1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectCardWindow_C_OnInputPressedR1;

// Function WB_Lottery_SelectCardWindow.WB_Lottery_SelectCardWindow_C.OnInputPressedLeft
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectCardWindow_C_OnInputPressedLeft final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectCardWindow_C_OnInputPressedLeft;

// Function WB_Lottery_SelectCardWindow.WB_Lottery_SelectCardWindow_C.OnInputPressedL3
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectCardWindow_C_OnInputPressedL3 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectCardWindow_C_OnInputPressedL3;

// Function WB_Lottery_SelectCardWindow.WB_Lottery_SelectCardWindow_C.OnInputPressedL2
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectCardWindow_C_OnInputPressedL2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectCardWindow_C_OnInputPressedL2;

// Function WB_Lottery_SelectCardWindow.WB_Lottery_SelectCardWindow_C.OnInputPressedL1
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectCardWindow_C_OnInputPressedL1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectCardWindow_C_OnInputPressedL1;

// Function WB_Lottery_SelectCardWindow.WB_Lottery_SelectCardWindow_C.OnInputPressedDown
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectCardWindow_C_OnInputPressedDown final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectCardWindow_C_OnInputPressedDown;

// Function WB_Lottery_SelectCardWindow.WB_Lottery_SelectCardWindow_C.OnInputPressedDecide
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectCardWindow_C_OnInputPressedDecide final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectCardWindow_C_OnInputPressedDecide;

// Function WB_Lottery_SelectCardWindow.WB_Lottery_SelectCardWindow_C.OnInputPressedCancel
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectCardWindow_C_OnInputPressedCancel final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectCardWindow_C_OnInputPressedCancel;

// Function WB_Lottery_SelectCardWindow.WB_Lottery_SelectCardWindow_C.OnInputMoveRight
// 0x0008 (0x0008 - 0x0000)
struct WB_Lottery_SelectCardWindow_C_OnInputMoveRight final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectCardWindow_C_OnInputMoveRight;

// Function WB_Lottery_SelectCardWindow.WB_Lottery_SelectCardWindow_C.OnInputMoveForward
// 0x0008 (0x0008 - 0x0000)
struct WB_Lottery_SelectCardWindow_C_OnInputMoveForward final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectCardWindow_C_OnInputMoveForward;

// Function WB_Lottery_SelectCardWindow.WB_Lottery_SelectCardWindow_C.OnInputLookupRate
// 0x0008 (0x0008 - 0x0000)
struct WB_Lottery_SelectCardWindow_C_OnInputLookupRate final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectCardWindow_C_OnInputLookupRate;

// Function WB_Lottery_SelectCardWindow.WB_Lottery_SelectCardWindow_C.IsModeless
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectCardWindow_C_IsModeless final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectCardWindow_C_IsModeless;

// Function WB_Lottery_SelectCardWindow.WB_Lottery_SelectCardWindow_C.OnInputPressedY
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectCardWindow_C_OnInputPressedY final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectCardWindow_C_OnInputPressedY;

// Function WB_Lottery_SelectCardWindow.WB_Lottery_SelectCardWindow_C.OnInputPressedX
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectCardWindow_C_OnInputPressedX final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectCardWindow_C_OnInputPressedX;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
