#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Lottery_SelectDrawCountWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ERewardDisplayType_structs.hpp"
#include "EDrawButtonType_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WB_Lottery_SelectDrawCountWindow.WB_Lottery_SelectDrawCountWindow_C.ExecuteUbergraph_WB_Lottery_SelectDrawCountWindow
// 0x0058 (0x0058 - 0x0000)
struct WB_Lottery_SelectDrawCountWindow_C_ExecuteUbergraph_WB_Lottery_SelectDrawCountWindow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAJBButtonWidget*                       K2Node_ComponentBoundEvent_OwnerWidget2;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             K2Node_ComponentBoundEvent_TargetButton2;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent;     // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class UAJBButtonWidget*                       K2Node_ComponentBoundEvent_OwnerWidget1;           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             K2Node_ComponentBoundEvent_TargetButton1;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButtonWidget*                       K2Node_ComponentBoundEvent_OwnerWidget;            // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             K2Node_ComponentBoundEvent_TargetButton;           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent1;    // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_Lottery_SelectDrawCountWindow_C_ExecuteUbergraph_WB_Lottery_SelectDrawCountWindow;

// Function WB_Lottery_SelectDrawCountWindow.WB_Lottery_SelectDrawCountWindow_C.BndEvt__WB_Lottery_SelectCardWindow_Bottun_C_0_K2Node_ComponentBoundEvent_5_OnAJBButtonEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_Lottery_SelectDrawCountWindow_C_BndEvt__WB_Lottery_SelectCardWindow_Bottun_C_0_K2Node_ComponentBoundEvent_5_OnAJBButtonEvent__DelegateSignature final
{
public:
	class UAJBButtonWidget*                       OwnerWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             TargetButton;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_Lottery_SelectDrawCountWindow_C_BndEvt__WB_Lottery_SelectCardWindow_Bottun_C_0_K2Node_ComponentBoundEvent_5_OnAJBButtonEvent__DelegateSignature;

// Function WB_Lottery_SelectDrawCountWindow.WB_Lottery_SelectDrawCountWindow_C.BndEvt__WB_Lottery_SelectCardWindow_Bottun_K2Node_ComponentBoundEvent_4_OnAJBButtonEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_Lottery_SelectDrawCountWindow_C_BndEvt__WB_Lottery_SelectCardWindow_Bottun_K2Node_ComponentBoundEvent_4_OnAJBButtonEvent__DelegateSignature final
{
public:
	class UAJBButtonWidget*                       OwnerWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             TargetButton;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_Lottery_SelectDrawCountWindow_C_BndEvt__WB_Lottery_SelectCardWindow_Bottun_K2Node_ComponentBoundEvent_4_OnAJBButtonEvent__DelegateSignature;

// Function WB_Lottery_SelectDrawCountWindow.WB_Lottery_SelectDrawCountWindow_C.BndEvt__WB_CommonButton_K2Node_ComponentBoundEvent_3_OnAJBButtonEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_Lottery_SelectDrawCountWindow_C_BndEvt__WB_CommonButton_K2Node_ComponentBoundEvent_3_OnAJBButtonEvent__DelegateSignature final
{
public:
	class UAJBButtonWidget*                       OwnerWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             TargetButton;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_Lottery_SelectDrawCountWindow_C_BndEvt__WB_CommonButton_K2Node_ComponentBoundEvent_3_OnAJBButtonEvent__DelegateSignature;

// Function WB_Lottery_SelectDrawCountWindow.WB_Lottery_SelectDrawCountWindow_C.GetAJBHUDBase
// 0x0038 (0x0038 - 0x0000)
struct WB_Lottery_SelectDrawCountWindow_C_GetAJBHUDBase final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBHUDBase*                            HUDBase;                                           // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AAJBHUDBase*                            K2Node_DynamicCast_AsAJBHUDBase;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectDrawCountWindow_C_GetAJBHUDBase;

// Function WB_Lottery_SelectDrawCountWindow.WB_Lottery_SelectDrawCountWindow_C.SetUpTitle
// 0x0004 (0x0004 - 0x0000)
struct WB_Lottery_SelectDrawCountWindow_C_SetUpTitle final
{
public:
	int32                                         LResult;                                           // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_Lottery_SelectDrawCountWindow_C_SetUpTitle;

// Function WB_Lottery_SelectDrawCountWindow.WB_Lottery_SelectDrawCountWindow_C.IsSelectedBuy
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectDrawCountWindow_C_IsSelectedBuy final
{
public:
	bool                                          bSelected;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectDrawCountWindow_C_IsSelectedBuy;

// Function WB_Lottery_SelectDrawCountWindow.WB_Lottery_SelectDrawCountWindow_C.SetUpDrawSelectWindow
// 0x0010 (0x0010 - 0x0000)
struct WB_Lottery_SelectDrawCountWindow_C_SetUpDrawSelectWindow final
{
public:
	ERewardDisplayType                            RewardDisplayType;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         NeedPP_0;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERewardDisplayType                            Temp_byte_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable1;                               // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable2;                               // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable3;                               // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Variable4;                               // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Select_Default;                             // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectDrawCountWindow_C_SetUpDrawSelectWindow;

// Function WB_Lottery_SelectDrawCountWindow.WB_Lottery_SelectDrawCountWindow_C.SetUpPossessionDrawResource
// 0x0118 (0x0118 - 0x0000)
struct WB_Lottery_SelectDrawCountWindow_C_SetUpPossessionDrawResource final
{
public:
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTicketNum_Num;                         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0018(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue1;              // 0x0030(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0048(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData1;             // 0x0088(0x0040)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00C8(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array1;                           // 0x00D8(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E8(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue1;                      // 0x0100(0x0018)()
};
DUMPER7_ASSERTS_WB_Lottery_SelectDrawCountWindow_C_SetUpPossessionDrawResource;

// Function WB_Lottery_SelectDrawCountWindow.WB_Lottery_SelectDrawCountWindow_C.GetTicketNum
// 0x0010 (0x0010 - 0x0000)
struct WB_Lottery_SelectDrawCountWindow_C_GetTicketNum final
{
public:
	int32                                         Num;                                               // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_Lottery_SelectDrawCountWindow_C_GetTicketNum;

// Function WB_Lottery_SelectDrawCountWindow.WB_Lottery_SelectDrawCountWindow_C.EnableButton
// 0x0020 (0x0020 - 0x0000)
struct WB_Lottery_SelectDrawCountWindow_C_EnableButton final
{
public:
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue1;             // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue1;         // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectDrawCountWindow_C_EnableButton;

// Function WB_Lottery_SelectDrawCountWindow.WB_Lottery_SelectDrawCountWindow_C.OnInputReleasedUp
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectDrawCountWindow_C_OnInputReleasedUp final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectDrawCountWindow_C_OnInputReleasedUp;

// Function WB_Lottery_SelectDrawCountWindow.WB_Lottery_SelectDrawCountWindow_C.OnInputReleasedRight
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectDrawCountWindow_C_OnInputReleasedRight final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectDrawCountWindow_C_OnInputReleasedRight;

// Function WB_Lottery_SelectDrawCountWindow.WB_Lottery_SelectDrawCountWindow_C.OnInputReleasedLeft
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectDrawCountWindow_C_OnInputReleasedLeft final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectDrawCountWindow_C_OnInputReleasedLeft;

// Function WB_Lottery_SelectDrawCountWindow.WB_Lottery_SelectDrawCountWindow_C.OnInputReleasedDown
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectDrawCountWindow_C_OnInputReleasedDown final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectDrawCountWindow_C_OnInputReleasedDown;

// Function WB_Lottery_SelectDrawCountWindow.WB_Lottery_SelectDrawCountWindow_C.OnInputReleasedDecide
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectDrawCountWindow_C_OnInputReleasedDecide final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectDrawCountWindow_C_OnInputReleasedDecide;

// Function WB_Lottery_SelectDrawCountWindow.WB_Lottery_SelectDrawCountWindow_C.OnInputReleasedCancel
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectDrawCountWindow_C_OnInputReleasedCancel final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectDrawCountWindow_C_OnInputReleasedCancel;

// Function WB_Lottery_SelectDrawCountWindow.WB_Lottery_SelectDrawCountWindow_C.OnInputPressedUp
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectDrawCountWindow_C_OnInputPressedUp final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectDrawCountWindow_C_OnInputPressedUp;

// Function WB_Lottery_SelectDrawCountWindow.WB_Lottery_SelectDrawCountWindow_C.OnInputPressedRight
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectDrawCountWindow_C_OnInputPressedRight final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectDrawCountWindow_C_OnInputPressedRight;

// Function WB_Lottery_SelectDrawCountWindow.WB_Lottery_SelectDrawCountWindow_C.OnInputPressedLeft
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectDrawCountWindow_C_OnInputPressedLeft final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectDrawCountWindow_C_OnInputPressedLeft;

// Function WB_Lottery_SelectDrawCountWindow.WB_Lottery_SelectDrawCountWindow_C.OnInputPressedDown
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectDrawCountWindow_C_OnInputPressedDown final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectDrawCountWindow_C_OnInputPressedDown;

// Function WB_Lottery_SelectDrawCountWindow.WB_Lottery_SelectDrawCountWindow_C.OnInputPressedDecide
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectDrawCountWindow_C_OnInputPressedDecide final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectDrawCountWindow_C_OnInputPressedDecide;

// Function WB_Lottery_SelectDrawCountWindow.WB_Lottery_SelectDrawCountWindow_C.OnInputPressedCancel
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectDrawCountWindow_C_OnInputPressedCancel final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectDrawCountWindow_C_OnInputPressedCancel;

// Function WB_Lottery_SelectDrawCountWindow.WB_Lottery_SelectDrawCountWindow_C.OnInputTurnRate
// 0x0008 (0x0008 - 0x0000)
struct WB_Lottery_SelectDrawCountWindow_C_OnInputTurnRate final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectDrawCountWindow_C_OnInputTurnRate;

// Function WB_Lottery_SelectDrawCountWindow.WB_Lottery_SelectDrawCountWindow_C.OnInputMoveRight
// 0x0008 (0x0008 - 0x0000)
struct WB_Lottery_SelectDrawCountWindow_C_OnInputMoveRight final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectDrawCountWindow_C_OnInputMoveRight;

// Function WB_Lottery_SelectDrawCountWindow.WB_Lottery_SelectDrawCountWindow_C.OnInputMoveForward
// 0x0008 (0x0008 - 0x0000)
struct WB_Lottery_SelectDrawCountWindow_C_OnInputMoveForward final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectDrawCountWindow_C_OnInputMoveForward;

// Function WB_Lottery_SelectDrawCountWindow.WB_Lottery_SelectDrawCountWindow_C.OnInputLookupRate
// 0x0008 (0x0008 - 0x0000)
struct WB_Lottery_SelectDrawCountWindow_C_OnInputLookupRate final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectDrawCountWindow_C_OnInputLookupRate;

// Function WB_Lottery_SelectDrawCountWindow.WB_Lottery_SelectDrawCountWindow_C.IsModeless
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectDrawCountWindow_C_IsModeless final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectDrawCountWindow_C_IsModeless;

// Function WB_Lottery_SelectDrawCountWindow.WB_Lottery_SelectDrawCountWindow_C.OnInputReleasedTouch
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectDrawCountWindow_C_OnInputReleasedTouch final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectDrawCountWindow_C_OnInputReleasedTouch;

// Function WB_Lottery_SelectDrawCountWindow.WB_Lottery_SelectDrawCountWindow_C.OnInputPressedTouch
// 0x000C (0x000C - 0x0000)
struct WB_Lottery_SelectDrawCountWindow_C_OnInputPressedTouch final
{
public:
	float                                         LocationX;                                         // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LocationY;                                         // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectDrawCountWindow_C_OnInputPressedTouch;

// Function WB_Lottery_SelectDrawCountWindow.WB_Lottery_SelectDrawCountWindow_C.OnInputReleasedR2
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectDrawCountWindow_C_OnInputReleasedR2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectDrawCountWindow_C_OnInputReleasedR2;

// Function WB_Lottery_SelectDrawCountWindow.WB_Lottery_SelectDrawCountWindow_C.OnInputReleasedR1
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectDrawCountWindow_C_OnInputReleasedR1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectDrawCountWindow_C_OnInputReleasedR1;

// Function WB_Lottery_SelectDrawCountWindow.WB_Lottery_SelectDrawCountWindow_C.OnInputReleasedL2
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectDrawCountWindow_C_OnInputReleasedL2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectDrawCountWindow_C_OnInputReleasedL2;

// Function WB_Lottery_SelectDrawCountWindow.WB_Lottery_SelectDrawCountWindow_C.OnInputReleasedL1
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectDrawCountWindow_C_OnInputReleasedL1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectDrawCountWindow_C_OnInputReleasedL1;

// Function WB_Lottery_SelectDrawCountWindow.WB_Lottery_SelectDrawCountWindow_C.OnInputPressedR2
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectDrawCountWindow_C_OnInputPressedR2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectDrawCountWindow_C_OnInputPressedR2;

// Function WB_Lottery_SelectDrawCountWindow.WB_Lottery_SelectDrawCountWindow_C.OnInputPressedR1
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectDrawCountWindow_C_OnInputPressedR1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectDrawCountWindow_C_OnInputPressedR1;

// Function WB_Lottery_SelectDrawCountWindow.WB_Lottery_SelectDrawCountWindow_C.OnInputPressedL2
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectDrawCountWindow_C_OnInputPressedL2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectDrawCountWindow_C_OnInputPressedL2;

// Function WB_Lottery_SelectDrawCountWindow.WB_Lottery_SelectDrawCountWindow_C.OnInputPressedL1
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectDrawCountWindow_C_OnInputPressedL1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectDrawCountWindow_C_OnInputPressedL1;

// Function WB_Lottery_SelectDrawCountWindow.WB_Lottery_SelectDrawCountWindow_C.OnInputReleasedL3
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectDrawCountWindow_C_OnInputReleasedL3 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectDrawCountWindow_C_OnInputReleasedL3;

// Function WB_Lottery_SelectDrawCountWindow.WB_Lottery_SelectDrawCountWindow_C.OnInputPressedL3
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectDrawCountWindow_C_OnInputPressedL3 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectDrawCountWindow_C_OnInputPressedL3;

// Function WB_Lottery_SelectDrawCountWindow.WB_Lottery_SelectDrawCountWindow_C.OnInputPressedY
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectDrawCountWindow_C_OnInputPressedY final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectDrawCountWindow_C_OnInputPressedY;

// Function WB_Lottery_SelectDrawCountWindow.WB_Lottery_SelectDrawCountWindow_C.OnInputPressedX
// 0x0001 (0x0001 - 0x0000)
struct WB_Lottery_SelectDrawCountWindow_C_OnInputPressedX final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_Lottery_SelectDrawCountWindow_C_OnInputPressedX;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
