#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ModeSelect_Button_Tutorial

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "AJB_structs.hpp"
#include "SlateCore_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WB_ModeSelect_Button_Tutorial.WB_ModeSelect_Button_Tutorial_C.ExecuteUbergraph_WB_ModeSelect_Button_Tutorial
// 0x0038 (0x0038 - 0x0000)
struct WB_ModeSelect_Button_Tutorial_C_ExecuteUbergraph_WB_ModeSelect_Button_Tutorial final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_NeedPP;                               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0018)()
	bool                                          CallFunc_HavePlayedTutorial_HavePlayedTutorial;    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPressableVisibility_ReturnValue;        // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue1;          // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue1;                   // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_Button_Tutorial_C_ExecuteUbergraph_WB_ModeSelect_Button_Tutorial;

// Function WB_ModeSelect_Button_Tutorial.WB_ModeSelect_Button_Tutorial_C.GetButton
// 0x0008 (0x0008 - 0x0000)
struct WB_ModeSelect_Button_Tutorial_C_GetButton final
{
public:
	class UAJBButton*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_ModeSelect_Button_Tutorial_C_GetButton;

// Function WB_ModeSelect_Button_Tutorial.WB_ModeSelect_Button_Tutorial_C.SetNeedPP
// 0x0004 (0x0004 - 0x0000)
struct WB_ModeSelect_Button_Tutorial_C_SetNeedPP final
{
public:
	int32                                         NeedPP_0;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_ModeSelect_Button_Tutorial_C_SetNeedPP;

// Function WB_ModeSelect_Button_Tutorial.WB_ModeSelect_Button_Tutorial_C.IsButtonDecisioning
// 0x0002 (0x0002 - 0x0000)
struct WB_ModeSelect_Button_Tutorial_C_IsButtonDecisioning final
{
public:
	bool                                          IsDecisioning;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_Button_Tutorial_C_IsButtonDecisioning;

// Function WB_ModeSelect_Button_Tutorial.WB_ModeSelect_Button_Tutorial_C.IsEnableSelect
// 0x0014 (0x0014 - 0x0000)
struct WB_ModeSelect_Button_Tutorial_C_IsEnableSelect final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FShopEventSettings                     CallFunc_GetShopEventSettings_ReturnValue;         // 0x0004(0x0008)(ConstParm, NoDestructor)
	bool                                          CallFunc_CanAJBArcadeGamePlay_ReturnValue;         // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEnableSelect_bEnable;                   // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue1;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_Button_Tutorial_C_IsEnableSelect;

// Function WB_ModeSelect_Button_Tutorial.WB_ModeSelect_Button_Tutorial_C.HavePlayedTutorial
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_Button_Tutorial_C_HavePlayedTutorial final
{
public:
	bool                                          HavePlayedTutorial_0;                              // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_Button_Tutorial_C_HavePlayedTutorial;

// Function WB_ModeSelect_Button_Tutorial.WB_ModeSelect_Button_Tutorial_C.GetAuraImage
// 0x0008 (0x0008 - 0x0000)
struct WB_ModeSelect_Button_Tutorial_C_GetAuraImage final
{
public:
	class UImage*                                 AuraImage;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_ModeSelect_Button_Tutorial_C_GetAuraImage;

// Function WB_ModeSelect_Button_Tutorial.WB_ModeSelect_Button_Tutorial_C.GetRetainerEffectMaterial
// 0x0010 (0x0010 - 0x0000)
struct WB_ModeSelect_Button_Tutorial_C_GetRetainerEffectMaterial final
{
public:
	class UMaterialInstanceDynamic*               EffectMaterial;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetEffectMaterial_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_ModeSelect_Button_Tutorial_C_GetRetainerEffectMaterial;

// Function WB_ModeSelect_Button_Tutorial.WB_ModeSelect_Button_Tutorial_C.GetButtonCenterPosition
// 0x008C (0x008C - 0x0000)
struct WB_ModeSelect_Button_Tutorial_C_GetButtonCenterPosition final
{
public:
	struct FVector2D                              ScreenPosition;                                    // 0x0000(0x0008)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetViewportSize_ReturnValue;              // 0x0008(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue;            // 0x0010(0x0038)(ConstParm, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetViewportScale_ReturnValue;             // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetLocalSize_ReturnValue;                 // 0x004C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue;         // 0x0054(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DFloat_ReturnValue1;        // 0x005C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_LocalToViewport_PixelPosition;            // 0x0064(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_LocalToViewport_ViewportPosition;         // 0x006C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DVector2D_ReturnValue;      // 0x0074(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x007C(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x0084(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_ModeSelect_Button_Tutorial_C_GetButtonCenterPosition;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
