#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ModeSelect_EmissionRateWindow

#include "Basic.hpp"

#include "AJB_structs.hpp"
#include "SlateCore_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WB_ModeSelect_EmissionRateWindow.WB_ModeSelect_EmissionRateWindow_C.ExecuteUbergraph_WB_ModeSelect_EmissionRateWindow
// 0x01F0 (0x01F0 - 0x0000)
struct WB_ModeSelect_EmissionRateWindow_C_ExecuteUbergraph_WB_ModeSelect_EmissionRateWindow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UAJBButtonWidget*                       K2Node_ComponentBoundEvent_OwnerWidget2;           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             K2Node_ComponentBoundEvent_TargetButton2;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAJBGachaDetail                        K2Node_CustomEvent_LuckyDetail;                    // 0x0028(0x0040)()
	struct FAJBGachaDetail                        K2Node_CustomEvent_PremiumDetail;                  // 0x0068(0x0040)()
	struct FAJBGachaDetail                        K2Node_CustomEvent_MaxRarityDetail;                // 0x00A8(0x0040)()
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent;     // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent1;    // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetGachaDetails_OutNeedUpdate;            // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAJBGachaDetail                        CallFunc_GetGachaDetails_OutLuckyDrawDetail;       // 0x0110(0x0040)()
	struct FAJBGachaDetail                        CallFunc_GetGachaDetails_OutPremiumDrawDetail;     // 0x0150(0x0040)()
	struct FAJBGachaDetail                        CallFunc_GetGachaDetails_OutMaxRarityDrawDetail;   // 0x0190(0x0040)()
	class UAJBButtonWidget*                       K2Node_ComponentBoundEvent_OwnerWidget1;           // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             K2Node_ComponentBoundEvent_TargetButton1;          // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButtonWidget*                       K2Node_ComponentBoundEvent_OwnerWidget;            // 0x01E0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             K2Node_ComponentBoundEvent_TargetButton;           // 0x01E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_ModeSelect_EmissionRateWindow_C_ExecuteUbergraph_WB_ModeSelect_EmissionRateWindow;

// Function WB_ModeSelect_EmissionRateWindow.WB_ModeSelect_EmissionRateWindow_C.BndEvt__WB_CommonButton_Switchable_2_K2Node_ComponentBoundEvent_3_OnAJBButtonEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_ModeSelect_EmissionRateWindow_C_BndEvt__WB_CommonButton_Switchable_2_K2Node_ComponentBoundEvent_3_OnAJBButtonEvent__DelegateSignature final
{
public:
	class UAJBButtonWidget*                       OwnerWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             TargetButton;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_ModeSelect_EmissionRateWindow_C_BndEvt__WB_CommonButton_Switchable_2_K2Node_ComponentBoundEvent_3_OnAJBButtonEvent__DelegateSignature;

// Function WB_ModeSelect_EmissionRateWindow.WB_ModeSelect_EmissionRateWindow_C.BndEvt__WB_CommonButton_Switchable_1_K2Node_ComponentBoundEvent_2_OnAJBButtonEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_ModeSelect_EmissionRateWindow_C_BndEvt__WB_CommonButton_Switchable_1_K2Node_ComponentBoundEvent_2_OnAJBButtonEvent__DelegateSignature final
{
public:
	class UAJBButtonWidget*                       OwnerWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             TargetButton;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_ModeSelect_EmissionRateWindow_C_BndEvt__WB_CommonButton_Switchable_1_K2Node_ComponentBoundEvent_2_OnAJBButtonEvent__DelegateSignature;

// Function WB_ModeSelect_EmissionRateWindow.WB_ModeSelect_EmissionRateWindow_C.SetupGachaDetail
// 0x00C0 (0x00C0 - 0x0000)
struct WB_ModeSelect_EmissionRateWindow_C_SetupGachaDetail final
{
public:
	struct FAJBGachaDetail                        LuckyDetail_0;                                     // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FAJBGachaDetail                        PremiumDetail_0;                                   // 0x0040(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FAJBGachaDetail                        MaxRarityDetail_0;                                 // 0x0080(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WB_ModeSelect_EmissionRateWindow_C_SetupGachaDetail;

// Function WB_ModeSelect_EmissionRateWindow.WB_ModeSelect_EmissionRateWindow_C.BndEvt__WB_CommonButton_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_ModeSelect_EmissionRateWindow_C_BndEvt__WB_CommonButton_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature final
{
public:
	class UAJBButtonWidget*                       OwnerWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             TargetButton;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_ModeSelect_EmissionRateWindow_C_BndEvt__WB_CommonButton_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature;

// Function WB_ModeSelect_EmissionRateWindow.WB_ModeSelect_EmissionRateWindow_C.SetupLuckyDrawDisplay
// 0x0178 (0x0178 - 0x0000)
struct WB_ModeSelect_EmissionRateWindow_C_SetupLuckyDrawDisplay final
{
public:
	struct FAJBGachaDetail                        GachaDetail;                                       // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class UWB_EmissionRate_RarityList_C*>  LRaritiles;                                        // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_EmissionRate_LimitedRarityList_C*   CallFunc_Create_ReturnValue;                       // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0070(0x0010)(IsPlainOldData, NoDestructor)
	class UWB_EmissionRate_RarityList_C*          CallFunc_Array_Get_Item;                           // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAJBPickupGachaDetail                  CallFunc_Array_Get_Item1;                          // 0x00A0(0x0038)()
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TryGetCharacterName_Result;               // 0x00E0(0x0018)()
	class FText                                   CallFunc_GetAJBRewardItemTypeString_Out;           // 0x00F8(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0110(0x0018)()
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue1;           // 0x0130(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x014C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue2;           // 0x0150(0x0018)()
	TArray<class UWB_EmissionRate_RarityList_C*>  K2Node_MakeArray_Array;                            // 0x0168(0x0010)(ZeroConstructor, ReferenceParm)
};
DUMPER7_ASSERTS_WB_ModeSelect_EmissionRateWindow_C_SetupLuckyDrawDisplay;

// Function WB_ModeSelect_EmissionRateWindow.WB_ModeSelect_EmissionRateWindow_C.SetupPremiumDrawDisplay
// 0x0170 (0x0170 - 0x0000)
struct WB_ModeSelect_EmissionRateWindow_C_SetupPremiumDrawDisplay final
{
public:
	struct FAJBGachaDetail                        GachaDetail;                                       // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class UWB_EmissionRate_RarityList_C*>  LRaritiles;                                        // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_EmissionRate_LimitedRarityList_C*   CallFunc_Create_ReturnValue;                       // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_EmissionRate_RarityList_C*          CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0080(0x0010)(IsPlainOldData, NoDestructor)
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWB_EmissionRate_RarityList_C*>  K2Node_MakeArray_Array;                            // 0x0098(0x0010)(ZeroConstructor, ReferenceParm)
	struct FAJBPickupGachaDetail                  CallFunc_Array_Get_Item1;                          // 0x00A8(0x0038)()
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x00E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E5[0x3];                                       // 0x00E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_TryGetCharacterName_Result;               // 0x00E8(0x0018)()
	class FText                                   CallFunc_GetAJBRewardItemTypeString_Out;           // 0x0100(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0118(0x0018)()
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue1;           // 0x0138(0x0018)()
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_155[0x3];                                      // 0x0155(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue2;           // 0x0158(0x0018)()
};
DUMPER7_ASSERTS_WB_ModeSelect_EmissionRateWindow_C_SetupPremiumDrawDisplay;

// Function WB_ModeSelect_EmissionRateWindow.WB_ModeSelect_EmissionRateWindow_C.TryGetCharacterName
// 0x0110 (0x0110 - 0x0000)
struct WB_ModeSelect_EmissionRateWindow_C_TryGetCharacterName final
{
public:
	int32                                         CharacterID;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Result;                                            // 0x0008(0x0018)(Parm, OutParm)
	struct FAJBCharacterInfo                      CallFunc_GetCharacterInfoByCharaIndex_Out;         // 0x0020(0x00E8)()
	bool                                          CallFunc_GetCharacterInfoByCharaIndex_ReturnValue; // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EmissionRateWindow_C_TryGetCharacterName;

// Function WB_ModeSelect_EmissionRateWindow.WB_ModeSelect_EmissionRateWindow_C.SetupMaxRarityDrawDisplay
// 0x0178 (0x0178 - 0x0000)
struct WB_ModeSelect_EmissionRateWindow_C_SetupMaxRarityDrawDisplay final
{
public:
	struct FAJBGachaDetail                        GachaDetail;                                       // 0x0000(0x0040)(BlueprintVisible, BlueprintReadOnly, Parm)
	TArray<class UWB_EmissionRate_RarityList_C*>  Raritiles;                                         // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_EmissionRate_LimitedRarityList_C*   CallFunc_Create_ReturnValue;                       // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable1;                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_EmissionRate_RarityList_C*          CallFunc_Array_Get_Item;                           // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWB_EmissionRate_RarityList_C*>  K2Node_MakeArray_Array;                            // 0x0078(0x0010)(ZeroConstructor, ReferenceParm)
	class UVerticalBoxSlot*                       CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x0088(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMargin                                K2Node_MakeStruct_Margin;                          // 0x0090(0x0010)(IsPlainOldData, NoDestructor)
	struct FAJBPickupGachaDetail                  CallFunc_Array_Get_Item1;                          // 0x00A0(0x0038)()
	int32                                         CallFunc_Array_Length_ReturnValue1;                // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue2;                // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_TryGetCharacterName_Result;               // 0x00E0(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetAJBRewardItemTypeString_Out;           // 0x0100(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0118(0x0018)()
	int32                                         CallFunc_Conv_StringToInt_ReturnValue;             // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_134[0x4];                                      // 0x0134(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue1;           // 0x0138(0x0018)()
	int32                                         Temp_int_Loop_Counter_Variable1;                   // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue2;           // 0x0158(0x0018)()
	bool                                          CallFunc_Less_IntInt_ReturnValue1;                 // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_171[0x3];                                      // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue1;                  // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_ModeSelect_EmissionRateWindow_C_SetupMaxRarityDrawDisplay;

// Function WB_ModeSelect_EmissionRateWindow.WB_ModeSelect_EmissionRateWindow_C.OnInputTurnRate
// 0x0008 (0x0008 - 0x0000)
struct WB_ModeSelect_EmissionRateWindow_C_OnInputTurnRate final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EmissionRateWindow_C_OnInputTurnRate;

// Function WB_ModeSelect_EmissionRateWindow.WB_ModeSelect_EmissionRateWindow_C.OnInputReleasedUp
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EmissionRateWindow_C_OnInputReleasedUp final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EmissionRateWindow_C_OnInputReleasedUp;

// Function WB_ModeSelect_EmissionRateWindow.WB_ModeSelect_EmissionRateWindow_C.OnInputReleasedTouch
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EmissionRateWindow_C_OnInputReleasedTouch final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EmissionRateWindow_C_OnInputReleasedTouch;

// Function WB_ModeSelect_EmissionRateWindow.WB_ModeSelect_EmissionRateWindow_C.OnInputReleasedRight
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EmissionRateWindow_C_OnInputReleasedRight final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EmissionRateWindow_C_OnInputReleasedRight;

// Function WB_ModeSelect_EmissionRateWindow.WB_ModeSelect_EmissionRateWindow_C.OnInputReleasedR2
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EmissionRateWindow_C_OnInputReleasedR2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EmissionRateWindow_C_OnInputReleasedR2;

// Function WB_ModeSelect_EmissionRateWindow.WB_ModeSelect_EmissionRateWindow_C.OnInputReleasedR1
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EmissionRateWindow_C_OnInputReleasedR1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EmissionRateWindow_C_OnInputReleasedR1;

// Function WB_ModeSelect_EmissionRateWindow.WB_ModeSelect_EmissionRateWindow_C.OnInputReleasedLeft
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EmissionRateWindow_C_OnInputReleasedLeft final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EmissionRateWindow_C_OnInputReleasedLeft;

// Function WB_ModeSelect_EmissionRateWindow.WB_ModeSelect_EmissionRateWindow_C.OnInputReleasedL3
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EmissionRateWindow_C_OnInputReleasedL3 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EmissionRateWindow_C_OnInputReleasedL3;

// Function WB_ModeSelect_EmissionRateWindow.WB_ModeSelect_EmissionRateWindow_C.OnInputReleasedL2
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EmissionRateWindow_C_OnInputReleasedL2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EmissionRateWindow_C_OnInputReleasedL2;

// Function WB_ModeSelect_EmissionRateWindow.WB_ModeSelect_EmissionRateWindow_C.OnInputReleasedL1
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EmissionRateWindow_C_OnInputReleasedL1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EmissionRateWindow_C_OnInputReleasedL1;

// Function WB_ModeSelect_EmissionRateWindow.WB_ModeSelect_EmissionRateWindow_C.OnInputReleasedDown
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EmissionRateWindow_C_OnInputReleasedDown final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EmissionRateWindow_C_OnInputReleasedDown;

// Function WB_ModeSelect_EmissionRateWindow.WB_ModeSelect_EmissionRateWindow_C.OnInputReleasedDecide
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EmissionRateWindow_C_OnInputReleasedDecide final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EmissionRateWindow_C_OnInputReleasedDecide;

// Function WB_ModeSelect_EmissionRateWindow.WB_ModeSelect_EmissionRateWindow_C.OnInputReleasedCancel
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EmissionRateWindow_C_OnInputReleasedCancel final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EmissionRateWindow_C_OnInputReleasedCancel;

// Function WB_ModeSelect_EmissionRateWindow.WB_ModeSelect_EmissionRateWindow_C.OnInputPressedUp
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EmissionRateWindow_C_OnInputPressedUp final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EmissionRateWindow_C_OnInputPressedUp;

// Function WB_ModeSelect_EmissionRateWindow.WB_ModeSelect_EmissionRateWindow_C.OnInputPressedTouch
// 0x000C (0x000C - 0x0000)
struct WB_ModeSelect_EmissionRateWindow_C_OnInputPressedTouch final
{
public:
	float                                         LocationX;                                         // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LocationY;                                         // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EmissionRateWindow_C_OnInputPressedTouch;

// Function WB_ModeSelect_EmissionRateWindow.WB_ModeSelect_EmissionRateWindow_C.OnInputPressedRight
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EmissionRateWindow_C_OnInputPressedRight final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EmissionRateWindow_C_OnInputPressedRight;

// Function WB_ModeSelect_EmissionRateWindow.WB_ModeSelect_EmissionRateWindow_C.OnInputPressedR2
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EmissionRateWindow_C_OnInputPressedR2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EmissionRateWindow_C_OnInputPressedR2;

// Function WB_ModeSelect_EmissionRateWindow.WB_ModeSelect_EmissionRateWindow_C.OnInputPressedR1
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EmissionRateWindow_C_OnInputPressedR1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EmissionRateWindow_C_OnInputPressedR1;

// Function WB_ModeSelect_EmissionRateWindow.WB_ModeSelect_EmissionRateWindow_C.OnInputPressedLeft
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EmissionRateWindow_C_OnInputPressedLeft final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EmissionRateWindow_C_OnInputPressedLeft;

// Function WB_ModeSelect_EmissionRateWindow.WB_ModeSelect_EmissionRateWindow_C.OnInputPressedL3
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EmissionRateWindow_C_OnInputPressedL3 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EmissionRateWindow_C_OnInputPressedL3;

// Function WB_ModeSelect_EmissionRateWindow.WB_ModeSelect_EmissionRateWindow_C.OnInputPressedL2
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EmissionRateWindow_C_OnInputPressedL2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EmissionRateWindow_C_OnInputPressedL2;

// Function WB_ModeSelect_EmissionRateWindow.WB_ModeSelect_EmissionRateWindow_C.OnInputPressedL1
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EmissionRateWindow_C_OnInputPressedL1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EmissionRateWindow_C_OnInputPressedL1;

// Function WB_ModeSelect_EmissionRateWindow.WB_ModeSelect_EmissionRateWindow_C.OnInputPressedDown
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EmissionRateWindow_C_OnInputPressedDown final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EmissionRateWindow_C_OnInputPressedDown;

// Function WB_ModeSelect_EmissionRateWindow.WB_ModeSelect_EmissionRateWindow_C.OnInputPressedDecide
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EmissionRateWindow_C_OnInputPressedDecide final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EmissionRateWindow_C_OnInputPressedDecide;

// Function WB_ModeSelect_EmissionRateWindow.WB_ModeSelect_EmissionRateWindow_C.OnInputPressedCancel
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EmissionRateWindow_C_OnInputPressedCancel final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EmissionRateWindow_C_OnInputPressedCancel;

// Function WB_ModeSelect_EmissionRateWindow.WB_ModeSelect_EmissionRateWindow_C.OnInputMoveRight
// 0x0008 (0x0008 - 0x0000)
struct WB_ModeSelect_EmissionRateWindow_C_OnInputMoveRight final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EmissionRateWindow_C_OnInputMoveRight;

// Function WB_ModeSelect_EmissionRateWindow.WB_ModeSelect_EmissionRateWindow_C.OnInputMoveForward
// 0x0008 (0x0008 - 0x0000)
struct WB_ModeSelect_EmissionRateWindow_C_OnInputMoveForward final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EmissionRateWindow_C_OnInputMoveForward;

// Function WB_ModeSelect_EmissionRateWindow.WB_ModeSelect_EmissionRateWindow_C.OnInputLookupRate
// 0x0008 (0x0008 - 0x0000)
struct WB_ModeSelect_EmissionRateWindow_C_OnInputLookupRate final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EmissionRateWindow_C_OnInputLookupRate;

// Function WB_ModeSelect_EmissionRateWindow.WB_ModeSelect_EmissionRateWindow_C.IsModeless
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EmissionRateWindow_C_IsModeless final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EmissionRateWindow_C_IsModeless;

// Function WB_ModeSelect_EmissionRateWindow.WB_ModeSelect_EmissionRateWindow_C.OnInputPressedY
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EmissionRateWindow_C_OnInputPressedY final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EmissionRateWindow_C_OnInputPressedY;

// Function WB_ModeSelect_EmissionRateWindow.WB_ModeSelect_EmissionRateWindow_C.OnInputPressedX
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EmissionRateWindow_C_OnInputPressedX final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EmissionRateWindow_C_OnInputPressedX;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
