#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_MenuTitle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WB_MenuTitle.WB_MenuTitle_C
// 0x0060 (0x0268 - 0x0208)
class UWB_MenuTitle_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UAJBImage*                              AJBImage_0;                                        // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                           ModeSelect_TxtRoot;                                // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SubTitle;                                          // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          Title;                                             // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   MenuTitle;                                         // 0x0230(0x0018)(Edit, BlueprintVisible)
	class FText                                   MenuSubTitle;                                      // 0x0248(0x0018)(Edit, BlueprintVisible)
	class UClass*                                 ModeSelect_TxtBaseClass;                           // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_MenuTitle(int32 EntryPoint);
	void Update_SubTitle(const class FText& InText);
	void PreConstruct(bool IsDesignTime);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_MenuTitle_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_MenuTitle_C")
	}
	static class UWB_MenuTitle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_MenuTitle_C>();
	}
};
DUMPER7_ASSERTS_UWB_MenuTitle_C;

SDK_NAMESPACE_END
