#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ModeSelect

#include "Basic.hpp"

#include "AJB_structs.hpp"
#include "AJB_classes.hpp"
#include "Engine_structs.hpp"
#include "EModeSelectInnerState_structs.hpp"
#include "EModeSelectNextFlowEvent_structs.hpp"
#include "EDrawType_structs.hpp"
#include "ERewardDisplayType_structs.hpp"
#include "UMG_structs.hpp"
#include "EDrawButtonType_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WB_ModeSelect.WB_ModeSelect_C
// 0x0248 (0x0508 - 0x02C0)
class UWB_ModeSelect_C final : public UAJBWindowWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Close;                                        // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_GameModeView_C*                     WB_GameModeView;                                   // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_MenuTitle_C*                        WB_MenuTitle;                                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ModeSelect_Button_EndGame_C*        WB_ModeSelect_Button_EndGame;                      // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ModeSelect_Button_PAIR_C*           WB_ModeSelect_Button_PAIR;                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ModeSelect_Button_PremiumDraw_C*    WB_ModeSelect_Button_PremiumDraw;                  // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ModeSelect_Button_PvE_C*            WB_ModeSelect_Button_PvE;                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ModeSelect_Button_Reward_C*         WB_ModeSelect_Button_Reward;                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ModeSelect_Button_RewardPercent_C*  WB_ModeSelect_Button_RewardPercent;                // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ModeSelect_Button_Shop_C*           WB_ModeSelect_Button_Shop;                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ModeSelect_Button_SOLO_C*           WB_ModeSelect_Button_SOLO;                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ModeSelect_Button_Training_C*       WB_ModeSelect_Button_Training;                     // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ModeSelect_Button_Tutorial_C*       WB_ModeSelect_Button_Tutorial;                     // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ModeSelect_VolumeChangeButton_C*    WB_VolumeChangeButton;                             // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	EModeSelectInnerState                         CurrentInnerState;                                 // 0x0338(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EModeSelectNextFlowEvent                      NextFlow;                                          // 0x0339(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAJBCreditDisplayType                         CachedCreditDisplayType;                           // 0x033A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33B[0x5];                                      // 0x033B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBOutGameHUD_C*                    CachedOutGameHUD;                                  // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_Credit_C*                           CachedCredit;                                      // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_PpBuyWindow_C*                      CachedPPBuyWindow;                                 // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_PPBuyButton_C*                      CachedPPBuyButton;                                 // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_CommonWIndow_S_C*                   CachedLastPPBuyConfirmButton;                      // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_CommonWIndow_S_C*                   CachedLastWarningWindow;                           // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ModeSelect_EndTheGame_C*            CachedLastGameEndConfirm;                          // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBWindowWidget*                       CachedLastEndGameRankupWindow;                     // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ModeSelect_EmissionRateWindow_C*    CachedLastRewardPercent;                           // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ModeSelectButtonBase_C*             CachedLastModeSelectButtonBase;                    // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnableUpdateTimeCountDown;                        // 0x0390(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bEnableUpdateTimeCountDownByAnimation;             // 0x0391(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bEnableUpdateViewTimeCountDown;                    // 0x0392(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bEnableExecOuterDispatchers;                       // 0x0393(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         ElapsedTime;                                       // 0x0394(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CountDownMaxTime_ModeSelect;                       // 0x0398(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CountDownMaxTime_TimeupConfirm;                    // 0x039C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CountDownMaxTime_TimeupUnselectButtonWarning;      // 0x03A0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CountDownMaxTime_TimeupEndGameRankupWindow;        // 0x03A4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDebugIgnorePP;                                    // 0x03A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bDebugIgnoreTimeCount;                             // 0x03A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3AA[0x2];                                      // 0x03AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SelectedModeNeedPP;                                // 0x03AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ConnectingWindowWaitTimer;                         // 0x03B0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B4[0x4];                                      // 0x03B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           ConnectingWindowTimerHandle;                       // 0x03B8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class UWB_CommonWIndow_S_C*                   ErrorAlertConfirm;                                 // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LoadedMenuBGLevel;                                 // 0x03C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          RequestedOutGameProxy;                             // 0x03C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bShowOfflineConfim;                                // 0x03CA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3CB[0x5];                                      // 0x03CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CommonWIndow_S_C*                   OfflineConfirm;                                    // 0x03D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_CommonWIndow_S_C*                   CachedCompensationConfirm;                         // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CountDownMaxTime_ShopCompetition;                  // 0x03E0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E4[0x4];                                      // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAJBGachaDetail                        LuckyDetail;                                       // 0x03E8(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FAJBGachaDetail                        PremiumDetail;                                     // 0x0428(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         UpdateCheckGachaDetailsTimer;                      // 0x0468(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46C[0x4];                                      // 0x046C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           TimerHandle_UpdateCheckGachaDetails;               // 0x0470(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	class UWB_CommonWIndow_S_C*                   PremiumConfirm;                                    // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAJBGetRewardsResponse                 CachedRequesetReward;                              // 0x0480(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	EAJBRewardReceivingStatus                     CachedReceiveingStatus;                            // 0x0490(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_491[0x3];                                      // 0x0491(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         FailedGachaIdErrorCount;                           // 0x0494(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ModeSelect_AnnouncementsParentWindow_C* CachedAnnouncementsParent;                     // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ChallengeEventProgressWindow_C*     ChallengeEventWindow;                              // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_GameOver_C*                         GameOverWidget;                                    // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsGuestPlay;                                       // 0x04B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4B1[0x3];                                      // 0x04B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TakeOverElapsedTime;                               // 0x04B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UWB_Lottery_SelectDrawCountWindow_C*    DrawTimeWindow;                                    // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EDrawType                                     DrawType;                                          // 0x04C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          PremiumMode;                                       // 0x04C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C2[0x6];                                      // 0x04C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAJBGachaDetail                        MaxRarityDrawDetail;                               // 0x04C8(0x0040)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WB_ModeSelect(int32 EntryPoint);
	void OnClosedWindowEndGameRankupWindow(class UAJBWindowWidget* TargetWidget);
	void OnClosedGameEndConfirm(class UAJBWindowWidget* TargetWidget);
	void OnDecidedWindowEndGameConfirm(EAJBConfirmResult Result, bool IsRankup, int32 AddedRank, int32 Ticket);
	void ForceOpenEndGameForArcadeTerminate();
	void OnGetExpInfoOnEndGame();
	void OnStartChallengeEvent();
	void OnClosedChallengeEventWindow(class UAJBWindowWidget* TargetWidget);
	void OnFInishedChallengeEvent();
	void OnFinishedLogout();
	void OnClosedWindowTimeoutGameOverConfirmText(class UAJBWindowWidget* TargetWidget);
	void OnClosedWindowTimeoutConfirmText(class UAJBWindowWidget* TargetWidget);
	void OnOpenedOrClosedAnyWindow(class UAJBWindowWidget* TargetWidget);
	void OnOpeningOrClosingAnyWindow(class UAJBWindowWidget* TargetWidget);
	void TenPullDraw(EAJBConfirmResult Result);
	void ClickButton(EDrawButtonType DrawButtonType);
	void BndEvt__WB_ModeSelect_Button_PvE_K2Node_ComponentBoundEvent_18_OnAJBButtonEvent__DelegateSignature(class UAJBButtonWidget* OwnerWidget, class UAJBButton* TargetButton);
	void GotoPvE();
	void BndEvt__WB_ModeSelect_Button_PvE_K2Node_ComponentBoundEvent_17_OnAJBButtonEvent__DelegateSignature(class UAJBButtonWidget* OwnerWidget, class UAJBButton* TargetButton);
	void OnClosedOfflineMessageWindow(class UAJBWindowWidget* TargetWidget);
	void OpenAllAnnouncementWindows();
	void OnAllAnnouncementWindowsClosed(class UAJBWindowWidget* TargetWidget);
	void OnAnnouncementFinished(bool bSucceededInGettingAnnouncement);
	void OnFinishedRewardRequest();
	void RetryGacha();
	void OnFinishRequestGetReward();
	void OnFinishedPremiumConfirm(EAJBConfirmResult Result);
	void BndEvt__WB_ModeSelect_Button_PremiumDraw_K2Node_ComponentBoundEvent_16_OnAJBButtonEvent__DelegateSignature(class UAJBButtonWidget* OwnerWidget, class UAJBButton* TargetButton);
	void BndEvt__WB_ModeSelect_Button_PremiumDraw_K2Node_ComponentBoundEvent_15_OnAJBButtonEvent__DelegateSignature(class UAJBButtonWidget* OwnerWidget, class UAJBButton* TargetButton);
	void OtherCloseWindow();
	void OnClosedCompensationConfirm(class UAJBWindowWidget* TargetWidget);
	void OnClosedAlertConfirm(class UAJBWindowWidget* TargetWidget);
	void OnFinishedAllReward();
	void OnShowConnectingWindow();
	void OnRequestGetReward(bool bPremiumMode);
	void DisablePlayerInput();
	void EnablePlayerInput();
	void BndEvt__WB_ModeSelect_Button_RewardPercent_K2Node_ComponentBoundEvent_14_OnAJBButtonEvent__DelegateSignature(class UAJBButtonWidget* OwnerWidget, class UAJBButton* TargetButton);
	void BndEvt__WB_ModeSelect_Button_Reward_K2Node_ComponentBoundEvent_13_OnAJBButtonEvent__DelegateSignature(class UAJBButtonWidget* OwnerWidget, class UAJBButton* TargetButton);
	void BndEvt__WB_ModeSelect_Button_Training_K2Node_ComponentBoundEvent_12_OnAJBButtonEvent__DelegateSignature(class UAJBButtonWidget* OwnerWidget, class UAJBButton* TargetButton);
	void BndEvt__WB_ModeSelect_Button_Tutorial_K2Node_ComponentBoundEvent_11_OnAJBButtonEvent__DelegateSignature(class UAJBButtonWidget* OwnerWidget, class UAJBButton* TargetButton);
	void BndEvt__WB_ModeSelect_Button_PAIR_K2Node_ComponentBoundEvent_10_OnAJBButtonEvent__DelegateSignature(class UAJBButtonWidget* OwnerWidget, class UAJBButton* TargetButton);
	void BndEvt__WB_ModeSelect_Button_Shop_K2Node_ComponentBoundEvent_9_OnAJBButtonEvent__DelegateSignature(class UAJBButtonWidget* OwnerWidget, class UAJBButton* TargetButton);
	void BndEvt__WB_ModeSelect_Button_SOLO_K2Node_ComponentBoundEvent_8_OnAJBButtonEvent__DelegateSignature(class UAJBButtonWidget* OwnerWidget, class UAJBButton* TargetButton);
	void OnResetedPPBuyTimeCountdown();
	void TakeOverPPBuyTimeCountdown();
	void OnFinishedConfirmBuyPPForLocationTest(EAJBConfirmResult Result);
	void StartTimeCountdown();
	void StopTimeCountdown();
	void SetPressableVisibilityAllButtons(bool bIsPressable);
	void OnGameOver();
	void OnOpeningGameOverWindow(class UAJBWindowWidget* TargetWidget);
	void OnClosedWindowRewardPercent(class UAJBWindowWidget* TargetWidget);
	void OpenRewardPercentWindow();
	void OnFinishedUnselectButtonWarning(class UAJBWindowWidget* TargetWidget);
	void OpenUnselectButtonWarning(const class FText& Text);
	void Destruct();
	void OnOpeningPPBuyWindow(class UAJBWindowWidget* TargetWidget);
	void SetTimeCountDownElapsedTime(float ElapsedTime_0);
	void OnClosingPPBuyWindow(class UAJBWindowWidget* TargetWidget);
	void Construct();
	void OpenBuyPPConfirmPopupWindow();
	void OnFinishedConfirmBuyPP(EAJBConfirmResult Result);
	void GotoTutorial();
	void GotoTraining();
	void GotoSOLO();
	void GotoShop();
	void GotoReward();
	void GotoPAIR();
	void GotoEndGame();
	void BndEvt__WB_ModeSelect_Button_Tutorial_K2Node_ComponentBoundEvent_7_OnAJBButtonEvent__DelegateSignature(class UAJBButtonWidget* OwnerWidget, class UAJBButton* TargetButton);
	void BndEvt__WB_ModeSelect_Button_Training_K2Node_ComponentBoundEvent_6_OnAJBButtonEvent__DelegateSignature(class UAJBButtonWidget* OwnerWidget, class UAJBButton* TargetButton);
	void BndEvt__WB_ModeSelect_Button_SOLO_K2Node_ComponentBoundEvent_5_OnAJBButtonEvent__DelegateSignature(class UAJBButtonWidget* OwnerWidget, class UAJBButton* TargetButton);
	void BndEvt__WB_ModeSelect_Button_Shop_K2Node_ComponentBoundEvent_4_OnAJBButtonEvent__DelegateSignature(class UAJBButtonWidget* OwnerWidget, class UAJBButton* TargetButton);
	void BndEvt__WB_ModeSelect_Button_RewardPercent_K2Node_ComponentBoundEvent_3_OnAJBButtonEvent__DelegateSignature(class UAJBButtonWidget* OwnerWidget, class UAJBButton* TargetButton);
	void BndEvt__WB_ModeSelect_Button_Reward_K2Node_ComponentBoundEvent_2_OnAJBButtonEvent__DelegateSignature(class UAJBButtonWidget* OwnerWidget, class UAJBButton* TargetButton);
	void BndEvt__WB_ModeSelect_Button_PAIR_K2Node_ComponentBoundEvent_1_OnAJBButtonEvent__DelegateSignature(class UAJBButtonWidget* OwnerWidget, class UAJBButton* TargetButton);
	void BndEvt__WB_ModeSelect_Button_EndGame_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature(class UAJBButtonWidget* OwnerWidget, class UAJBButton* TargetButton);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void OnCloseAnimationFinished();
	void OnClosingWindow();
	void OnOpeningWindow();
	void RetryRequestSysNationalMatchInfo();
	void OnUpdateCheckGachaDetails();
	void EndOutGameProxy();
	void OnUpdateTenpoRoom();
	void StartOutGameProxy();
	void OnSuccess_60D8FB9743A355289E2159A333BCBF39(EAJBNetAPIResult Result, EAJBRewardReceivingStatus ReceiveingStatus, const struct FAJBGetRewardsResponse& GetRewards);
	void OnFailed_60D8FB9743A355289E2159A333BCBF39(EAJBNetAPIResult Result, EAJBRewardReceivingStatus ReceiveingStatus, const struct FAJBGetRewardsResponse& GetRewards);
	void OnTokenInvalid_60D8FB9743A355289E2159A333BCBF39(EAJBNetAPIResult Result, EAJBRewardReceivingStatus ReceiveingStatus, const struct FAJBGetRewardsResponse& GetRewards);
	void OnSuccess_DD07A3794037B87F1A3F03AA0B1691A9(EAJBNetAPIResult Result, EAJBRewardReceivingStatus ReceiveingStatus, const struct FAJBGetRewardsResponse& GetRewards);
	void OnFailed_DD07A3794037B87F1A3F03AA0B1691A9(EAJBNetAPIResult Result, EAJBRewardReceivingStatus ReceiveingStatus, const struct FAJBGetRewardsResponse& GetRewards);
	void OnTokenInvalid_DD07A3794037B87F1A3F03AA0B1691A9(EAJBNetAPIResult Result, EAJBRewardReceivingStatus ReceiveingStatus, const struct FAJBGetRewardsResponse& GetRewards);
	void OnSuccess_E7D7764D4A941A326AF7118593321737(EAJBNetAPIResult Result, const struct FAJBGachaID& GachaID);
	void OnFailed_E7D7764D4A941A326AF7118593321737(EAJBNetAPIResult Result, const struct FAJBGachaID& GachaID);
	void OnSuccess_77A3BD40453BEB5E92BFE9BF75A2A7B1(EAJBNetAPIResult Result);
	void OnFailed_77A3BD40453BEB5E92BFE9BF75A2A7B1(EAJBNetAPIResult Result);
	void OnSuccess_F1B8F70E4F525BC161CB33927A8E4699(EAJBNetAPIResult Result, const TArray<struct FAJBAnnouncement>& Announcements);
	void OnFailed_F1B8F70E4F525BC161CB33927A8E4699(EAJBNetAPIResult Result, const TArray<struct FAJBAnnouncement>& Announcements);
	void OnSuccess_611625DF416A554B6AF14FA0464F8823(EAJBNetAPIResult Result, EAJBRewardReceivingStatus ReceiveingStatus, const struct FAJBGetRewardsResponse& GetRewards);
	void OnFailed_611625DF416A554B6AF14FA0464F8823(EAJBNetAPIResult Result, EAJBRewardReceivingStatus ReceiveingStatus, const struct FAJBGetRewardsResponse& GetRewards);
	void OnTokenInvalid_611625DF416A554B6AF14FA0464F8823(EAJBNetAPIResult Result, EAJBRewardReceivingStatus ReceiveingStatus, const struct FAJBGetRewardsResponse& GetRewards);
	void OnSuccess_C7EF459E4F11203F68CA97AA0D9AEFAB(EAJBNetAPIResult Result, const struct FAJBGachaID& GachaID);
	void OnFailed_C7EF459E4F11203F68CA97AA0D9AEFAB(EAJBNetAPIResult Result, const struct FAJBGachaID& GachaID);
	void OnSuccess_F7BBDDB24F925C6B4F665893F1A48BCB(EAJBNetAPIResult Result, EAJBRewardReceivingStatus ReceiveingStatus, const struct FAJBGetRewardsResponse& GetRewards);
	void OnFailed_F7BBDDB24F925C6B4F665893F1A48BCB(EAJBNetAPIResult Result, EAJBRewardReceivingStatus ReceiveingStatus, const struct FAJBGetRewardsResponse& GetRewards);
	void OnTokenInvalid_F7BBDDB24F925C6B4F665893F1A48BCB(EAJBNetAPIResult Result, EAJBRewardReceivingStatus ReceiveingStatus, const struct FAJBGetRewardsResponse& GetRewards);
	void Finished_1A4B4AE74709A848171FBB9851856300();
	void OnSuccess_A54B54EA4A3D73BA46A773B4B5CD6BCD(EAJBNetAPIResult Result);
	void OnFailed_A54B54EA4A3D73BA46A773B4B5CD6BCD(EAJBNetAPIResult Result);
	void OnSuccess_E9209B2B4F05F9A17883AD8EDEBFD7E5(EAJBNetAPIResult Result);
	void OnFailed_E9209B2B4F05F9A17883AD8EDEBFD7E5(EAJBNetAPIResult Result);
	void OnSuccess_6007A7E545F50C1823986C832EBD9F99(EAJBNetAPIResult Result);
	void OnFailed_6007A7E545F50C1823986C832EBD9F99(EAJBNetAPIResult Result);
	void OnSuccess_4FF5EC644FBF269D75F4E3B584758A8C(EAJBNetAPIResult Result);
	void OnFailed_4FF5EC644FBF269D75F4E3B584758A8C(EAJBNetAPIResult Result);
	void OnSuccess_11A745E249C40444A8CF7EB6FFE82A60(EAJBNetAPIResult Result);
	void OnFailed_11A745E249C40444A8CF7EB6FFE82A60(EAJBNetAPIResult Result);
	void OpenGameOverWindow(bool bPlayOpenSE);
	void CanOpenModeSelect(bool* bCan);
	void GetHttp(class UNetHttp** NetHttp);
	void ChangeButtonZoder(class UWB_ModeSelectButtonBase_C* TopZOrderButtonWidget);
	void IsPossibleRetryGachaRequest(bool* bPossible);
	void ShowDrawTimeButton(class APlayerController* Owner, class UWB_Lottery_SelectDrawCountWindow_C** Widget);
	void GetLuckyDrawNeedTickets(int32* Num);
	void TenDrawTestData(struct FAJBGetRewardsResponse* TestData);
	void GetDrawConfirmWindowTitle(class FText* Text);
	void GetPremiumDrawNeedPP(int32* Num);
	bool OnInputTurnRate(float Value);
	bool OnInputReleasedUp();
	bool OnInputReleasedTouch();
	bool OnInputReleasedRight();
	bool OnInputReleasedLeft();
	bool OnInputReleasedDown();
	bool OnInputReleasedDecide();
	bool OnInputReleasedCancel();
	bool OnInputPressedUp();
	bool OnInputPressedTouch(const float LocationX, const float LocationY);
	bool OnInputPressedRight();
	bool OnInputPressedLeft();
	bool OnInputPressedDown();
	bool OnInputPressedDecide();
	bool OnInputPressedCancel();
	bool OnInputMoveRight(float Value);
	bool OnInputMoveForward(float Value);
	bool OnInputLookupRate(float Value);
	bool IsModeless();
	bool OnInputReleasedR2();
	bool OnInputReleasedR1();
	bool OnInputReleasedL2();
	bool OnInputReleasedL1();
	bool OnInputPressedR2();
	bool OnInputPressedR1();
	bool OnInputPressedL2();
	bool OnInputPressedL1();
	bool OnInputReleasedL3();
	bool OnInputPressedL3();
	bool OnInputPressedY();
	bool OnInputPressedX();

	bool IsHaveAnyPP() const;
	bool IsAnyButtonDecisioning() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_ModeSelect_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_ModeSelect_C")
	}
	static class UWB_ModeSelect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ModeSelect_C>();
	}
};
DUMPER7_ASSERTS_UWB_ModeSelect_C;

SDK_NAMESPACE_END
