#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ModeSelect_AnnouncementsParentWindow

#include "Basic.hpp"

#include "AJB_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WB_ModeSelect_AnnouncementsParentWindow.WB_ModeSelect_AnnouncementsParentWindow_C.ExecuteUbergraph_WB_ModeSelect_AnnouncementsParentWindow
// 0x00C0 (0x00C0 - 0x0000)
struct WB_ModeSelect_AnnouncementsParentWindow_C_ExecuteUbergraph_WB_ModeSelect_AnnouncementsParentWindow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAJBWindowWidget*                       K2Node_CustomEvent_TargetWidget;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_ModeSelect_AnnouncementWindow_C*    K2Node_DynamicCast_AsWB_Mode_Select_Announcement_Window; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_AnnouncementIndex;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAJBAnnouncement                       CallFunc_Array_Get_Item;                           // 0x0028(0x0040)()
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue;           // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue1;               // 0x0090(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(class UAJBWindowWidget* TargetWidget)> K2Node_CreateDelegate_OutputDelegate;      // 0x00A0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue1;          // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Array_IsValidIndex_ReturnValue2;          // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_ModeSelect_AnnouncementWindow_C*    CallFunc_Create_ReturnValue;                       // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_ModeSelect_AnnouncementsParentWindow_C_ExecuteUbergraph_WB_ModeSelect_AnnouncementsParentWindow;

// Function WB_ModeSelect_AnnouncementsParentWindow.WB_ModeSelect_AnnouncementsParentWindow_C.OnClosedAnnouncementWindow
// 0x0008 (0x0008 - 0x0000)
struct WB_ModeSelect_AnnouncementsParentWindow_C_OnClosedAnnouncementWindow final
{
public:
	class UAJBWindowWidget*                       TargetWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_ModeSelect_AnnouncementsParentWindow_C_OnClosedAnnouncementWindow;

// Function WB_ModeSelect_AnnouncementsParentWindow.WB_ModeSelect_AnnouncementsParentWindow_C.OpenAnnouncementWindow
// 0x0004 (0x0004 - 0x0000)
struct WB_ModeSelect_AnnouncementsParentWindow_C_OpenAnnouncementWindow final
{
public:
	int32                                         AnnouncementIndex;                                 // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_ModeSelect_AnnouncementsParentWindow_C_OpenAnnouncementWindow;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
