#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ModeSelect_AnnouncementsParentWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_structs.hpp"
#include "AJB_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WB_ModeSelect_AnnouncementsParentWindow.WB_ModeSelect_AnnouncementsParentWindow_C
// 0x0028 (0x02E8 - 0x02C0)
class UWB_ModeSelect_AnnouncementsParentWindow_C final : public UAJBWindowWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(Transient, DuplicateTransient)
	TArray<struct FAJBAnnouncement>               Announcements;                                     // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn)
	class UWB_ModeSelect_AnnouncementWindow_C*    CachedAnnouncementWindow;                          // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         InitialDelaySecToOpenWindow;                       // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DelaySecToOpenWindow;                              // 0x02E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ModeSelect_AnnouncementsParentWindow(int32 EntryPoint);
	void OnClosedAnnouncementWindow(class UAJBWindowWidget* TargetWidget);
	void OnClosingWindow();
	void OnOpeningWindow();
	void OpenAnnouncementWindow(int32 AnnouncementIndex);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_ModeSelect_AnnouncementsParentWindow_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_ModeSelect_AnnouncementsParentWindow_C")
	}
	static class UWB_ModeSelect_AnnouncementsParentWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ModeSelect_AnnouncementsParentWindow_C>();
	}
};
DUMPER7_ASSERTS_UWB_ModeSelect_AnnouncementsParentWindow_C;

SDK_NAMESPACE_END
