#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ModeSelect_VolumeChangeButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WB_ModeSelect_VolumeChangeButton.WB_ModeSelect_VolumeChangeButton_C
// 0x0048 (0x02E8 - 0x02A0)
class UWB_ModeSelect_VolumeChangeButton_C final : public UAJBButtonWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02A0(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_AppearVolumeBar;                              // 0x02A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBButton*                             AJBButton_Headphone;                               // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ExpBar;                                            // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USlider*                                Slider_Volume;                                     // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DMI_Bar;                                           // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCloseedHeadphoneSlider;                           // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           HeadphoneSliderHandle;                             // 0x02D8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          bReentrantSliderVolume;                            // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WB_ModeSelect_VolumeChangeButton(int32 EntryPoint);
	void BndEvt__AJBButton_Headphone_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ResetTimerForUntouchToggle();
	void BndEvt__Slider_Volume_K2Node_ComponentBoundEvent_3_OnMouseCaptureEndEvent__DelegateSignature();
	void BndEvt__Slider_Volume_K2Node_ComponentBoundEvent_2_OnMouseCaptureBeginEvent__DelegateSignature();
	void BndEvt__Slider_Volume_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void ToggleHeadphoneSlider();
	class UAJBButton* GetButton();
	void SetCurrentValueRate(float Value);

	float GetCurrentVolumeRate() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_ModeSelect_VolumeChangeButton_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_ModeSelect_VolumeChangeButton_C")
	}
	static class UWB_ModeSelect_VolumeChangeButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ModeSelect_VolumeChangeButton_C>();
	}
};
DUMPER7_ASSERTS_UWB_ModeSelect_VolumeChangeButton_C;

SDK_NAMESPACE_END
