#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ModeSelect_AnnouncementWindow

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WB_ModeSelect_AnnouncementWindow.WB_ModeSelect_AnnouncementWindow_C.ExecuteUbergraph_WB_ModeSelect_AnnouncementWindow
// 0x01B0 (0x01B0 - 0x0000)
struct WB_ModeSelect_AnnouncementWindow_C_ExecuteUbergraph_WB_ModeSelect_AnnouncementWindow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 Temp_string_Variable;                              // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent;     // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButtonWidget*                       K2Node_ComponentBoundEvent_OwnerWidget;            // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             K2Node_ComponentBoundEvent_TargetButton;           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent1;    // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable1;                                // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_LocalImageFullPath;             // 0x0058(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ImageWidth;                     // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ImageHeight;                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue1;             // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const class FString& LocalImageFullPath, int32 ImageWidth, int32 ImageHeight)> K2Node_CreateDelegate_OutputDelegate1; // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0088(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UAJBAsyncTaskDownloadImage*             CallFunc_AJBDownloadImage_ReturnValue;             // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_TryGetAnnounceText_OutValue;              // 0x00A0(0x0018)()
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00B8(0x0018)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x00D4(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0110(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 K2Node_CustomEvent_LocalImageFullPath1;            // 0x0120(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ImageWidth1;                    // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_ImageHeight1;                   // 0x0134(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBOutGameHUD_BP_bSuccess;             // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBOutGameHUD_C*                    CallFunc_GetAJBOutGameHUD_BP_Out_Game_HUD;         // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBOutGameHUD_BP_bSuccess1;            // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBOutGameHUD_C*                    CallFunc_GetAJBOutGameHUD_BP_Out_Game_HUD1;        // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const class FString& LocalImageFullPath, int32 ImageWidth, int32 ImageHeight)> K2Node_CreateDelegate_OutputDelegate2; // 0x0158(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GetAJBOutGameHUD_BP_bSuccess2;            // 0x0168(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_169[0x7];                                      // 0x0169(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBOutGameHUD_C*                    CallFunc_GetAJBOutGameHUD_BP_Out_Game_HUD2;        // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetViewportSize_ReturnValue;              // 0x0178(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue1;           // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X1;                         // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y1;                         // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue2;           // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue1;         // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue3;           // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x01A8(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_ModeSelect_AnnouncementWindow_C_ExecuteUbergraph_WB_ModeSelect_AnnouncementWindow;

// Function WB_ModeSelect_AnnouncementWindow.WB_ModeSelect_AnnouncementWindow_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_ModeSelect_AnnouncementWindow_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_ModeSelect_AnnouncementWindow_C_Tick;

// Function WB_ModeSelect_AnnouncementWindow.WB_ModeSelect_AnnouncementWindow_C.BndEvt__WB_CommonButton_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_ModeSelect_AnnouncementWindow_C_BndEvt__WB_CommonButton_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature final
{
public:
	class UAJBButtonWidget*                       OwnerWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             TargetButton;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_ModeSelect_AnnouncementWindow_C_BndEvt__WB_CommonButton_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature;

// Function WB_ModeSelect_AnnouncementWindow.WB_ModeSelect_AnnouncementWindow_C.OnSuccess_4DEC711A433711C82F428A8ABAAA75EB
// 0x0018 (0x0018 - 0x0000)
struct WB_ModeSelect_AnnouncementWindow_C_OnSuccess_4DEC711A433711C82F428A8ABAAA75EB final
{
public:
	class FString                                 LocalImageFullPath;                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         ImageWidth;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ImageHeight;                                       // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_ModeSelect_AnnouncementWindow_C_OnSuccess_4DEC711A433711C82F428A8ABAAA75EB;

// Function WB_ModeSelect_AnnouncementWindow.WB_ModeSelect_AnnouncementWindow_C.OnFail_4DEC711A433711C82F428A8ABAAA75EB
// 0x0018 (0x0018 - 0x0000)
struct WB_ModeSelect_AnnouncementWindow_C_OnFail_4DEC711A433711C82F428A8ABAAA75EB final
{
public:
	class FString                                 LocalImageFullPath;                                // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         ImageWidth;                                        // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ImageHeight;                                       // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_ModeSelect_AnnouncementWindow_C_OnFail_4DEC711A433711C82F428A8ABAAA75EB;

// Function WB_ModeSelect_AnnouncementWindow.WB_ModeSelect_AnnouncementWindow_C.TryGetAnnounceText
// 0x0050 (0x0050 - 0x0000)
struct WB_ModeSelect_AnnouncementWindow_C_TryGetAnnounceText final
{
public:
	class FString                                 Text;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   OutValue;                                          // 0x0010(0x0018)(Parm, OutParm)
	class FString                                 CallFunc_Replace_ReturnValue;                      // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0038(0x0018)()
};
DUMPER7_ASSERTS_WB_ModeSelect_AnnouncementWindow_C_TryGetAnnounceText;

// Function WB_ModeSelect_AnnouncementWindow.WB_ModeSelect_AnnouncementWindow_C.OnInputTurnRate
// 0x0008 (0x0008 - 0x0000)
struct WB_ModeSelect_AnnouncementWindow_C_OnInputTurnRate final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_AnnouncementWindow_C_OnInputTurnRate;

// Function WB_ModeSelect_AnnouncementWindow.WB_ModeSelect_AnnouncementWindow_C.OnInputReleasedUp
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_AnnouncementWindow_C_OnInputReleasedUp final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_AnnouncementWindow_C_OnInputReleasedUp;

// Function WB_ModeSelect_AnnouncementWindow.WB_ModeSelect_AnnouncementWindow_C.OnInputReleasedTouch
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_AnnouncementWindow_C_OnInputReleasedTouch final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_AnnouncementWindow_C_OnInputReleasedTouch;

// Function WB_ModeSelect_AnnouncementWindow.WB_ModeSelect_AnnouncementWindow_C.OnInputReleasedRight
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_AnnouncementWindow_C_OnInputReleasedRight final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_AnnouncementWindow_C_OnInputReleasedRight;

// Function WB_ModeSelect_AnnouncementWindow.WB_ModeSelect_AnnouncementWindow_C.OnInputReleasedR2
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_AnnouncementWindow_C_OnInputReleasedR2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_AnnouncementWindow_C_OnInputReleasedR2;

// Function WB_ModeSelect_AnnouncementWindow.WB_ModeSelect_AnnouncementWindow_C.OnInputReleasedR1
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_AnnouncementWindow_C_OnInputReleasedR1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_AnnouncementWindow_C_OnInputReleasedR1;

// Function WB_ModeSelect_AnnouncementWindow.WB_ModeSelect_AnnouncementWindow_C.OnInputReleasedLeft
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_AnnouncementWindow_C_OnInputReleasedLeft final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_AnnouncementWindow_C_OnInputReleasedLeft;

// Function WB_ModeSelect_AnnouncementWindow.WB_ModeSelect_AnnouncementWindow_C.OnInputReleasedL3
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_AnnouncementWindow_C_OnInputReleasedL3 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_AnnouncementWindow_C_OnInputReleasedL3;

// Function WB_ModeSelect_AnnouncementWindow.WB_ModeSelect_AnnouncementWindow_C.OnInputReleasedL2
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_AnnouncementWindow_C_OnInputReleasedL2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_AnnouncementWindow_C_OnInputReleasedL2;

// Function WB_ModeSelect_AnnouncementWindow.WB_ModeSelect_AnnouncementWindow_C.OnInputReleasedL1
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_AnnouncementWindow_C_OnInputReleasedL1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_AnnouncementWindow_C_OnInputReleasedL1;

// Function WB_ModeSelect_AnnouncementWindow.WB_ModeSelect_AnnouncementWindow_C.OnInputReleasedDown
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_AnnouncementWindow_C_OnInputReleasedDown final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_AnnouncementWindow_C_OnInputReleasedDown;

// Function WB_ModeSelect_AnnouncementWindow.WB_ModeSelect_AnnouncementWindow_C.OnInputReleasedDecide
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_AnnouncementWindow_C_OnInputReleasedDecide final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_AnnouncementWindow_C_OnInputReleasedDecide;

// Function WB_ModeSelect_AnnouncementWindow.WB_ModeSelect_AnnouncementWindow_C.OnInputReleasedCancel
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_AnnouncementWindow_C_OnInputReleasedCancel final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_AnnouncementWindow_C_OnInputReleasedCancel;

// Function WB_ModeSelect_AnnouncementWindow.WB_ModeSelect_AnnouncementWindow_C.OnInputPressedUp
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_AnnouncementWindow_C_OnInputPressedUp final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_AnnouncementWindow_C_OnInputPressedUp;

// Function WB_ModeSelect_AnnouncementWindow.WB_ModeSelect_AnnouncementWindow_C.OnInputPressedTouch
// 0x000C (0x000C - 0x0000)
struct WB_ModeSelect_AnnouncementWindow_C_OnInputPressedTouch final
{
public:
	float                                         LocationX;                                         // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LocationY;                                         // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_AnnouncementWindow_C_OnInputPressedTouch;

// Function WB_ModeSelect_AnnouncementWindow.WB_ModeSelect_AnnouncementWindow_C.OnInputPressedRight
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_AnnouncementWindow_C_OnInputPressedRight final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_AnnouncementWindow_C_OnInputPressedRight;

// Function WB_ModeSelect_AnnouncementWindow.WB_ModeSelect_AnnouncementWindow_C.OnInputPressedR2
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_AnnouncementWindow_C_OnInputPressedR2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_AnnouncementWindow_C_OnInputPressedR2;

// Function WB_ModeSelect_AnnouncementWindow.WB_ModeSelect_AnnouncementWindow_C.OnInputPressedR1
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_AnnouncementWindow_C_OnInputPressedR1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_AnnouncementWindow_C_OnInputPressedR1;

// Function WB_ModeSelect_AnnouncementWindow.WB_ModeSelect_AnnouncementWindow_C.OnInputPressedLeft
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_AnnouncementWindow_C_OnInputPressedLeft final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_AnnouncementWindow_C_OnInputPressedLeft;

// Function WB_ModeSelect_AnnouncementWindow.WB_ModeSelect_AnnouncementWindow_C.OnInputPressedL3
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_AnnouncementWindow_C_OnInputPressedL3 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_AnnouncementWindow_C_OnInputPressedL3;

// Function WB_ModeSelect_AnnouncementWindow.WB_ModeSelect_AnnouncementWindow_C.OnInputPressedL2
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_AnnouncementWindow_C_OnInputPressedL2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_AnnouncementWindow_C_OnInputPressedL2;

// Function WB_ModeSelect_AnnouncementWindow.WB_ModeSelect_AnnouncementWindow_C.OnInputPressedL1
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_AnnouncementWindow_C_OnInputPressedL1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_AnnouncementWindow_C_OnInputPressedL1;

// Function WB_ModeSelect_AnnouncementWindow.WB_ModeSelect_AnnouncementWindow_C.OnInputPressedDown
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_AnnouncementWindow_C_OnInputPressedDown final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_AnnouncementWindow_C_OnInputPressedDown;

// Function WB_ModeSelect_AnnouncementWindow.WB_ModeSelect_AnnouncementWindow_C.OnInputPressedDecide
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_AnnouncementWindow_C_OnInputPressedDecide final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_AnnouncementWindow_C_OnInputPressedDecide;

// Function WB_ModeSelect_AnnouncementWindow.WB_ModeSelect_AnnouncementWindow_C.OnInputPressedCancel
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_AnnouncementWindow_C_OnInputPressedCancel final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_AnnouncementWindow_C_OnInputPressedCancel;

// Function WB_ModeSelect_AnnouncementWindow.WB_ModeSelect_AnnouncementWindow_C.OnInputMoveRight
// 0x0008 (0x0008 - 0x0000)
struct WB_ModeSelect_AnnouncementWindow_C_OnInputMoveRight final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_AnnouncementWindow_C_OnInputMoveRight;

// Function WB_ModeSelect_AnnouncementWindow.WB_ModeSelect_AnnouncementWindow_C.OnInputMoveForward
// 0x0008 (0x0008 - 0x0000)
struct WB_ModeSelect_AnnouncementWindow_C_OnInputMoveForward final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_AnnouncementWindow_C_OnInputMoveForward;

// Function WB_ModeSelect_AnnouncementWindow.WB_ModeSelect_AnnouncementWindow_C.OnInputLookupRate
// 0x0008 (0x0008 - 0x0000)
struct WB_ModeSelect_AnnouncementWindow_C_OnInputLookupRate final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_AnnouncementWindow_C_OnInputLookupRate;

// Function WB_ModeSelect_AnnouncementWindow.WB_ModeSelect_AnnouncementWindow_C.IsModeless
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_AnnouncementWindow_C_IsModeless final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_AnnouncementWindow_C_IsModeless;

// Function WB_ModeSelect_AnnouncementWindow.WB_ModeSelect_AnnouncementWindow_C.OnInputPressedY
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_AnnouncementWindow_C_OnInputPressedY final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_AnnouncementWindow_C_OnInputPressedY;

// Function WB_ModeSelect_AnnouncementWindow.WB_ModeSelect_AnnouncementWindow_C.OnInputPressedX
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_AnnouncementWindow_C_OnInputPressedX final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_AnnouncementWindow_C_OnInputPressedX;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
