#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ModeSelect_Button_EndGame

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WB_ModeSelect_Button_EndGame.WB_ModeSelect_Button_EndGame_C.ExecuteUbergraph_WB_ModeSelect_Button_EndGame
// 0x000C (0x000C - 0x0000)
struct WB_ModeSelect_Button_EndGame_C_ExecuteUbergraph_WB_ModeSelect_Button_EndGame final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPressableVisibility_ReturnValue;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_Button_EndGame_C_ExecuteUbergraph_WB_ModeSelect_Button_EndGame;

// Function WB_ModeSelect_Button_EndGame.WB_ModeSelect_Button_EndGame_C.GetButton
// 0x0008 (0x0008 - 0x0000)
struct WB_ModeSelect_Button_EndGame_C_GetButton final
{
public:
	class UAJBButton*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_ModeSelect_Button_EndGame_C_GetButton;

// Function WB_ModeSelect_Button_EndGame.WB_ModeSelect_Button_EndGame_C.IsButtonDecisioning
// 0x0005 (0x0005 - 0x0000)
struct WB_ModeSelect_Button_EndGame_C_IsButtonDecisioning final
{
public:
	bool                                          IsDecisioning;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlaying_ReturnValue;           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimationPlayingForward_ReturnValue;    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_Button_EndGame_C_IsButtonDecisioning;

// Function WB_ModeSelect_Button_EndGame.WB_ModeSelect_Button_EndGame_C.GetAuraImage
// 0x0008 (0x0008 - 0x0000)
struct WB_ModeSelect_Button_EndGame_C_GetAuraImage final
{
public:
	class UImage*                                 AuraImage;                                         // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_ModeSelect_Button_EndGame_C_GetAuraImage;

// Function WB_ModeSelect_Button_EndGame.WB_ModeSelect_Button_EndGame_C.GetRetainerEffectMaterial
// 0x0010 (0x0010 - 0x0000)
struct WB_ModeSelect_Button_EndGame_C_GetRetainerEffectMaterial final
{
public:
	class UMaterialInstanceDynamic*               EffectMaterial;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_GetEffectMaterial_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_ModeSelect_Button_EndGame_C_GetRetainerEffectMaterial;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
