#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ModeSelect_EndTheGame

#include "Basic.hpp"

#include "AJB_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.ExecuteUbergraph_WB_ModeSelect_EndTheGame
// 0x0410 (0x0410 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAJBNetAPIResult                              K2Node_CustomEvent_Result1;                        // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAJBNetAPIResult Result)>      K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	EAJBNetAPIResult                              K2Node_CustomEvent_Result;                         // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAJBNetAPIResult Result)>      K2Node_CreateDelegate_OutputDelegate1;             // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	EAJBNetAPIResult                              Temp_byte_Variable;                                // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue1;             // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CommonWIndow_S_C*                   CallFunc_Create_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAJBWindowWidget* TargetWidget)> K2Node_CreateDelegate_OutputDelegate2;     // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	class UWB_CommonWIndow_S_C*                   CallFunc_Create_ReturnValue1;                      // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAJBNetAPIResult                              Temp_byte_Variable1;                               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAJBLogoutReward                       Temp_struct_Variable;                              // 0x0060(0x00A0)()
	EAJBNetAPIResult                              K2Node_CustomEvent_Result2;                        // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAJBLogoutReward                       K2Node_CustomEvent_Reward;                         // 0x0108(0x00A0)()
	EAJBNetAPIResult                              K2Node_CustomEvent_Result3;                        // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAJBLogoutReward                       K2Node_CustomEvent_Reward1;                        // 0x01B0(0x00A0)()
	TDelegate<void(EAJBNetAPIResult Result, const struct FAJBLogoutReward& Reward)> K2Node_CreateDelegate_OutputDelegate3; // 0x0250(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue2;             // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAJBNetAPIResult Result, const struct FAJBLogoutReward& Reward)> K2Node_CreateDelegate_OutputDelegate4; // 0x0268(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EAJBConfirmResult                             CallFunc_GetButtonResult_Result;                   // 0x0279(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x027A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_27B[0x5];                                      // 0x027B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAJBButtonWidget*                       K2Node_ComponentBoundEvent_OwnerWidget1;           // 0x0280(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             K2Node_ComponentBoundEvent_TargetButton1;          // 0x0288(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButtonWidget*                       K2Node_ComponentBoundEvent_OwnerWidget;            // 0x0290(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             K2Node_ComponentBoundEvent_TargetButton;           // 0x0298(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetPP_PP;                                 // 0x02A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetExpNum_Num;                            // 0x02A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x02A8(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue1;              // 0x02C0(0x0018)()
	bool                                          CallFunc_GetAJBOutGamePlayerController_BP_bSuccess; // 0x02D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBOutGamePlayerController_C*       CallFunc_GetAJBOutGamePlayerController_BP_Out_Game_Player_Controller; // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IBI_AJBOutGameProxyInterface_C> CallFunc_GetAJBOutGameProxy_self_CastInput; // 0x02E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class ABP_AJBOutGameProxy_C*                  CallFunc_GetAJBOutGameProxy_Object;                // 0x02F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBNetAPI_Logout*                      CallFunc_Request_UserLogout_ReturnValue;           // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBNetAPI*                             CallFunc_Request_SysServeralive_ReturnValue;       // 0x0308(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue1;                     // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue2;                     // 0x0311(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_312[0x6];                                      // 0x0312(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent;     // 0x0318(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAJBArcadeTerminateGame_ReturnValue;     // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UAJBWindowWidget* TargetWidget)> K2Node_CreateDelegate_OutputDelegate5;     // 0x0328(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue1;         // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAJBOfflineMode_ReturnValue;             // 0x0339(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x033A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue3;                     // 0x033B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x033C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_33D[0x3];                                      // 0x033D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0340(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAJBArcadeTerminateGame_ReturnValue1;    // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFreePlay_ReturnValue;                   // 0x0349(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsGuestPlaying_ReturnValue;               // 0x034A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue3;             // 0x034B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue1;                   // 0x034C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue2;                   // 0x034D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_34E[0x2];                                      // 0x034E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UAJBWindowWidget*                       K2Node_CustomEvent_TargetWidget1;                  // 0x0350(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue3;                   // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_359[0x7];                                      // 0x0359(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWB_CommonWIndow_S_C*                   CallFunc_Create_ReturnValue2;                      // 0x0360(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0368(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_369[0x7];                                      // 0x0369(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetArcadeTerminateText_ReturnValue;       // 0x0370(0x0018)()
	class FText                                   CallFunc_GetArcadeTerminateText_ReturnValue1;      // 0x0388(0x0018)()
	bool                                          K2Node_CustomEvent_bRetry;                         // 0x03A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3A1[0x7];                                      // 0x03A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_BuildString_Int_ReturnValue;              // 0x03A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_BuildString_Int_ReturnValue1;             // 0x03B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_BuildString_Int_ReturnValue2;             // 0x03C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_BuildString_Int_ReturnValue3;             // 0x03D8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue4;             // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate6;             // 0x03F0(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue5;             // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_401[0x7];                                      // 0x0401(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAJBWindowWidget*                       K2Node_CustomEvent_TargetWidget;                   // 0x0408(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_ModeSelect_EndTheGame_C_ExecuteUbergraph_WB_ModeSelect_EndTheGame;

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.OnClosedNetworkErrorWindow
// 0x0008 (0x0008 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_OnClosedNetworkErrorWindow final
{
public:
	class UAJBWindowWidget*                       TargetWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_ModeSelect_EndTheGame_C_OnClosedNetworkErrorWindow;

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.DisplayPpExpExchangingResult
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_DisplayPpExpExchangingResult final
{
public:
	bool                                          bRetry;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EndTheGame_C_DisplayPpExpExchangingResult;

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.OnClosedConfirm
// 0x0008 (0x0008 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_OnClosedConfirm final
{
public:
	class UAJBWindowWidget*                       TargetWidget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_ModeSelect_EndTheGame_C_OnClosedConfirm;

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.BndEvt__WB_CommonButton_Cancel_K2Node_ComponentBoundEvent_5_OnAJBButtonEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_BndEvt__WB_CommonButton_Cancel_K2Node_ComponentBoundEvent_5_OnAJBButtonEvent__DelegateSignature final
{
public:
	class UAJBButtonWidget*                       OwnerWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             TargetButton;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_ModeSelect_EndTheGame_C_BndEvt__WB_CommonButton_Cancel_K2Node_ComponentBoundEvent_5_OnAJBButtonEvent__DelegateSignature;

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.BndEvt__WB_CommonButton_OK_K2Node_ComponentBoundEvent_4_OnAJBButtonEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_BndEvt__WB_CommonButton_OK_K2Node_ComponentBoundEvent_4_OnAJBButtonEvent__DelegateSignature final
{
public:
	class UAJBButtonWidget*                       OwnerWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             TargetButton;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_ModeSelect_EndTheGame_C_BndEvt__WB_CommonButton_OK_K2Node_ComponentBoundEvent_4_OnAJBButtonEvent__DelegateSignature;

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.OnSuccess_B2798BC646B804B1DF62CBB4676388AD
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_OnSuccess_B2798BC646B804B1DF62CBB4676388AD final
{
public:
	EAJBNetAPIResult                              Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_ModeSelect_EndTheGame_C_OnSuccess_B2798BC646B804B1DF62CBB4676388AD;

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.OnFailed_B2798BC646B804B1DF62CBB4676388AD
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_OnFailed_B2798BC646B804B1DF62CBB4676388AD final
{
public:
	EAJBNetAPIResult                              Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_ModeSelect_EndTheGame_C_OnFailed_B2798BC646B804B1DF62CBB4676388AD;

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.OnSuccess_A50BF3104A67040AAFB1E5809807835F
// 0x00A8 (0x00A8 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_OnSuccess_A50BF3104A67040AAFB1E5809807835F final
{
public:
	EAJBNetAPIResult                              Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAJBLogoutReward                       Reward;                                            // 0x0008(0x00A0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WB_ModeSelect_EndTheGame_C_OnSuccess_A50BF3104A67040AAFB1E5809807835F;

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.OnFailed_A50BF3104A67040AAFB1E5809807835F
// 0x00A8 (0x00A8 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_OnFailed_A50BF3104A67040AAFB1E5809807835F final
{
public:
	EAJBNetAPIResult                              Result;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAJBLogoutReward                       Reward;                                            // 0x0008(0x00A0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WB_ModeSelect_EndTheGame_C_OnFailed_A50BF3104A67040AAFB1E5809807835F;

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.GetPP
// 0x0010 (0x0010 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_GetPP final
{
public:
	int32                                         PP;                                                // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_ModeSelect_EndTheGame_C_GetPP;

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.GetExpNum
// 0x000C (0x000C - 0x0000)
struct WB_ModeSelect_EndTheGame_C_GetExpNum final
{
public:
	int32                                         Num;                                               // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_ModeSelect_EndTheGame_C_GetExpNum;

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.GetArcadeTerminateText
// 0x0078 (0x0078 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_GetArcadeTerminateText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0020(0x0018)()
	class FText                                   Temp_text_Variable1;                               // 0x0038(0x0018)()
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetCacheInteger_OutValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetCacheInteger_ReturnValue;              // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5E[0x2];                                       // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Select_Default;                             // 0x0060(0x0018)()
};
DUMPER7_ASSERTS_WB_ModeSelect_EndTheGame_C_GetArcadeTerminateText;

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.OnInputTurnRate
// 0x0008 (0x0008 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_OnInputTurnRate final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EndTheGame_C_OnInputTurnRate;

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.OnInputReleasedUp
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_OnInputReleasedUp final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EndTheGame_C_OnInputReleasedUp;

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.OnInputReleasedTouch
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_OnInputReleasedTouch final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EndTheGame_C_OnInputReleasedTouch;

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.OnInputReleasedRight
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_OnInputReleasedRight final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EndTheGame_C_OnInputReleasedRight;

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.OnInputReleasedLeft
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_OnInputReleasedLeft final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EndTheGame_C_OnInputReleasedLeft;

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.OnInputReleasedDown
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_OnInputReleasedDown final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EndTheGame_C_OnInputReleasedDown;

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.OnInputReleasedDecide
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_OnInputReleasedDecide final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EndTheGame_C_OnInputReleasedDecide;

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.OnInputReleasedCancel
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_OnInputReleasedCancel final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EndTheGame_C_OnInputReleasedCancel;

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.OnInputPressedUp
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_OnInputPressedUp final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EndTheGame_C_OnInputPressedUp;

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.OnInputPressedTouch
// 0x000C (0x000C - 0x0000)
struct WB_ModeSelect_EndTheGame_C_OnInputPressedTouch final
{
public:
	float                                         LocationX;                                         // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LocationY;                                         // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EndTheGame_C_OnInputPressedTouch;

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.OnInputPressedRight
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_OnInputPressedRight final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EndTheGame_C_OnInputPressedRight;

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.OnInputPressedLeft
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_OnInputPressedLeft final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EndTheGame_C_OnInputPressedLeft;

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.OnInputPressedDown
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_OnInputPressedDown final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EndTheGame_C_OnInputPressedDown;

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.OnInputPressedDecide
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_OnInputPressedDecide final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EndTheGame_C_OnInputPressedDecide;

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.OnInputPressedCancel
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_OnInputPressedCancel final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EndTheGame_C_OnInputPressedCancel;

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.OnInputMoveRight
// 0x0008 (0x0008 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_OnInputMoveRight final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EndTheGame_C_OnInputMoveRight;

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.OnInputMoveForward
// 0x0008 (0x0008 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_OnInputMoveForward final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EndTheGame_C_OnInputMoveForward;

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.OnInputLookupRate
// 0x0008 (0x0008 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_OnInputLookupRate final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EndTheGame_C_OnInputLookupRate;

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.IsModeless
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_IsModeless final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EndTheGame_C_IsModeless;

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.OnInputReleasedR2
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_OnInputReleasedR2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EndTheGame_C_OnInputReleasedR2;

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.OnInputReleasedR1
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_OnInputReleasedR1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EndTheGame_C_OnInputReleasedR1;

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.OnInputReleasedL3
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_OnInputReleasedL3 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EndTheGame_C_OnInputReleasedL3;

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.OnInputReleasedL2
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_OnInputReleasedL2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EndTheGame_C_OnInputReleasedL2;

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.OnInputReleasedL1
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_OnInputReleasedL1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EndTheGame_C_OnInputReleasedL1;

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.OnInputPressedR2
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_OnInputPressedR2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EndTheGame_C_OnInputPressedR2;

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.OnInputPressedR1
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_OnInputPressedR1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EndTheGame_C_OnInputPressedR1;

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.OnInputPressedL3
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_OnInputPressedL3 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EndTheGame_C_OnInputPressedL3;

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.OnInputPressedL2
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_OnInputPressedL2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EndTheGame_C_OnInputPressedL2;

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.OnInputPressedL1
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_OnInputPressedL1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EndTheGame_C_OnInputPressedL1;

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.OnInputPressedY
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_OnInputPressedY final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EndTheGame_C_OnInputPressedY;

// Function WB_ModeSelect_EndTheGame.WB_ModeSelect_EndTheGame_C.OnInputPressedX
// 0x0001 (0x0001 - 0x0000)
struct WB_ModeSelect_EndTheGame_C_OnInputPressedX final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_ModeSelect_EndTheGame_C_OnInputPressedX;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
