#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_OfflineModeLabel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WB_OfflineModeLabel.WB_OfflineModeLabel_C
// 0x0028 (0x0230 - 0x0208)
class UWB_OfflineModeLabel_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UAJBTextBlock*                          AJBTextBlock_Row1;                                 // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          AJBTextBlock_Row2;                                 // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              BG;                                                // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          isPPBuy;                                           // 0x0228(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WB_OfflineModeLabel(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void ChangeDisplayType(bool PPBuyMode);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_OfflineModeLabel_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_OfflineModeLabel_C")
	}
	static class UWB_OfflineModeLabel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_OfflineModeLabel_C>();
	}
};
DUMPER7_ASSERTS_UWB_OfflineModeLabel_C;

SDK_NAMESPACE_END
