#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_OfflineModeLabel

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WB_OfflineModeLabel.WB_OfflineModeLabel_C.ExecuteUbergraph_WB_OfflineModeLabel
// 0x0008 (0x0008 - 0x0000)
struct WB_OfflineModeLabel_C_ExecuteUbergraph_WB_OfflineModeLabel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_PPBuyMode;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_OfflineModeLabel_C_ExecuteUbergraph_WB_OfflineModeLabel;

// Function WB_OfflineModeLabel.WB_OfflineModeLabel_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_OfflineModeLabel_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_OfflineModeLabel_C_PreConstruct;

// Function WB_OfflineModeLabel.WB_OfflineModeLabel_C.ChangeDisplayType
// 0x0001 (0x0001 - 0x0000)
struct WB_OfflineModeLabel_C_ChangeDisplayType final
{
public:
	bool                                          PPBuyMode;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_OfflineModeLabel_C_ChangeDisplayType;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
