#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_PairAlertConfirm

#include "Basic.hpp"

#include "AJB_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.ExecuteUbergraph_WB_PairAlertConfirm
// 0x0050 (0x0050 - 0x0000)
struct WB_PairAlertConfirm_C_ExecuteUbergraph_WB_PairAlertConfirm final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent;     // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent1;    // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bIsPlayDecisionSE;              // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bIsPlayCancelSE;                // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bIsPlayOpenSE;                  // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_bIsPlayCloseSE;                 // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAJBButtonWidget*                       K2Node_ComponentBoundEvent_OwnerWidget;            // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             K2Node_ComponentBoundEvent_TargetButton;           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButtonWidget*                       K2Node_ComponentBoundEvent_OwnerWidget1;           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             K2Node_ComponentBoundEvent_TargetButton1;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_PairAlertConfirm_C_ExecuteUbergraph_WB_PairAlertConfirm;

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.SetIsPlaySE
// 0x0004 (0x0004 - 0x0000)
struct WB_PairAlertConfirm_C_SetIsPlaySE final
{
public:
	bool                                          bIsPlayDecisionSE;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsPlayCancelSE;                                   // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsPlayOpenSE_0;                                   // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bIsPlayCloseSE_0;                                  // 0x0003(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAlertConfirm_C_SetIsPlaySE;

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.BndEvt__WB_CommonButton_YES_K2Node_ComponentBoundEvent_1_OnAJBButtonEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_PairAlertConfirm_C_BndEvt__WB_CommonButton_YES_K2Node_ComponentBoundEvent_1_OnAJBButtonEvent__DelegateSignature final
{
public:
	class UAJBButtonWidget*                       OwnerWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             TargetButton;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_PairAlertConfirm_C_BndEvt__WB_CommonButton_YES_K2Node_ComponentBoundEvent_1_OnAJBButtonEvent__DelegateSignature;

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.BndEvt__WB_CommonButton_NO_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_PairAlertConfirm_C_BndEvt__WB_CommonButton_NO_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature final
{
public:
	class UAJBButtonWidget*                       OwnerWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             TargetButton;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_PairAlertConfirm_C_BndEvt__WB_CommonButton_NO_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature;

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.GetButtonResult
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_GetButtonResult final
{
public:
	EAJBConfirmResult                             Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_PairAlertConfirm_C_GetButtonResult;

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputReleasedUp
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputReleasedUp final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAlertConfirm_C_OnInputReleasedUp;

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputReleasedRight
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputReleasedRight final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAlertConfirm_C_OnInputReleasedRight;

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputReleasedLeft
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputReleasedLeft final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAlertConfirm_C_OnInputReleasedLeft;

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputReleasedDown
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputReleasedDown final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAlertConfirm_C_OnInputReleasedDown;

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputReleasedDecide
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputReleasedDecide final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAlertConfirm_C_OnInputReleasedDecide;

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputReleasedCancel
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputReleasedCancel final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAlertConfirm_C_OnInputReleasedCancel;

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputPressedUp
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputPressedUp final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAlertConfirm_C_OnInputPressedUp;

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputPressedRight
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputPressedRight final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAlertConfirm_C_OnInputPressedRight;

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputPressedLeft
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputPressedLeft final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAlertConfirm_C_OnInputPressedLeft;

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputPressedDown
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputPressedDown final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAlertConfirm_C_OnInputPressedDown;

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputPressedDecide
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputPressedDecide final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAlertConfirm_C_OnInputPressedDecide;

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputPressedCancel
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputPressedCancel final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAlertConfirm_C_OnInputPressedCancel;

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputTurnRate
// 0x0008 (0x0008 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputTurnRate final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAlertConfirm_C_OnInputTurnRate;

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputReleasedTouch
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputReleasedTouch final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAlertConfirm_C_OnInputReleasedTouch;

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputPressedTouch
// 0x000C (0x000C - 0x0000)
struct WB_PairAlertConfirm_C_OnInputPressedTouch final
{
public:
	float                                         LocationX;                                         // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LocationY;                                         // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAlertConfirm_C_OnInputPressedTouch;

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputMoveRight
// 0x0008 (0x0008 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputMoveRight final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAlertConfirm_C_OnInputMoveRight;

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputMoveForward
// 0x0008 (0x0008 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputMoveForward final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAlertConfirm_C_OnInputMoveForward;

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputLookupRate
// 0x0008 (0x0008 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputLookupRate final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAlertConfirm_C_OnInputLookupRate;

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.IsModeless
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_IsModeless final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAlertConfirm_C_IsModeless;

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputReleasedR2
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputReleasedR2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAlertConfirm_C_OnInputReleasedR2;

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputReleasedR1
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputReleasedR1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAlertConfirm_C_OnInputReleasedR1;

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputReleasedL2
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputReleasedL2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAlertConfirm_C_OnInputReleasedL2;

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputReleasedL1
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputReleasedL1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAlertConfirm_C_OnInputReleasedL1;

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputPressedR2
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputPressedR2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAlertConfirm_C_OnInputPressedR2;

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputPressedR1
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputPressedR1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAlertConfirm_C_OnInputPressedR1;

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputPressedL2
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputPressedL2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAlertConfirm_C_OnInputPressedL2;

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputPressedL1
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputPressedL1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAlertConfirm_C_OnInputPressedL1;

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputReleasedL3
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputReleasedL3 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAlertConfirm_C_OnInputReleasedL3;

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputPressedL3
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputPressedL3 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAlertConfirm_C_OnInputPressedL3;

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputPressedY
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputPressedY final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAlertConfirm_C_OnInputPressedY;

// Function WB_PairAlertConfirm.WB_PairAlertConfirm_C.OnInputPressedX
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAlertConfirm_C_OnInputPressedX final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAlertConfirm_C_OnInputPressedX;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
