#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_PvE_ScoreWindow_Detail

#include "Basic.hpp"

#include "AJB_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WB_PvE_ScoreWindow_Detail.WB_PvE_ScoreWindow_Detail_C.ExecuteUbergraph_WB_PvE_ScoreWindow_Detail
// 0x0088 (0x0088 - 0x0000)
struct WB_PvE_ScoreWindow_Detail_C_ExecuteUbergraph_WB_PvE_ScoreWindow_Detail final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAJBLimitedBounusSign                         Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable1;                               // 0x0020(0x0018)()
	class FText                                   K2Node_CustomEvent_InText;                         // 0x0038(0x0018)()
	EAJBLimitedBounusSign                         K2Node_CustomEvent_Sign;                           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_Value;                          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0058(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0070(0x0018)()
};
DUMPER7_ASSERTS_WB_PvE_ScoreWindow_Detail_C_ExecuteUbergraph_WB_PvE_ScoreWindow_Detail;

// Function WB_PvE_ScoreWindow_Detail.WB_PvE_ScoreWindow_Detail_C.SetupDisplay
// 0x0020 (0x0020 - 0x0000)
struct WB_PvE_ScoreWindow_Detail_C_SetupDisplay final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	EAJBLimitedBounusSign                         Sign_0;                                            // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Value;                                             // 0x001C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_PvE_ScoreWindow_Detail_C_SetupDisplay;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
