#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_PairAchievement

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WB_PairAchievement.WB_PairAchievement_C.ExecuteUbergraph_WB_PairAchievement
// 0x00C0 (0x00C0 - 0x0000)
struct WB_PairAchievement_C_ExecuteUbergraph_WB_PairAchievement final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent;     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent1;    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButtonWidget*                       K2Node_ComponentBoundEvent_OwnerWidget;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             K2Node_ComponentBoundEvent_TargetButton;           // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0028(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess;              // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD;           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0078(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_GetAJBInGameHUD_BP_bSuccess1;             // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBInGameHUD_C*                     CallFunc_GetAJBInGameHUD_BP_In_Game_HUD1;          // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00A8(0x0018)()
};
DUMPER7_ASSERTS_WB_PairAchievement_C_ExecuteUbergraph_WB_PairAchievement;

// Function WB_PairAchievement.WB_PairAchievement_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAchievement_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAchievement_C_PreConstruct;

// Function WB_PairAchievement.WB_PairAchievement_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_PairAchievement_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_PairAchievement_C_Tick;

// Function WB_PairAchievement.WB_PairAchievement_C.BndEvt__WB_CommonButton_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_PairAchievement_C_BndEvt__WB_CommonButton_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature final
{
public:
	class UAJBButtonWidget*                       OwnerWidget;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAJBButton*                             TargetButton;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_PairAchievement_C_BndEvt__WB_CommonButton_K2Node_ComponentBoundEvent_0_OnAJBButtonEvent__DelegateSignature;

// Function WB_PairAchievement.WB_PairAchievement_C.OnInputTurnRate
// 0x0008 (0x0008 - 0x0000)
struct WB_PairAchievement_C_OnInputTurnRate final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAchievement_C_OnInputTurnRate;

// Function WB_PairAchievement.WB_PairAchievement_C.OnInputReleasedUp
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAchievement_C_OnInputReleasedUp final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAchievement_C_OnInputReleasedUp;

// Function WB_PairAchievement.WB_PairAchievement_C.OnInputReleasedTouch
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAchievement_C_OnInputReleasedTouch final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAchievement_C_OnInputReleasedTouch;

// Function WB_PairAchievement.WB_PairAchievement_C.OnInputReleasedRight
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAchievement_C_OnInputReleasedRight final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAchievement_C_OnInputReleasedRight;

// Function WB_PairAchievement.WB_PairAchievement_C.OnInputReleasedR2
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAchievement_C_OnInputReleasedR2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAchievement_C_OnInputReleasedR2;

// Function WB_PairAchievement.WB_PairAchievement_C.OnInputReleasedR1
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAchievement_C_OnInputReleasedR1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAchievement_C_OnInputReleasedR1;

// Function WB_PairAchievement.WB_PairAchievement_C.OnInputReleasedLeft
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAchievement_C_OnInputReleasedLeft final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAchievement_C_OnInputReleasedLeft;

// Function WB_PairAchievement.WB_PairAchievement_C.OnInputReleasedL3
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAchievement_C_OnInputReleasedL3 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAchievement_C_OnInputReleasedL3;

// Function WB_PairAchievement.WB_PairAchievement_C.OnInputReleasedL2
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAchievement_C_OnInputReleasedL2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAchievement_C_OnInputReleasedL2;

// Function WB_PairAchievement.WB_PairAchievement_C.OnInputReleasedL1
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAchievement_C_OnInputReleasedL1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAchievement_C_OnInputReleasedL1;

// Function WB_PairAchievement.WB_PairAchievement_C.OnInputReleasedDown
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAchievement_C_OnInputReleasedDown final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAchievement_C_OnInputReleasedDown;

// Function WB_PairAchievement.WB_PairAchievement_C.OnInputReleasedDecide
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAchievement_C_OnInputReleasedDecide final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAchievement_C_OnInputReleasedDecide;

// Function WB_PairAchievement.WB_PairAchievement_C.OnInputReleasedCancel
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAchievement_C_OnInputReleasedCancel final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAchievement_C_OnInputReleasedCancel;

// Function WB_PairAchievement.WB_PairAchievement_C.OnInputPressedUp
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAchievement_C_OnInputPressedUp final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAchievement_C_OnInputPressedUp;

// Function WB_PairAchievement.WB_PairAchievement_C.OnInputPressedTouch
// 0x000C (0x000C - 0x0000)
struct WB_PairAchievement_C_OnInputPressedTouch final
{
public:
	float                                         LocationX;                                         // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LocationY;                                         // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAchievement_C_OnInputPressedTouch;

// Function WB_PairAchievement.WB_PairAchievement_C.OnInputPressedRight
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAchievement_C_OnInputPressedRight final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAchievement_C_OnInputPressedRight;

// Function WB_PairAchievement.WB_PairAchievement_C.OnInputPressedR2
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAchievement_C_OnInputPressedR2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAchievement_C_OnInputPressedR2;

// Function WB_PairAchievement.WB_PairAchievement_C.OnInputPressedR1
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAchievement_C_OnInputPressedR1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAchievement_C_OnInputPressedR1;

// Function WB_PairAchievement.WB_PairAchievement_C.OnInputPressedLeft
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAchievement_C_OnInputPressedLeft final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAchievement_C_OnInputPressedLeft;

// Function WB_PairAchievement.WB_PairAchievement_C.OnInputPressedL3
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAchievement_C_OnInputPressedL3 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAchievement_C_OnInputPressedL3;

// Function WB_PairAchievement.WB_PairAchievement_C.OnInputPressedL2
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAchievement_C_OnInputPressedL2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAchievement_C_OnInputPressedL2;

// Function WB_PairAchievement.WB_PairAchievement_C.OnInputPressedL1
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAchievement_C_OnInputPressedL1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAchievement_C_OnInputPressedL1;

// Function WB_PairAchievement.WB_PairAchievement_C.OnInputPressedDown
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAchievement_C_OnInputPressedDown final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAchievement_C_OnInputPressedDown;

// Function WB_PairAchievement.WB_PairAchievement_C.OnInputPressedDecide
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAchievement_C_OnInputPressedDecide final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAchievement_C_OnInputPressedDecide;

// Function WB_PairAchievement.WB_PairAchievement_C.OnInputPressedCancel
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAchievement_C_OnInputPressedCancel final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAchievement_C_OnInputPressedCancel;

// Function WB_PairAchievement.WB_PairAchievement_C.OnInputMoveRight
// 0x0008 (0x0008 - 0x0000)
struct WB_PairAchievement_C_OnInputMoveRight final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAchievement_C_OnInputMoveRight;

// Function WB_PairAchievement.WB_PairAchievement_C.OnInputMoveForward
// 0x0008 (0x0008 - 0x0000)
struct WB_PairAchievement_C_OnInputMoveForward final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAchievement_C_OnInputMoveForward;

// Function WB_PairAchievement.WB_PairAchievement_C.OnInputLookupRate
// 0x0008 (0x0008 - 0x0000)
struct WB_PairAchievement_C_OnInputLookupRate final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAchievement_C_OnInputLookupRate;

// Function WB_PairAchievement.WB_PairAchievement_C.IsModeless
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAchievement_C_IsModeless final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAchievement_C_IsModeless;

// Function WB_PairAchievement.WB_PairAchievement_C.OnInputPressedY
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAchievement_C_OnInputPressedY final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAchievement_C_OnInputPressedY;

// Function WB_PairAchievement.WB_PairAchievement_C.OnInputPressedX
// 0x0001 (0x0001 - 0x0000)
struct WB_PairAchievement_C_OnInputPressedX final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_PairAchievement_C_OnInputPressedX;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
