#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_RoomSelect_PairDecisionWindow

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WB_RoomSelect_PairDecisionWindow.WB_RoomSelect_PairDecisionWindow_C.ExecuteUbergraph_WB_RoomSelect_PairDecisionWindow
// 0x0060 (0x0060 - 0x0000)
struct WB_RoomSelect_PairDecisionWindow_C_ExecuteUbergraph_WB_RoomSelect_PairDecisionWindow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	int32                                         K2Node_CustomEvent_IconID;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PlayerLevel;                    // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_PlayerName;                     // 0x0020(0x0018)()
	class FText                                   K2Node_CustomEvent_PlayerTitle;                    // 0x0038(0x0018)()
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent;     // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent1;    // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_RoomSelect_PairDecisionWindow_C_ExecuteUbergraph_WB_RoomSelect_PairDecisionWindow;

// Function WB_RoomSelect_PairDecisionWindow.WB_RoomSelect_PairDecisionWindow_C.Setup
// 0x0038 (0x0038 - 0x0000)
struct WB_RoomSelect_PairDecisionWindow_C_Setup final
{
public:
	int32                                         IconID;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PlayerLevel;                                       // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   PlayerName;                                        // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   PlayerTitle;                                       // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WB_RoomSelect_PairDecisionWindow_C_Setup;

// Function WB_RoomSelect_PairDecisionWindow.WB_RoomSelect_PairDecisionWindow_C.OnInputTurnRate
// 0x0008 (0x0008 - 0x0000)
struct WB_RoomSelect_PairDecisionWindow_C_OnInputTurnRate final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_RoomSelect_PairDecisionWindow_C_OnInputTurnRate;

// Function WB_RoomSelect_PairDecisionWindow.WB_RoomSelect_PairDecisionWindow_C.OnInputReleasedUp
// 0x0001 (0x0001 - 0x0000)
struct WB_RoomSelect_PairDecisionWindow_C_OnInputReleasedUp final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_RoomSelect_PairDecisionWindow_C_OnInputReleasedUp;

// Function WB_RoomSelect_PairDecisionWindow.WB_RoomSelect_PairDecisionWindow_C.OnInputReleasedTouch
// 0x0001 (0x0001 - 0x0000)
struct WB_RoomSelect_PairDecisionWindow_C_OnInputReleasedTouch final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_RoomSelect_PairDecisionWindow_C_OnInputReleasedTouch;

// Function WB_RoomSelect_PairDecisionWindow.WB_RoomSelect_PairDecisionWindow_C.OnInputReleasedRight
// 0x0001 (0x0001 - 0x0000)
struct WB_RoomSelect_PairDecisionWindow_C_OnInputReleasedRight final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_RoomSelect_PairDecisionWindow_C_OnInputReleasedRight;

// Function WB_RoomSelect_PairDecisionWindow.WB_RoomSelect_PairDecisionWindow_C.OnInputReleasedLeft
// 0x0001 (0x0001 - 0x0000)
struct WB_RoomSelect_PairDecisionWindow_C_OnInputReleasedLeft final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_RoomSelect_PairDecisionWindow_C_OnInputReleasedLeft;

// Function WB_RoomSelect_PairDecisionWindow.WB_RoomSelect_PairDecisionWindow_C.OnInputReleasedDown
// 0x0001 (0x0001 - 0x0000)
struct WB_RoomSelect_PairDecisionWindow_C_OnInputReleasedDown final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_RoomSelect_PairDecisionWindow_C_OnInputReleasedDown;

// Function WB_RoomSelect_PairDecisionWindow.WB_RoomSelect_PairDecisionWindow_C.OnInputReleasedDecide
// 0x0001 (0x0001 - 0x0000)
struct WB_RoomSelect_PairDecisionWindow_C_OnInputReleasedDecide final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_RoomSelect_PairDecisionWindow_C_OnInputReleasedDecide;

// Function WB_RoomSelect_PairDecisionWindow.WB_RoomSelect_PairDecisionWindow_C.OnInputReleasedCancel
// 0x0001 (0x0001 - 0x0000)
struct WB_RoomSelect_PairDecisionWindow_C_OnInputReleasedCancel final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_RoomSelect_PairDecisionWindow_C_OnInputReleasedCancel;

// Function WB_RoomSelect_PairDecisionWindow.WB_RoomSelect_PairDecisionWindow_C.OnInputPressedUp
// 0x0001 (0x0001 - 0x0000)
struct WB_RoomSelect_PairDecisionWindow_C_OnInputPressedUp final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_RoomSelect_PairDecisionWindow_C_OnInputPressedUp;

// Function WB_RoomSelect_PairDecisionWindow.WB_RoomSelect_PairDecisionWindow_C.OnInputPressedTouch
// 0x000C (0x000C - 0x0000)
struct WB_RoomSelect_PairDecisionWindow_C_OnInputPressedTouch final
{
public:
	float                                         LocationX;                                         // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LocationY;                                         // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_RoomSelect_PairDecisionWindow_C_OnInputPressedTouch;

// Function WB_RoomSelect_PairDecisionWindow.WB_RoomSelect_PairDecisionWindow_C.OnInputPressedRight
// 0x0001 (0x0001 - 0x0000)
struct WB_RoomSelect_PairDecisionWindow_C_OnInputPressedRight final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_RoomSelect_PairDecisionWindow_C_OnInputPressedRight;

// Function WB_RoomSelect_PairDecisionWindow.WB_RoomSelect_PairDecisionWindow_C.OnInputPressedLeft
// 0x0001 (0x0001 - 0x0000)
struct WB_RoomSelect_PairDecisionWindow_C_OnInputPressedLeft final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_RoomSelect_PairDecisionWindow_C_OnInputPressedLeft;

// Function WB_RoomSelect_PairDecisionWindow.WB_RoomSelect_PairDecisionWindow_C.OnInputPressedDown
// 0x0001 (0x0001 - 0x0000)
struct WB_RoomSelect_PairDecisionWindow_C_OnInputPressedDown final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_RoomSelect_PairDecisionWindow_C_OnInputPressedDown;

// Function WB_RoomSelect_PairDecisionWindow.WB_RoomSelect_PairDecisionWindow_C.OnInputPressedDecide
// 0x0001 (0x0001 - 0x0000)
struct WB_RoomSelect_PairDecisionWindow_C_OnInputPressedDecide final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_RoomSelect_PairDecisionWindow_C_OnInputPressedDecide;

// Function WB_RoomSelect_PairDecisionWindow.WB_RoomSelect_PairDecisionWindow_C.OnInputPressedCancel
// 0x0001 (0x0001 - 0x0000)
struct WB_RoomSelect_PairDecisionWindow_C_OnInputPressedCancel final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_RoomSelect_PairDecisionWindow_C_OnInputPressedCancel;

// Function WB_RoomSelect_PairDecisionWindow.WB_RoomSelect_PairDecisionWindow_C.OnInputMoveRight
// 0x0008 (0x0008 - 0x0000)
struct WB_RoomSelect_PairDecisionWindow_C_OnInputMoveRight final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_RoomSelect_PairDecisionWindow_C_OnInputMoveRight;

// Function WB_RoomSelect_PairDecisionWindow.WB_RoomSelect_PairDecisionWindow_C.OnInputMoveForward
// 0x0008 (0x0008 - 0x0000)
struct WB_RoomSelect_PairDecisionWindow_C_OnInputMoveForward final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_RoomSelect_PairDecisionWindow_C_OnInputMoveForward;

// Function WB_RoomSelect_PairDecisionWindow.WB_RoomSelect_PairDecisionWindow_C.OnInputLookupRate
// 0x0008 (0x0008 - 0x0000)
struct WB_RoomSelect_PairDecisionWindow_C_OnInputLookupRate final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_RoomSelect_PairDecisionWindow_C_OnInputLookupRate;

// Function WB_RoomSelect_PairDecisionWindow.WB_RoomSelect_PairDecisionWindow_C.IsModeless
// 0x0001 (0x0001 - 0x0000)
struct WB_RoomSelect_PairDecisionWindow_C_IsModeless final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_RoomSelect_PairDecisionWindow_C_IsModeless;

// Function WB_RoomSelect_PairDecisionWindow.WB_RoomSelect_PairDecisionWindow_C.OnInputReleasedR2
// 0x0001 (0x0001 - 0x0000)
struct WB_RoomSelect_PairDecisionWindow_C_OnInputReleasedR2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_RoomSelect_PairDecisionWindow_C_OnInputReleasedR2;

// Function WB_RoomSelect_PairDecisionWindow.WB_RoomSelect_PairDecisionWindow_C.OnInputReleasedR1
// 0x0001 (0x0001 - 0x0000)
struct WB_RoomSelect_PairDecisionWindow_C_OnInputReleasedR1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_RoomSelect_PairDecisionWindow_C_OnInputReleasedR1;

// Function WB_RoomSelect_PairDecisionWindow.WB_RoomSelect_PairDecisionWindow_C.OnInputReleasedL2
// 0x0001 (0x0001 - 0x0000)
struct WB_RoomSelect_PairDecisionWindow_C_OnInputReleasedL2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_RoomSelect_PairDecisionWindow_C_OnInputReleasedL2;

// Function WB_RoomSelect_PairDecisionWindow.WB_RoomSelect_PairDecisionWindow_C.OnInputReleasedL1
// 0x0001 (0x0001 - 0x0000)
struct WB_RoomSelect_PairDecisionWindow_C_OnInputReleasedL1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_RoomSelect_PairDecisionWindow_C_OnInputReleasedL1;

// Function WB_RoomSelect_PairDecisionWindow.WB_RoomSelect_PairDecisionWindow_C.OnInputPressedR2
// 0x0001 (0x0001 - 0x0000)
struct WB_RoomSelect_PairDecisionWindow_C_OnInputPressedR2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_RoomSelect_PairDecisionWindow_C_OnInputPressedR2;

// Function WB_RoomSelect_PairDecisionWindow.WB_RoomSelect_PairDecisionWindow_C.OnInputPressedR1
// 0x0001 (0x0001 - 0x0000)
struct WB_RoomSelect_PairDecisionWindow_C_OnInputPressedR1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_RoomSelect_PairDecisionWindow_C_OnInputPressedR1;

// Function WB_RoomSelect_PairDecisionWindow.WB_RoomSelect_PairDecisionWindow_C.OnInputPressedL2
// 0x0001 (0x0001 - 0x0000)
struct WB_RoomSelect_PairDecisionWindow_C_OnInputPressedL2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_RoomSelect_PairDecisionWindow_C_OnInputPressedL2;

// Function WB_RoomSelect_PairDecisionWindow.WB_RoomSelect_PairDecisionWindow_C.OnInputPressedL1
// 0x0001 (0x0001 - 0x0000)
struct WB_RoomSelect_PairDecisionWindow_C_OnInputPressedL1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_RoomSelect_PairDecisionWindow_C_OnInputPressedL1;

// Function WB_RoomSelect_PairDecisionWindow.WB_RoomSelect_PairDecisionWindow_C.OnInputReleasedL3
// 0x0001 (0x0001 - 0x0000)
struct WB_RoomSelect_PairDecisionWindow_C_OnInputReleasedL3 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_RoomSelect_PairDecisionWindow_C_OnInputReleasedL3;

// Function WB_RoomSelect_PairDecisionWindow.WB_RoomSelect_PairDecisionWindow_C.OnInputPressedL3
// 0x0001 (0x0001 - 0x0000)
struct WB_RoomSelect_PairDecisionWindow_C_OnInputPressedL3 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_RoomSelect_PairDecisionWindow_C_OnInputPressedL3;

// Function WB_RoomSelect_PairDecisionWindow.WB_RoomSelect_PairDecisionWindow_C.OnInputPressedY
// 0x0001 (0x0001 - 0x0000)
struct WB_RoomSelect_PairDecisionWindow_C_OnInputPressedY final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_RoomSelect_PairDecisionWindow_C_OnInputPressedY;

// Function WB_RoomSelect_PairDecisionWindow.WB_RoomSelect_PairDecisionWindow_C.OnInputPressedX
// 0x0001 (0x0001 - 0x0000)
struct WB_RoomSelect_PairDecisionWindow_C_OnInputPressedX final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_RoomSelect_PairDecisionWindow_C_OnInputPressedX;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
