#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_RoomSelect_Button_Room

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WB_RoomSelect_Button_Room.WB_RoomSelect_Button_Room_C.ExecuteUbergraph_WB_RoomSelect_Button_Room
// 0x0080 (0x0080 - 0x0000)
struct WB_RoomSelect_Button_Room_C_ExecuteUbergraph_WB_RoomSelect_Button_Room final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0008(0x0018)()
	int32                                         K2Node_CustomEvent_PairIconID;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_PairLevel;                      // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_CustomEvent_PairName;                       // 0x0028(0x0018)()
	class FText                                   K2Node_CustomEvent_PairTitle;                      // 0x0040(0x0018)()
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue1;              // 0x0060(0x0018)()
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent;     // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_RoomSelect_Button_Room_C_ExecuteUbergraph_WB_RoomSelect_Button_Room;

// Function WB_RoomSelect_Button_Room.WB_RoomSelect_Button_Room_C.SetRoomInfo
// 0x0038 (0x0038 - 0x0000)
struct WB_RoomSelect_Button_Room_C_SetRoomInfo final
{
public:
	int32                                         PairIconID;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PairLevel;                                         // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   PairName;                                          // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   PairTitle;                                         // 0x0020(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WB_RoomSelect_Button_Room_C_SetRoomInfo;

// Function WB_RoomSelect_Button_Room.WB_RoomSelect_Button_Room_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_RoomSelect_Button_Room_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_RoomSelect_Button_Room_C_PreConstruct;

// Function WB_RoomSelect_Button_Room.WB_RoomSelect_Button_Room_C.GetButton
// 0x0008 (0x0008 - 0x0000)
struct WB_RoomSelect_Button_Room_C_GetButton final
{
public:
	class UAJBButton*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_RoomSelect_Button_Room_C_GetButton;

// Function WB_RoomSelect_Button_Room.WB_RoomSelect_Button_Room_C.IsEmptyRoom
// 0x000C (0x000C - 0x0000)
struct WB_RoomSelect_Button_Room_C_IsEmptyRoom final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_RoomSelect_Button_Room_C_IsEmptyRoom;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
