#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_RadioChatButtonList

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WB_RadioChatButtonList.WB_RadioChatButtonList_C.ExecuteUbergraph_WB_RadioChatButtonList
// 0x0060 (0x0060 - 0x0000)
struct WB_RadioChatButtonList_C_ExecuteUbergraph_WB_RadioChatButtonList final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate1;             // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	TArray<class UWB_RadioChatButton_C*>          CallFunc_GetButtons_ReturnValues;                  // 0x0030(0x0010)(ZeroConstructor, ReferenceParm)
	class UWB_RadioChatButton_C*                  CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWB_RadioChatButton_C*>          K2Node_MakeArray_Array;                            // 0x0048(0x0010)(ZeroConstructor, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_RadioChatButtonList_C_ExecuteUbergraph_WB_RadioChatButtonList;

// Function WB_RadioChatButtonList.WB_RadioChatButtonList_C.GetButtons
// 0x0010 (0x0010 - 0x0000)
struct WB_RadioChatButtonList_C_GetButtons final
{
public:
	TArray<class UWB_RadioChatButton_C*>          ReturnValues;                                      // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor)
};
DUMPER7_ASSERTS_WB_RadioChatButtonList_C_GetButtons;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
