#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Rarity

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WB_Rarity.WB_Rarity_C
// 0x0038 (0x0240 - 0x0208)
class UWB_Rarity_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UWB_EmptyStar_C*                        WB_Rare_1;                                         // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_EmptyStar_C*                        WB_Rare_2;                                         // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_EmptyStar_C*                        WB_Rare_3;                                         // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_EmptyStar_C*                        WB_Rare_4;                                         // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UWB_EmptyStar_C*>                RareWidgets;                                       // 0x0230(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WB_Rarity(int32 EntryPoint);
	void Update_StarMaterials(class UMaterialInterface* Material_EmptyStar, class UMaterialInterface* Material_FillStar);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void UpdateRera(int32 Rare);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_Rarity_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_Rarity_C")
	}
	static class UWB_Rarity_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_Rarity_C>();
	}
};
DUMPER7_ASSERTS_UWB_Rarity_C;

SDK_NAMESPACE_END
