#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_StartPointSelect

#include "Basic.hpp"

#include "Engine_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WB_StartPointSelect.WB_StartPointSelect_C.ExecuteUbergraph_WB_StartPointSelect
// 0x0110 (0x0110 - 0x0000)
struct WB_StartPointSelect_C_ExecuteUbergraph_WB_StartPointSelect final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetAJBCurrentAreaTitle_Title;             // 0x0008(0x0018)()
	class FText                                   CallFunc_GetAJBCurrentAreaTitle_Sub_Title;         // 0x0020(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0038(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData1;             // 0x0078(0x0040)(HasGetValueTypeHash)
	bool                                          CallFunc_GetAJBOutGameHUD_BP_bSuccess;             // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_AJBOutGameHUD_C*                    CallFunc_GetAJBOutGameHUD_BP_Out_Game_HUD;         // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00C8(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00D8(0x0018)()
	bool                                          CallFunc_GetAJBGameInstance_bSuccess;              // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_AJBGameInstance_C*                  CallFunc_GetAJBGameInstance_AJB_Game_Instance;     // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_RequestWwiseEventOnLocal_AkComponent;     // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStartLocationSelectTimeSecond_Second;  // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStartLocationSelectTimeSecond_SelectStartLocationMaxSecond; // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_StartPointSelect_C_ExecuteUbergraph_WB_StartPointSelect;

// Function WB_StartPointSelect.WB_StartPointSelect_C.OnInputTurnRate
// 0x0008 (0x0008 - 0x0000)
struct WB_StartPointSelect_C_OnInputTurnRate final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_StartPointSelect_C_OnInputTurnRate;

// Function WB_StartPointSelect.WB_StartPointSelect_C.OnInputReleasedUp
// 0x0001 (0x0001 - 0x0000)
struct WB_StartPointSelect_C_OnInputReleasedUp final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_StartPointSelect_C_OnInputReleasedUp;

// Function WB_StartPointSelect.WB_StartPointSelect_C.OnInputReleasedRight
// 0x0001 (0x0001 - 0x0000)
struct WB_StartPointSelect_C_OnInputReleasedRight final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_StartPointSelect_C_OnInputReleasedRight;

// Function WB_StartPointSelect.WB_StartPointSelect_C.OnInputReleasedLeft
// 0x0001 (0x0001 - 0x0000)
struct WB_StartPointSelect_C_OnInputReleasedLeft final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_StartPointSelect_C_OnInputReleasedLeft;

// Function WB_StartPointSelect.WB_StartPointSelect_C.OnInputReleasedDown
// 0x0001 (0x0001 - 0x0000)
struct WB_StartPointSelect_C_OnInputReleasedDown final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_StartPointSelect_C_OnInputReleasedDown;

// Function WB_StartPointSelect.WB_StartPointSelect_C.OnInputReleasedDecide
// 0x0001 (0x0001 - 0x0000)
struct WB_StartPointSelect_C_OnInputReleasedDecide final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_StartPointSelect_C_OnInputReleasedDecide;

// Function WB_StartPointSelect.WB_StartPointSelect_C.OnInputReleasedCancel
// 0x0001 (0x0001 - 0x0000)
struct WB_StartPointSelect_C_OnInputReleasedCancel final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_StartPointSelect_C_OnInputReleasedCancel;

// Function WB_StartPointSelect.WB_StartPointSelect_C.OnInputPressedUp
// 0x0001 (0x0001 - 0x0000)
struct WB_StartPointSelect_C_OnInputPressedUp final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_StartPointSelect_C_OnInputPressedUp;

// Function WB_StartPointSelect.WB_StartPointSelect_C.OnInputPressedRight
// 0x0001 (0x0001 - 0x0000)
struct WB_StartPointSelect_C_OnInputPressedRight final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_StartPointSelect_C_OnInputPressedRight;

// Function WB_StartPointSelect.WB_StartPointSelect_C.OnInputPressedLeft
// 0x0001 (0x0001 - 0x0000)
struct WB_StartPointSelect_C_OnInputPressedLeft final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_StartPointSelect_C_OnInputPressedLeft;

// Function WB_StartPointSelect.WB_StartPointSelect_C.OnInputPressedDown
// 0x0001 (0x0001 - 0x0000)
struct WB_StartPointSelect_C_OnInputPressedDown final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_StartPointSelect_C_OnInputPressedDown;

// Function WB_StartPointSelect.WB_StartPointSelect_C.OnInputPressedDecide
// 0x0001 (0x0001 - 0x0000)
struct WB_StartPointSelect_C_OnInputPressedDecide final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_StartPointSelect_C_OnInputPressedDecide;

// Function WB_StartPointSelect.WB_StartPointSelect_C.OnInputPressedCancel
// 0x0001 (0x0001 - 0x0000)
struct WB_StartPointSelect_C_OnInputPressedCancel final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_StartPointSelect_C_OnInputPressedCancel;

// Function WB_StartPointSelect.WB_StartPointSelect_C.OnInputMoveRight
// 0x0008 (0x0008 - 0x0000)
struct WB_StartPointSelect_C_OnInputMoveRight final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_StartPointSelect_C_OnInputMoveRight;

// Function WB_StartPointSelect.WB_StartPointSelect_C.OnInputMoveForward
// 0x0008 (0x0008 - 0x0000)
struct WB_StartPointSelect_C_OnInputMoveForward final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_StartPointSelect_C_OnInputMoveForward;

// Function WB_StartPointSelect.WB_StartPointSelect_C.OnInputLookupRate
// 0x0008 (0x0008 - 0x0000)
struct WB_StartPointSelect_C_OnInputLookupRate final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_StartPointSelect_C_OnInputLookupRate;

// Function WB_StartPointSelect.WB_StartPointSelect_C.IsModeless
// 0x0001 (0x0001 - 0x0000)
struct WB_StartPointSelect_C_IsModeless final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_StartPointSelect_C_IsModeless;

// Function WB_StartPointSelect.WB_StartPointSelect_C.OnInputReleasedTouch
// 0x0001 (0x0001 - 0x0000)
struct WB_StartPointSelect_C_OnInputReleasedTouch final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_StartPointSelect_C_OnInputReleasedTouch;

// Function WB_StartPointSelect.WB_StartPointSelect_C.OnInputPressedTouch
// 0x000C (0x000C - 0x0000)
struct WB_StartPointSelect_C_OnInputPressedTouch final
{
public:
	float                                         LocationX;                                         // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LocationY;                                         // 0x0004(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_StartPointSelect_C_OnInputPressedTouch;

// Function WB_StartPointSelect.WB_StartPointSelect_C.OnInputReleasedR2
// 0x0001 (0x0001 - 0x0000)
struct WB_StartPointSelect_C_OnInputReleasedR2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_StartPointSelect_C_OnInputReleasedR2;

// Function WB_StartPointSelect.WB_StartPointSelect_C.OnInputReleasedR1
// 0x0001 (0x0001 - 0x0000)
struct WB_StartPointSelect_C_OnInputReleasedR1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_StartPointSelect_C_OnInputReleasedR1;

// Function WB_StartPointSelect.WB_StartPointSelect_C.OnInputReleasedL3
// 0x0001 (0x0001 - 0x0000)
struct WB_StartPointSelect_C_OnInputReleasedL3 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_StartPointSelect_C_OnInputReleasedL3;

// Function WB_StartPointSelect.WB_StartPointSelect_C.OnInputReleasedL2
// 0x0001 (0x0001 - 0x0000)
struct WB_StartPointSelect_C_OnInputReleasedL2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_StartPointSelect_C_OnInputReleasedL2;

// Function WB_StartPointSelect.WB_StartPointSelect_C.OnInputReleasedL1
// 0x0001 (0x0001 - 0x0000)
struct WB_StartPointSelect_C_OnInputReleasedL1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_StartPointSelect_C_OnInputReleasedL1;

// Function WB_StartPointSelect.WB_StartPointSelect_C.OnInputPressedR2
// 0x0001 (0x0001 - 0x0000)
struct WB_StartPointSelect_C_OnInputPressedR2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_StartPointSelect_C_OnInputPressedR2;

// Function WB_StartPointSelect.WB_StartPointSelect_C.OnInputPressedR1
// 0x0001 (0x0001 - 0x0000)
struct WB_StartPointSelect_C_OnInputPressedR1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_StartPointSelect_C_OnInputPressedR1;

// Function WB_StartPointSelect.WB_StartPointSelect_C.OnInputPressedL3
// 0x0001 (0x0001 - 0x0000)
struct WB_StartPointSelect_C_OnInputPressedL3 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_StartPointSelect_C_OnInputPressedL3;

// Function WB_StartPointSelect.WB_StartPointSelect_C.OnInputPressedL2
// 0x0001 (0x0001 - 0x0000)
struct WB_StartPointSelect_C_OnInputPressedL2 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_StartPointSelect_C_OnInputPressedL2;

// Function WB_StartPointSelect.WB_StartPointSelect_C.OnInputPressedL1
// 0x0001 (0x0001 - 0x0000)
struct WB_StartPointSelect_C_OnInputPressedL1 final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_StartPointSelect_C_OnInputPressedL1;

// Function WB_StartPointSelect.WB_StartPointSelect_C.OnInputPressedY
// 0x0001 (0x0001 - 0x0000)
struct WB_StartPointSelect_C_OnInputPressedY final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_StartPointSelect_C_OnInputPressedY;

// Function WB_StartPointSelect.WB_StartPointSelect_C.OnInputPressedX
// 0x0001 (0x0001 - 0x0000)
struct WB_StartPointSelect_C_OnInputPressedX final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_StartPointSelect_C_OnInputPressedX;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
