#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_StarIcon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_classes.hpp"
#include "UMG_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WB_StarIcon.WB_StarIcon_C
// 0x0020 (0x0268 - 0x0248)
class UWB_StarIcon_C final : public UAJBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0248(0x0008)(Transient, DuplicateTransient)
	class UHorizontalBox*                         StarRoot;                                          // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         StarNum;                                           // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             StarImage;                                         // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_StarIcon(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void UpdateStar(int32 Num);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_StarIcon_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_StarIcon_C")
	}
	static class UWB_StarIcon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_StarIcon_C>();
	}
};
DUMPER7_ASSERTS_UWB_StarIcon_C;

SDK_NAMESPACE_END
