#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ScoreBoardRow

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WB_ScoreBoardRow.WB_ScoreBoardRow_C.ExecuteUbergraph_WB_ScoreBoardRow
// 0x0078 (0x0078 - 0x0000)
struct WB_ScoreBoardRow_C_ExecuteUbergraph_WB_ScoreBoardRow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_KnockOut;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_TotalDamage;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0018)()
	class FText                                   CallFunc_Conv_IntToText_ReturnValue1;              // 0x0028(0x0018)()
	struct FLinearColor                           K2Node_CustomEvent_Color;                          // 0x0040(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0050(0x0028)()
};
DUMPER7_ASSERTS_WB_ScoreBoardRow_C_ExecuteUbergraph_WB_ScoreBoardRow;

// Function WB_ScoreBoardRow.WB_ScoreBoardRow_C.SetNameColor
// 0x0010 (0x0010 - 0x0000)
struct WB_ScoreBoardRow_C_SetNameColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_ScoreBoardRow_C_SetNameColor;

// Function WB_ScoreBoardRow.WB_ScoreBoardRow_C.SetNewValues
// 0x0008 (0x0008 - 0x0000)
struct WB_ScoreBoardRow_C_SetNewValues final
{
public:
	int32                                         KnockOut;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalDamage_0;                                     // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_ScoreBoardRow_C_SetNewValues;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
