#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_SPframe

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WB_SPframe.WB_SPframe_C.ExecuteUbergraph_WB_SPframe
// 0x0008 (0x0008 - 0x0000)
struct WB_SPframe_C_ExecuteUbergraph_WB_SPframe final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Condition;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsVisible;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_CustomEvent_IsFill;                         // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_SPframe_C_ExecuteUbergraph_WB_SPframe;

// Function WB_SPframe.WB_SPframe_C.UpdateSPframe
// 0x0001 (0x0001 - 0x0000)
struct WB_SPframe_C_UpdateSPframe final
{
public:
	bool                                          IsFill;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_SPframe_C_UpdateSPframe;

// Function WB_SPframe.WB_SPframe_C.VisibleSPframe
// 0x0001 (0x0001 - 0x0000)
struct WB_SPframe_C_VisibleSPframe final
{
public:
	bool                                          IsVisible_0;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_SPframe_C_VisibleSPframe;

// Function WB_SPframe.WB_SPframe_C.SetAwakingAbilityIcon
// 0x0001 (0x0001 - 0x0000)
struct WB_SPframe_C_SetAwakingAbilityIcon final
{
public:
	bool                                          Condition;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_SPframe_C_SetAwakingAbilityIcon;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
