#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_SkillPartsTimer

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WB_SkillPartsTimer.WB_SkillPartsTimer_C.ExecuteUbergraph_WB_SkillPartsTimer
// 0x0028 (0x0028 - 0x0000)
struct WB_SkillPartsTimer_C_ExecuteUbergraph_WB_SkillPartsTimer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Value;                          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bColorTypeRed;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_FloatToText_ReturnValue;             // 0x0010(0x0018)()
};
DUMPER7_ASSERTS_WB_SkillPartsTimer_C_ExecuteUbergraph_WB_SkillPartsTimer;

// Function WB_SkillPartsTimer.WB_SkillPartsTimer_C.ChangeColorType
// 0x0001 (0x0001 - 0x0000)
struct WB_SkillPartsTimer_C_ChangeColorType final
{
public:
	bool                                          bColorTypeRed;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_SkillPartsTimer_C_ChangeColorType;

// Function WB_SkillPartsTimer.WB_SkillPartsTimer_C.UpdateTimer
// 0x0004 (0x0004 - 0x0000)
struct WB_SkillPartsTimer_C_UpdateTimer final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_SkillPartsTimer_C_UpdateTimer;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
