#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_SkillGuide

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WB_SkillGuide.WB_SkillGuide_C
// 0x0058 (0x0260 - 0x0208)
class UWB_SkillGuide_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Appear;                                            // 0x0210(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           GuideRoot;                                         // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_GuideBG_C*                          WB_GuideBG;                                        // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         Timer;                                             // 0x0228(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22C[0x4];                                      // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWB_SkillGuideText_C*>           UnusedGuideText;                                   // 0x0230(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	UMulticastDelegateProperty_                   OnAppearDispatcher;                                // 0x0240(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	UMulticastDelegateProperty_                   OnDisappearDispatcher;                             // 0x0250(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_WB_SkillGuide(int32 EntryPoint);
	void Construct();
	void OnCloseTickGate();
	void OnOpenTickGate();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void ResetGuide();
	void UnbindDisappearAnimation();
	void OnFinishedDisappear();
	void PlayDisappearAnimation();
	void PlayAppearAnimation(const struct FAJBSkillGuideInfo& GuideInfo);
	void PopUnusedGuideText(class UWB_SkillGuideText_C** Output, bool* bCreate);
	void PushUnusedGuideText(const class UWidget*& NewItem);
	void RemoveChildren();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_SkillGuide_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_SkillGuide_C")
	}
	static class UWB_SkillGuide_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_SkillGuide_C>();
	}
};
DUMPER7_ASSERTS_UWB_SkillGuide_C;

SDK_NAMESPACE_END
