#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_SkillPartsTimer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WB_SkillPartsTimer.WB_SkillPartsTimer_C
// 0x00B8 (0x02C0 - 0x0208)
class UWB_SkillPartsTimer_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UAJBImage*                              BG;                                                // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          TimeText;                                          // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateColor                            DefaultTextColor;                                  // 0x0220(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            DefaultBGTint;                                     // 0x0248(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            RedTextColor;                                      // 0x0270(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	struct FSlateColor                            RedBGTint;                                         // 0x0298(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WB_SkillPartsTimer(int32 EntryPoint);
	void Construct();
	void ResetColor();
	void ChangeColorType(bool bColorTypeRed);
	void UpdateTimer(float Value);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_SkillPartsTimer_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_SkillPartsTimer_C")
	}
	static class UWB_SkillPartsTimer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_SkillPartsTimer_C>();
	}
};
DUMPER7_ASSERTS_UWB_SkillPartsTimer_C;

SDK_NAMESPACE_END
