#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Tutorial_GamePadGuide

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WB_Tutorial_GamePadGuide.WB_Tutorial_GamePadGuide_C
// 0x0058 (0x0260 - 0x0208)
class UWB_Tutorial_GamePadGuide_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UAJBImage*                              HighlightEffect;                                   // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              IMG_GamePad_Left;                                  // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              IMG_GamePad_right;                                 // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                              ScaleBox_FittingPosition;                          // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<struct FVector>                        PositionAndScale;                                  // 0x0230(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	TArray<struct FVector>                        Texture_Mirror_MIVariable;                         // 0x0240(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	int32                                         Index_0;                                           // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_254[0x4];                                      // 0x0254(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               DynamicMaterial;                                   // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_Tutorial_GamePadGuide(int32 EntryPoint);
	void Construct();
	void ButtonEffectSettings(EAJBPadIconType PadIconType);
	void ConvertIndex(EAJBPadIconType Selection);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_Tutorial_GamePadGuide_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_Tutorial_GamePadGuide_C")
	}
	static class UWB_Tutorial_GamePadGuide_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_Tutorial_GamePadGuide_C>();
	}
};
DUMPER7_ASSERTS_UWB_Tutorial_GamePadGuide_C;

SDK_NAMESPACE_END
