#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_TestModeMenuItemInteger

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WB_TestModeMenuItemInteger.WB_TestModeMenuItemInteger_C.ExecuteUbergraph_WB_TestModeMenuItemInteger
// 0x0008 (0x0008 - 0x0000)
struct WB_TestModeMenuItemInteger_C_ExecuteUbergraph_WB_TestModeMenuItemInteger final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_Value;                                // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_TestModeMenuItemInteger_C_ExecuteUbergraph_WB_TestModeMenuItemInteger;

// Function WB_TestModeMenuItemInteger.WB_TestModeMenuItemInteger_C.SetSelectValue
// 0x0004 (0x0004 - 0x0000)
struct WB_TestModeMenuItemInteger_C_SetSelectValue final
{
public:
	int32                                         Value_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_TestModeMenuItemInteger_C_SetSelectValue;

// Function WB_TestModeMenuItemInteger.WB_TestModeMenuItemInteger_C.ValueDown
// 0x000C (0x000C - 0x0000)
struct WB_TestModeMenuItemInteger_C_ValueDown final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ValueDown_ReturnValue;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_TestModeMenuItemInteger_C_ValueDown;

// Function WB_TestModeMenuItemInteger.WB_TestModeMenuItemInteger_C.ValueUp
// 0x000C (0x000C - 0x0000)
struct WB_TestModeMenuItemInteger_C_ValueUp final
{
public:
	bool                                          IsMax;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ValueUp_IsMax;                            // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_TestModeMenuItemInteger_C_ValueUp;

// Function WB_TestModeMenuItemInteger.WB_TestModeMenuItemInteger_C.IsDefaultValue
// 0x0002 (0x0002 - 0x0000)
struct WB_TestModeMenuItemInteger_C_IsDefaultValue final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_TestModeMenuItemInteger_C_IsDefaultValue;

// Function WB_TestModeMenuItemInteger.WB_TestModeMenuItemInteger_C.GetValueText
// 0x0030 (0x0030 - 0x0000)
struct WB_TestModeMenuItemInteger_C_GetValueText final
{
public:
	class FText                                   OutText;                                           // 0x0000(0x0018)(Parm, OutParm)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0018(0x0018)()
};
DUMPER7_ASSERTS_WB_TestModeMenuItemInteger_C_GetValueText;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
