#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_TournamentMode_UltimateLogWindow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WB_TournamentMode_UltimateLogWindow.WB_TournamentMode_UltimateLogWindow_C
// 0x0048 (0x0290 - 0x0248)
class UWB_TournamentMode_UltimateLogWindow_C final : public UAJBUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0248(0x0008)(Transient, DuplicateTransient)
	class UVerticalBox*                           LogRoot;                                           // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         MaxLogNum;                                         // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWB_TournamentMode_UltimateLogColumn_C*> LogColumns;                                // 0x0260(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UWB_TournamentMode_UltimateLogColumn_C* Temp_Column;                                       // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DisplayTime;                                       // 0x0278(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_27C[0x4];                                      // 0x027C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	UMulticastDelegateProperty_                   OnDecidedUltimateWindowButton;                     // 0x0280(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_WB_TournamentMode_UltimateLogWindow(int32 EntryPoint);
	void Construct();
	void OnDecided(int32 PlayerID);
	void RequestUltimateLog(int32 PlayerID, const struct FGameplayTag& SkillTag);
	void UpdateCharaParam(const struct FST_ShopCompetitionUICharaParam& CharaParam);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_TournamentMode_UltimateLogWindow_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_TournamentMode_UltimateLogWindow_C")
	}
	static class UWB_TournamentMode_UltimateLogWindow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_TournamentMode_UltimateLogWindow_C>();
	}
};
DUMPER7_ASSERTS_UWB_TournamentMode_UltimateLogWindow_C;

SDK_NAMESPACE_END
