#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_TestModeMenuItem_StatusLockButton

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WB_TestModeMenuItem_StatusLockButton.WB_TestModeMenuItem_StatusLockButton_C.ExecuteUbergraph_WB_TestModeMenuItem_StatusLockButton
// 0x00B8 (0x00B8 - 0x0000)
struct WB_TestModeMenuItem_StatusLockButton_C_ExecuteUbergraph_WB_TestModeMenuItem_StatusLockButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0008(0x0028)()
	bool                                          CallFunc_IsLock_result;                            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0050(0x0008)(NoDestructor)
	class UTextBlock*                             CallFunc_SpawnObject_ReturnValue;                  // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0060(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue;             // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_Select_Default;                             // 0x0078(0x0010)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor1;                     // 0x0088(0x0028)()
	bool                                          CallFunc_Not_PreBool_ReturnValue1;                 // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_TestModeMenuItem_StatusLockButton_C_ExecuteUbergraph_WB_TestModeMenuItem_StatusLockButton;

// Function WB_TestModeMenuItem_StatusLockButton.WB_TestModeMenuItem_StatusLockButton_C.SetStatusText
// 0x0018 (0x0018 - 0x0000)
struct WB_TestModeMenuItem_StatusLockButton_C_SetStatusText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
DUMPER7_ASSERTS_WB_TestModeMenuItem_StatusLockButton_C_SetStatusText;

// Function WB_TestModeMenuItem_StatusLockButton.WB_TestModeMenuItem_StatusLockButton_C.SetStatusColor
// 0x0048 (0x0048 - 0x0000)
struct WB_TestModeMenuItem_StatusLockButton_C_SetStatusColor final
{
public:
	struct FLinearColor                           BaseColor;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DarkColor;                                         // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0020(0x0028)()
};
DUMPER7_ASSERTS_WB_TestModeMenuItem_StatusLockButton_C_SetStatusColor;

// Function WB_TestModeMenuItem_StatusLockButton.WB_TestModeMenuItem_StatusLockButton_C.StartStatusBlink
// 0x0018 (0x0018 - 0x0000)
struct WB_TestModeMenuItem_StatusLockButton_C_StartStatusBlink final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0010(0x0008)(NoDestructor)
};
DUMPER7_ASSERTS_WB_TestModeMenuItem_StatusLockButton_C_StartStatusBlink;

// Function WB_TestModeMenuItem_StatusLockButton.WB_TestModeMenuItem_StatusLockButton_C.StopStatusBlink
// 0x0028 (0x0028 - 0x0000)
struct WB_TestModeMenuItem_StatusLockButton_C_StopStatusBlink final
{
public:
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0000(0x0028)()
};
DUMPER7_ASSERTS_WB_TestModeMenuItem_StatusLockButton_C_StopStatusBlink;

// Function WB_TestModeMenuItem_StatusLockButton.WB_TestModeMenuItem_StatusLockButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_TestModeMenuItem_StatusLockButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_TestModeMenuItem_StatusLockButton_C_PreConstruct;

// Function WB_TestModeMenuItem_StatusLockButton.WB_TestModeMenuItem_StatusLockButton_C.IsLock
// 0x0002 (0x0002 - 0x0000)
struct WB_TestModeMenuItem_StatusLockButton_C_IsLock final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLock_result;                            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WB_TestModeMenuItem_StatusLockButton_C_IsLock;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
