#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_TestModeMenuItem_StatusLockButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "WB_TestModeMenuItemBase_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WB_TestModeMenuItem_StatusLockButton.WB_TestModeMenuItem_StatusLockButton_C
// 0x0068 (0x0360 - 0x02F8)
class UWB_TestModeMenuItem_StatusLockButton_C final : public UWB_TestModeMenuItemBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WB_TestModeMenuItem_StatusLockButton_C; // 0x02F8(0x0008)(Transient, DuplicateTransient)
	class UTextBlock*                             StatusText;                                        // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsLock;                                           // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_309[0x7];                                      // 0x0309(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CheckStatusTimer;                                  // 0x0310(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	UMulticastDelegateProperty_                   OnCheckStatusTick;                                 // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         StatusOffsetX;                                     // 0x0328(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FLinearColor                           StatusTextColor;                                   // 0x032C(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33C[0x4];                                      // 0x033C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           BlinkStatusTimer;                                  // 0x0340(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          bStatusBlink;                                      // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_349[0x3];                                      // 0x0349(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           StatusDarkColor;                                   // 0x034C(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_TestModeMenuItem_StatusLockButton(int32 EntryPoint);
	void StatusBlinkAnim();
	void CheckStatusTick();
	void Construct();
	void OnDecide();
	void UnLock();
	void SetStatusText(const class FText& Text);
	void SetStatusColor(const struct FLinearColor& BaseColor, const struct FLinearColor& DarkColor);
	void StartStatusBlink();
	void StopStatusBlink();
	void PreConstruct(bool IsDesignTime);
	void ModifyLabelColor();
	void IsLock(bool* Result);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_TestModeMenuItem_StatusLockButton_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_TestModeMenuItem_StatusLockButton_C")
	}
	static class UWB_TestModeMenuItem_StatusLockButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_TestModeMenuItem_StatusLockButton_C>();
	}
};
DUMPER7_ASSERTS_UWB_TestModeMenuItem_StatusLockButton_C;

SDK_NAMESPACE_END
