#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_TutorialInGameInputGuide

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WB_TutorialInGameInputGuide.WB_TutorialInGameInputGuide_C
// 0x0028 (0x0230 - 0x0208)
class UWB_TutorialInGameInputGuide_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Disappear;                                         // 0x0210(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              BG;                                                // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_GuideBG_C*                          WB_GuideBG;                                        // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SkillGuide_C*                       SkillGuideWidget;                                  // 0x0228(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_TutorialInGameInputGuide(int32 EntryPoint);
	void OnAppearSkillGuide();
	void OnDisappearSkillGuide();
	void SetSkillGuide(class UWB_SkillGuide_C* SkillGuideWidget_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_TutorialInGameInputGuide_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_TutorialInGameInputGuide_C")
	}
	static class UWB_TutorialInGameInputGuide_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_TutorialInGameInputGuide_C>();
	}
};
DUMPER7_ASSERTS_UWB_TutorialInGameInputGuide_C;

SDK_NAMESPACE_END
