#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_UI_PairDownEffect

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WB_UI_PairDownEffect.WB_UI_PairDownEffect_C
// 0x0028 (0x0230 - 0x0208)
class UWB_UI_PairDownEffect_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Scale;                                        // 0x0210(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_23;                                       // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_24;                                       // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bPlayAnimation;                                    // 0x0228(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WB_UI_PairDownEffect(int32 EntryPoint);
	void OnFinishedAnim();
	void TryPlayPairDownAnimation();
	void TryStopPairDownAnimation();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_UI_PairDownEffect_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_UI_PairDownEffect_C")
	}
	static class UWB_UI_PairDownEffect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_UI_PairDownEffect_C>();
	}
};
DUMPER7_ASSERTS_UWB_UI_PairDownEffect_C;

SDK_NAMESPACE_END
