#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_VictoryShotCustomizeSelecter

#include "Basic.hpp"


SDK_NAMESPACE_START
SDK_PARAM_NAMESPACE_START

// Function WB_VictoryShotCustomizeSelecter.WB_VictoryShotCustomizeSelecter_C.ExecuteUbergraph_WB_VictoryShotCustomizeSelecter
// 0x0050 (0x0050 - 0x0000)
struct WB_VictoryShotCustomizeSelecter_C_ExecuteUbergraph_WB_VictoryShotCustomizeSelecter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Temp_text_Variable;                                // 0x0008(0x0018)()
	class FText                                   Temp_text_Variable1;                               // 0x0020(0x0018)()
	class FText                                   K2Node_Select_Default;                             // 0x0038(0x0018)()
};
DUMPER7_ASSERTS_WB_VictoryShotCustomizeSelecter_C_ExecuteUbergraph_WB_VictoryShotCustomizeSelecter;

SDK_PARAM_NAMESPACE_END
SDK_NAMESPACE_END
