#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_VictoryShotCameraGuide

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "AJB_structs.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WB_VictoryShotCameraGuide.WB_VictoryShotCameraGuide_C
// 0x0058 (0x0260 - 0x0208)
class UWB_VictoryShotCameraGuide_C final : public UUserWidget
{
public:
	class UAJBImage*                              BG;                                                // 0x0208(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ButtonGuideText_C*                  WB_ButtonGuideText;                                // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ButtonGuideText_C*                  WB_ButtonGuideText_0;                              // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ButtonGuideText_C*                  WB_ButtonGuideText_1;                              // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ButtonGuideText_C*                  WB_ButtonGuideText_2;                              // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ButtonGuideText_C*                  WB_ButtonGuideText_3;                              // 0x0230(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ButtonGuideText_C*                  WB_ButtonGuideText_4;                              // 0x0238(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ButtonGuideText_C*                  WB_ButtonGuideText_5;                              // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ButtonGuideText_C*                  WB_ButtonGuideText_6;                              // 0x0248(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ButtonGuideText_C*                  WB_ButtonGuideText_7;                              // 0x0250(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_ButtonGuideText_C*                  WB_ButtonGuideText_8;                              // 0x0258(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void UpdateShotPadType();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_VictoryShotCameraGuide_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_VictoryShotCameraGuide_C")
	}
	static class UWB_VictoryShotCameraGuide_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_VictoryShotCameraGuide_C>();
	}
};
DUMPER7_ASSERTS_UWB_VictoryShotCameraGuide_C;

SDK_NAMESPACE_END
