#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_VictoryShotCameraReticle

#include "Basic.hpp"

#include "UMG_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WB_VictoryShotCameraReticle.WB_VictoryShotCameraReticle_C
// 0x0028 (0x0230 - 0x0208)
class UWB_VictoryShotCameraReticle_C final : public UUserWidget
{
public:
	class UAJBImage*                              AJBImage_0;                                        // 0x0208(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_BottomLeft;                               // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_BottomRight;                              // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_TopLeft;                                  // 0x0220(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_TopRight;                                 // 0x0228(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_VictoryShotCameraReticle_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_VictoryShotCameraReticle_C")
	}
	static class UWB_VictoryShotCameraReticle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_VictoryShotCameraReticle_C>();
	}
};
DUMPER7_ASSERTS_UWB_VictoryShotCameraReticle_C;

SDK_NAMESPACE_END
