#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_WindowFrame

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WB_WindowFrame.WB_WindowFrame_C
// 0x0038 (0x0240 - 0x0208)
class UWB_WindowFrame_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UOverlay*                               TitleRoot;                                         // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          Txt_Title;                                         // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Title;                                             // 0x0220(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly)
	bool                                          bVisibleTitle;                                     // 0x0238(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WB_WindowFrame(int32 EntryPoint);
	void SetTextTitle(const class FText& InText);
	void SetVisibleTitle(bool bVisible);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_WindowFrame_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_WindowFrame_C")
	}
	static class UWB_WindowFrame_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_WindowFrame_C>();
	}
};
DUMPER7_ASSERTS_UWB_WindowFrame_C;

SDK_NAMESPACE_END
