#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_WaitingOtherPlayers

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AJB_classes.hpp"


SDK_NAMESPACE_START

// WidgetBlueprintGeneratedClass WB_WaitingOtherPlayers.WB_WaitingOtherPlayers_C
// 0x0058 (0x0318 - 0x02C0)
class UWB_WaitingOtherPlayers_C final : public UAJBWindowWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(Transient, DuplicateTransient)
	class UWidgetAnimation*                       Appear;                                            // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBImage*                              AJBImage_70;                                       // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAJBTextBlock*                          AJBTextBlock_51;                                   // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UObject*                                LastPlayWaitingSE;                                 // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   WaitingOtherText;                                  // 0x02E8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	class FText                                   SelectedChipText;                                  // 0x0300(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)

public:
	void ExecuteUbergraph_WB_WaitingOtherPlayers(int32 EntryPoint);
	void OnClosingWindow();
	void OnOpeningWindow();
	void UpdateText_SelectedChip();
	void UpdateText_WaitingOtherPlayers();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_WaitingOtherPlayers_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_WaitingOtherPlayers_C")
	}
	static class UWB_WaitingOtherPlayers_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_WaitingOtherPlayers_C>();
	}
};
DUMPER7_ASSERTS_UWB_WaitingOtherPlayers_C;

SDK_NAMESPACE_END
