#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GM_AJBUserInterface

#include "../SDK/Basic.hpp"

#include "../SDK/Engine_structs.hpp"
#include "../SDK/Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GM_AJBUserInterface.GM_AJBUserInterface_C
// 0x0030 (0x03F8 - 0x03C8)
class AGM_AJBUserInterface_C final : public AGameModeBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C8(0x0008)(Transient, DuplicateTransient)
	class UBPAC_LoadTags_C*                       BPAC_LoadTags;                                     // 0x03D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x03D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FString                                 VersioningInfo;                                    // 0x03E0(0x0010)(Edit, BlueprintVisible)
	class UUserWidget*                            CurrentScopeWidget;                                // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void SetGlobalGameModeScopeVersioningInfo(class FString* NewVersioningInfo);
	void ReceiveBeginPlay();
	FText* GetVersioningInfo();
	void ExecuteUbergraph_GM_AJBUserInterface(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GM_AJBUserInterface_C");
	}
	static class AGM_AJBUserInterface_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGM_AJBUserInterface_C>();
	}

	template <class UClass>
	UClass* GetCurrentScopeWidget()
	{
		return reinterpret_cast<UClass*>(CurrentScopeWidget);
	}

};
static_assert(alignof(AGM_AJBUserInterface_C) == 0x000008, "Wrong alignment on AGM_AJBUserInterface_C"); \
static_assert(sizeof(AGM_AJBUserInterface_C) == 0x0003F8, "Wrong size on AGM_AJBUserInterface_C"); \
static_assert(offsetof(AGM_AJBUserInterface_C, UberGraphFrame) == 0x0003C8, "Member 'AGM_AJBUserInterface_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGM_AJBUserInterface_C, BPAC_LoadTags) == 0x0003D0, "Member 'AGM_AJBUserInterface_C::BPAC_LoadTags' has a wrong offset!");
static_assert(offsetof(AGM_AJBUserInterface_C, DefaultSceneRoot) == 0x0003D8, "Member 'AGM_AJBUserInterface_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AGM_AJBUserInterface_C, VersioningInfo) == 0x0003E0, "Member 'AGM_AJBUserInterface_C::VersioningInfo' has a wrong offset!");
static_assert(offsetof(AGM_AJBUserInterface_C, CurrentScopeWidget) == 0x0003F0, "Member 'AGM_AJBUserInterface_C::CurrentScopeWidget' has a wrong offset!");

}
