#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LemonHelper

#include "../SDK/Basic.hpp"

#include "../SDK/CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function LemonHelper.LemonHelper_C.PlayICannotBelieveThis
// 0x0050 (0x0050 - 0x0000)
struct LemonHelper_C_PlayICannotBelieveThis final
{
public:
	class UMediaSource*                           BestMusicVideoEver;                                // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OpenSource_ReturnValue;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMediaSoundComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function LemonHelper.LemonHelper_C.PlayCandyCaneRant
// 0x0050 (0x0050 - 0x0000)
struct LemonHelper_C_PlayCandyCaneRant final
{
public:
	class UMediaSource*                           CandyCanesVideo;                                   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0010(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_OpenSource_ReturnValue;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMediaSoundComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0048(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function LemonHelper.LemonHelper_C.PlayGrayscaleLemonPossession
// 0x0001 (0x0001 - 0x0000)
struct LemonHelper_C_PlayGrayscaleLemonPossession final
{
public:
	bool                                          CallFunc_OpenSource_ReturnValue;                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function LemonHelper.LemonHelper_C.PlayColoredLemonPossession
// 0x0001 (0x0001 - 0x0000)
struct LemonHelper_C_PlayColoredLemonPossession final
{
public:
	bool                                          CallFunc_OpenSource_ReturnValue;                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

}

