#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_CallbackTimerHandler

#include "../SDK/Basic.hpp"

#include "../SDK/Engine_structs.hpp"
#include "../SDK/UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_CallbackTimerHandler.WBP_CallbackTimerHandler_C
// 0x0050 (0x0258 - 0x0208)
class UWBP_CallbackTimerHandler_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0208(0x0008)(Transient, DuplicateTransient)
	class UBorder*                                MaterialCacher;                                    // 0x0210(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TXT_Timer;                                         // 0x0218(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<float>                                 fWaitForArray;                                     // 0x0220(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	TArray<int32>                                 pUpperArray;                                       // 0x0230(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	TArray<int32>                                 pLowerArray;                                       // 0x0240(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	bool                                          bAllowTextUpdates;                                 // 0x0250(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	int32 AddToArrays(float fWaitFor, int32 pUpper, int32 pLower);
	int32 RemoveFromArrays(int32 Index);
	void SetCallbackTimer(float fWaitFor, int32 pCallbackUpper, int32 pCallbackLower);
	void Construct();
	void InternalTick();
	void TimerTick(const int32& ArrayIndex);
	void ExecuteUbergraph_WBP_CallbackTimerHandler(int32 EntryPoint);

	void CacheMaterial(class UMaterial* MaterialToCache) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_CallbackTimerHandler_C");
	}
	static class UWBP_CallbackTimerHandler_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_CallbackTimerHandler_C>();
	}
};

}

